[Survived] ObjectLiteral
src/plugin/handlers.ts:1000:51
           status: status as Parameters<typeof setShard>[3]["status"],
           ...(ext !== undefined ? { ext } : {}),
         });
-        await appendEvent(role, "blackboard/set", { room, status: shard.status });
+        await appendEvent(role, "blackboard/set", {});
         // #97 心跳：分片自写是成员活性信号（白名单 state_set(role)）。
         await heartbeat(role);

[Killed] ConditionalExpression
src/plugin/handlers.ts:1006:13
         // Q6（#150）：阻塞/恢复申报同步成员状态——黑板 blocked 分片是框架可观测的
         // 显式阻塞信号（ADR 0016 免责索引同源）；running 分片同步恢复。done 不驱动
         // 成员态（成员 stopped 由任务全部结束驱动，避免完成分片即误标终止）。
-        if (shard.status === "blocked") {
+        if (false) {
           await transitMemberStatus(role, "blocked");
         } else if (shard.status === "running") {
killedBy: Q6 成员状态机（#150） 黑板阻塞申报 → 成员 blocked；恢复申报 → running
statusReason: expected 'spawned' to be 'blocked' // Object.is equality

[Killed] BlockStatement
src/plugin/handlers.ts:1006:41
         // Q6（#150）：阻塞/恢复申报同步成员状态——黑板 blocked 分片是框架可观测的
         // 显式阻塞信号（ADR 0016 免责索引同源）；running 分片同步恢复。done 不驱动
         // 成员态（成员 stopped 由任务全部结束驱动，避免完成分片即误标终止）。
-        if (shard.status === "blocked") {
-          await transitMemberStatus(role, "blocked");
-        } else if (shard.status === "running") {
+        if (shard.status === "blocked") {} else if (shard.status === "running") {
           await transitMemberStatus(role, "running");
         }
killedBy: Q6 成员状态机（#150） 黑板阻塞申报 → 成员 blocked；恢复申报 → running
statusReason: expected 'spawned' to be 'blocked' // Object.is equality

[Killed] EqualityOperator
src/plugin/handlers.ts:1008:20
         // 成员态（成员 stopped 由任务全部结束驱动，避免完成分片即误标终止）。
         if (shard.status === "blocked") {
           await transitMemberStatus(role, "blocked");
-        } else if (shard.status === "running") {
+        } else if (shard.status !== "running") {
           await transitMemberStatus(role, "running");
         }
killedBy: Q6 成员状态机（#150） 黑板阻塞申报 → 成员 blocked；恢复申报 → running
statusReason: expected 'blocked' to be 'running' // Object.is equality

[Killed] BlockStatement
src/plugin/handlers.ts:1008:48
         // 成员态（成员 stopped 由任务全部结束驱动，避免完成分片即误标终止）。
         if (shard.status === "blocked") {
           await transitMemberStatus(role, "blocked");
-        } else if (shard.status === "running") {
-          await transitMemberStatus(role, "running");
-        }
+        } else if (shard.status === "running") {}
         return { ok: true, role, status: shard.status };
       } catch (error) {
killedBy: Q6 成员状态机（#150） 黑板阻塞申报 → 成员 blocked；恢复申报 → running
statusReason: expected 'blocked' to be 'running' // Object.is equality

[Killed] BooleanLiteral
src/plugin/handlers.ts:1011:22
         } else if (shard.status === "running") {
           await transitMemberStatus(role, "running");
         }
-        return { ok: true, role, status: shard.status };
+        return { ok: false, role, status: shard.status };
       } catch (error) {
         wrap(error);
killedBy: Wave 1b 写面收敛矩阵（#123） 子代理合法流：inbox 自己 / ack 自己 / taskUpdate 自己任务 / stateSet 自己分片 / send from 自己 / handoff 自己任务
statusReason: expected { ok: false, role: 'qa', …(1) } to match object { ok: true }
(2 matching properties omitted from actual)

[Survived] StringLiteral
src/plugin/handlers.ts:1023:42
         const toRole = reqStr(args, "to_role");
         // Wave 1b（#123）：仅当前持有者可交接；主控可代管。requireHolder
         // 返回任务记录（含 rev），复用避免二次读账本。
-        const task = await requireHolder("team_handoff", taskId);
+        const task = await requireHolder("", taskId);
         // Wave 1b（#123）：to_role 必须是已登记成员——防 dangling assignee 出厂。
         if ((await reg().getMember(toRole)) === undefined) {

[Killed] BlockStatement
src/plugin/handlers.ts:1025:60
         // 返回任务记录（含 rev），复用避免二次读账本。
         const task = await requireHolder("team_handoff", taskId);
         // Wave 1b（#123）：to_role 必须是已登记成员——防 dangling assignee 出厂。
-        if ((await reg().getMember(toRole)) === undefined) {
-          throw new ToolError("unknown-member", `handoff target ${toRole} is not registered`);
-        }
+        if ((await reg().getMember(toRole)) === undefined) {}
         const receipt = optStrArray(args, "receipt");
         if (receipt === undefined && task.dod.length > 0) {
killedBy: Wave 1b 写面收敛矩阵（#123） 子代理越权：taskUpdate 他人任务 / 自己任务 patch assignee / handoff 他人任务 → forbidden
statusReason: promise resolved "{ ok: true, …(3) }" instead of rejecting

[Killed] ConditionalExpression
src/plugin/handlers.ts:1025:13
         // 返回任务记录（含 rev），复用避免二次读账本。
         const task = await requireHolder("team_handoff", taskId);
         // Wave 1b（#123）：to_role 必须是已登记成员——防 dangling assignee 出厂。
-        if ((await reg().getMember(toRole)) === undefined) {
+        if (false) {
           throw new ToolError("unknown-member", `handoff target ${toRole} is not registered`);
         }
killedBy: Wave 1b 写面收敛矩阵（#123） 子代理越权：taskUpdate 他人任务 / 自己任务 patch assignee / handoff 他人任务 → forbidden
statusReason: promise resolved "{ ok: true, …(3) }" instead of rejecting

[Survived] StringLiteral
src/plugin/handlers.ts:1026:49
         const task = await requireHolder("team_handoff", taskId);
         // Wave 1b（#123）：to_role 必须是已登记成员——防 dangling assignee 出厂。
         if ((await reg().getMember(toRole)) === undefined) {
-          throw new ToolError("unknown-member", `handoff target ${toRole} is not registered`);
+          throw new ToolError("unknown-member", ``);
         }
         const receipt = optStrArray(args, "receipt");

[Killed] EqualityOperator
src/plugin/handlers.ts:1029:38
           throw new ToolError("unknown-member", `handoff target ${toRole} is not registered`);
         }
         const receipt = optStrArray(args, "receipt");
-        if (receipt === undefined && task.dod.length > 0) {
+        if (receipt === undefined && task.dod.length <= 0) {
           throw new ToolError(
             "receipt-required",
killedBy: 白名单心跳触点（#97 ADR 0016） team_handoff 刷交接目标 to_role 而非调用者与原持有者
statusReason: task task-c5ee0a03-970a-469f-99f2-9373f00ff6ac has dod items; attach a per-item pass/fail receipt array

[Killed] ConditionalExpression
src/plugin/handlers.ts:1029:13
           throw new ToolError("unknown-member", `handoff target ${toRole} is not registered`);
         }
         const receipt = optStrArray(args, "receipt");
-        if (receipt === undefined && task.dod.length > 0) {
+        if (false) {
           throw new ToolError(
             "receipt-required",
killedBy: golden 场景一：init → spawn → task 全链路 单任务全流程：create→running→handoff→done，事件与账本逐项核对
statusReason: promise resolved "{ ok: true, …(3) }" instead of rejecting

[Killed] BlockStatement
src/plugin/handlers.ts:1035:36
             `task ${taskId} has dod items; attach a per-item pass/fail receipt array`,
           );
         }
-        if (receipt !== undefined) {
-          if (receipt.length < task.dod.length) {
-            throw new ToolError(
-              "receipt-incomplete",
-              `dod has ${task.dod.length} items but receipt has ${receipt.length} conclusions`,
-            );
-          }
-          // 逐条结论格式校验（10§3.3 文档宣称的兑现，#98 步骤 2）：
-          // 每条必须以 pass:/fail: 开头附一句话结论——回执是 judge 的
-          // 结构化凭据，自由文本无法被凭据卡片与对账消费。
-          const badIdx = receipt.findIndex((line) => !/^\s*(pass|fail)\s*[:：]/i.test(line));
-          if (badIdx >= 0) {
-            throw new ToolError(
-              "receipt-format",
-              `receipt[${badIdx}] must start with "pass:" or "fail:" followed by a one-line conclusion`,
-            );
-          }
-        }
+        if (receipt !== undefined) {}
         // handoff 只换持有者；任务在 blocked 时随交接恢复 running，其余态不变
         // （running→running 是非法迁移，交给状态机校验兜底）。
killedBy: golden 场景一：init → spawn → task 全链路 单任务全流程：create→running→handoff→done，事件与账本逐项核对
statusReason: promise resolved "{ ok: true, …(3) }" instead of rejecting

[Killed] ConditionalExpression
src/plugin/handlers.ts:1036:15
           );
         }
         if (receipt !== undefined) {
-          if (receipt.length < task.dod.length) {
+          if (false) {
             throw new ToolError(
               "receipt-incomplete",
killedBy: golden 场景一：init → spawn → task 全链路 单任务全流程：create→running→handoff→done，事件与账本逐项核对
statusReason: promise resolved "{ ok: true, …(3) }" instead of rejecting

[Killed] ConditionalExpression
src/plugin/handlers.ts:1036:15
           );
         }
         if (receipt !== undefined) {
-          if (receipt.length < task.dod.length) {
+          if (true) {
             throw new ToolError(
               "receipt-incomplete",
killedBy: Wave 1b 写面收敛矩阵（#123） 子代理合法流：inbox 自己 / ack 自己 / taskUpdate 自己任务 / stateSet 自己分片 / send from 自己 / handoff 自己任务
statusReason: promise rejected "ToolError: dod has 0 items but receipt ha… { code: '…' }" instead of resolving

[Killed] ConditionalExpression
src/plugin/handlers.ts:1046:15
           // 每条必须以 pass:/fail: 开头附一句话结论——回执是 judge 的
           // 结构化凭据，自由文本无法被凭据卡片与对账消费。
           const badIdx = receipt.findIndex((line) => !/^\s*(pass|fail)\s*[:：]/i.test(line));
-          if (badIdx >= 0) {
+          if (false) {
             throw new ToolError(
               "receipt-format",
killedBy: golden 场景一：init → spawn → task 全链路 单任务全流程：create→running→handoff→done，事件与账本逐项核对
statusReason: promise resolved "{ ok: true, …(3) }" instead of rejecting

[Killed] EqualityOperator
src/plugin/handlers.ts:1046:15
           // 每条必须以 pass:/fail: 开头附一句话结论——回执是 judge 的
           // 结构化凭据，自由文本无法被凭据卡片与对账消费。
           const badIdx = receipt.findIndex((line) => !/^\s*(pass|fail)\s*[:：]/i.test(line));
-          if (badIdx >= 0) {
+          if (badIdx > 0) {
             throw new ToolError(
               "receipt-format",
killedBy: golden 场景一：init → spawn → task 全链路 单任务全流程：create→running→handoff→done，事件与账本逐项核对
statusReason: promise resolved "{ ok: true, …(3) }" instead of rejecting

[Survived] StringLiteral
src/plugin/handlers.ts:1049:15
           if (badIdx >= 0) {
             throw new ToolError(
               "receipt-format",
-              `receipt[${badIdx}] must start with "pass:" or "fail:" followed by a one-line conclusion`,
+              ``,
             );
           }

[Killed] ObjectLiteral
src/plugin/handlers.ts:1056:52
         // handoff 只换持有者；任务在 blocked 时随交接恢复 running，其余态不变
         // （running→running 是非法迁移，交给状态机校验兜底）。
         // 透传 authz 读回的 rev 作乐观锁基线（TOCTOU 防护，同 taskUpdate）。
-        const updated = await led().update(taskId, {
-          assignee: toRole,
-          ...(task.status === "blocked" ? { status: "running" as TaskStatus } : {}),
-        }, { expectRev: task.rev });
+        const updated = await led().update(taskId, {}, { expectRev: task.rev });
         await appendEvent(toRole, "handoff", { task_id: taskId, to_role: toRole, receipt: receipt ?? null });
         // #97 心跳：归属取交接目标（事件流 actor 镜像，白名单 handoff(toRole)）
killedBy: golden 场景一：init → spawn → task 全链路 单任务全流程：create→running→handoff→done，事件与账本逐项核对
statusReason: expected 'coder' to be 'qa' // Object.is equality

[Survived] LogicalOperator
src/plugin/handlers.ts:1060:91
           assignee: toRole,
           ...(task.status === "blocked" ? { status: "running" as TaskStatus } : {}),
         }, { expectRev: task.rev });
-        await appendEvent(toRole, "handoff", { task_id: taskId, to_role: toRole, receipt: receipt ?? null });
+        await appendEvent(toRole, "handoff", { task_id: taskId, to_role: toRole, receipt: receipt && null });
         // #97 心跳：归属取交接目标（事件流 actor 镜像，白名单 handoff(toRole)）
         // 而非调用者——同 taskUpdate 代管口径（ADR 0016 已接受限制）。

[Killed] StringLiteral
src/plugin/handlers.ts:1060:35
           assignee: toRole,
           ...(task.status === "blocked" ? { status: "running" as TaskStatus } : {}),
         }, { expectRev: task.rev });
-        await appendEvent(toRole, "handoff", { task_id: taskId, to_role: toRole, receipt: receipt ?? null });
+        await appendEvent(toRole, "", { task_id: taskId, to_role: toRole, receipt: receipt ?? null });
         // #97 心跳：归属取交接目标（事件流 actor 镜像，白名单 handoff(toRole)）
         // 而非调用者——同 taskUpdate 代管口径（ADR 0016 已接受限制）。
killedBy: golden 场景一：init → spawn → task 全链路 单任务全流程：create→running→handoff→done，事件与账本逐项核对
statusReason: expected [ 'team/init', 'team/spawn', …(7) ] to deeply equal [ 'team/init', 'team/spawn', …(7) ]

[Killed] BooleanLiteral
src/plugin/handlers.ts:1064:22
         // #97 心跳：归属取交接目标（事件流 actor 镜像，白名单 handoff(toRole)）
         // 而非调用者——同 taskUpdate 代管口径（ADR 0016 已接受限制）。
         await heartbeat(toRole);
-        return { ok: true, task_id: taskId, assignee: updated.assignee, rev: updated.rev };
+        return { ok: false, task_id: taskId, assignee: updated.assignee, rev: updated.rev };
       } catch (error) {
         wrap(error);
killedBy: Wave 1b 写面收敛矩阵（#123） 子代理合法流：inbox 自己 / ack 自己 / taskUpdate 自己任务 / stateSet 自己分片 / send from 自己 / handoff 自己任务
statusReason: expected { ok: false, …(3) } to match object { ok: true, assignee: 'qa' }
(2 matching properties omitted from actual)

[Killed] ConditionalExpression
src/plugin/handlers.ts:1072:13
     async reconcile(args) {
       try {
         const scope = optStr(args, "scope") ?? "overview";
-        if (scope !== "overview" && scope !== "audit") {
+        if (false) {
           throw new ToolError("invalid-arguments", 'field "scope" must be "overview" or "audit"');
         }
killedBy: team_reconcile 参数校验 非法 scope 拒绝
statusReason: promise resolved "{ ok: true, scope: 'everything', …(2) }" instead of rejecting

[Killed] BlockStatement
src/plugin/handlers.ts:1096:32
         // 由事件流 task/update 与 handoff 留痕承载，账本不承担永久归属
         // （#147 Q6.4：master.assigned_task_ids 残留已 done 任务的实证修正）。
         const byAssignee = new Map<string, string[]>();
-        for (const t of tasks) {
-          if (t.assignee === undefined) continue;
-          if (t.status === "done" || t.status === "cancelled") continue;
-          byAssignee.set(t.assignee, [...(byAssignee.get(t.assignee) ?? []), t.id]);
-        }
+        for (const t of tasks) {}
         // 存量兼容（Q6 PR-2，#150）：PR-1 之前的会话成员状态从不迁移（setStatus 零调用），
         // 任务已全部结束的成员仍停在 spawned。读路径语义适配（不写盘、无迁移脚本）：
killedBy: team_reconcile overview 一次调用返回快照摘要、成员对照、状态分布、事件游标与 goal 占位
statusReason: expected [] to deeply equal [ 'ghost' ]

[Killed] EqualityOperator
src/plugin/handlers.ts:1098:15
         const byAssignee = new Map<string, string[]>();
         for (const t of tasks) {
           if (t.assignee === undefined) continue;
-          if (t.status === "done" || t.status === "cancelled") continue;
+          if (t.status !== "done" || t.status === "cancelled") continue;
           byAssignee.set(t.assignee, [...(byAssignee.get(t.assignee) ?? []), t.id]);
         }
killedBy: team_reconcile overview 一次调用返回快照摘要、成员对照、状态分布、事件游标与 goal 占位
statusReason: expected [] to deeply equal [ 'ghost' ]

[Killed] ConditionalExpression
src/plugin/handlers.ts:1098:15
         const byAssignee = new Map<string, string[]>();
         for (const t of tasks) {
           if (t.assignee === undefined) continue;
-          if (t.status === "done" || t.status === "cancelled") continue;
+          if (false) continue;
           byAssignee.set(t.assignee, [...(byAssignee.get(t.assignee) ?? []), t.id]);
         }
killedBy: Q6 PR-3a assignee 当前受理人语义（#150） 任务 done 后不再计入 assignee 的 assigned_task_ids（历史归属由事件流承载）
statusReason: expected [ Array(1) ] to deeply equal []

[Killed] LogicalOperator
src/plugin/handlers.ts:1099:43
         for (const t of tasks) {
           if (t.assignee === undefined) continue;
           if (t.status === "done" || t.status === "cancelled") continue;
-          byAssignee.set(t.assignee, [...(byAssignee.get(t.assignee) ?? []), t.id]);
+          byAssignee.set(t.assignee, [...(byAssignee.get(t.assignee) && []), t.id]);
         }
         // 存量兼容（Q6 PR-2，#150）：PR-1 之前的会话成员状态从不迁移（setStatus 零调用），
killedBy: team_reconcile overview 一次调用返回快照摘要、成员对照、状态分布、事件游标与 goal 占位
statusReason: (intermediate value)(intermediate value)(intermediate value) is not iterable

[Killed] ArrayDeclaration
src/plugin/handlers.ts:1099:38
         for (const t of tasks) {
           if (t.assignee === undefined) continue;
           if (t.status === "done" || t.status === "cancelled") continue;
-          byAssignee.set(t.assignee, [...(byAssignee.get(t.assignee) ?? []), t.id]);
+          byAssignee.set(t.assignee, []);
         }
         // 存量兼容（Q6 PR-2，#150）：PR-1 之前的会话成员状态从不迁移（setStatus 零调用），
killedBy: Q6 PR-3a assignee 当前受理人语义（#150） handoff 移交后：旧持有者 assigned_task_ids 清空、新持有者含任务（当前受理人）
statusReason: expected [] to deeply equal [ Array(1) ]

[Killed] EqualityOperator
src/plugin/handlers.ts:1105:75
         // 任务已全部结束的成员仍停在 spawned。读路径语义适配（不写盘、无迁移脚本）：
         // 「有任务记录且全部 done/cancelled」的 spawned 成员按 stopped 展示——
         // 曾开工已收尾，非「从未派活」的刚 spawn 成员（后者保持 spawned 原样）。
-        const hasAnyTask = (member: string): boolean => tasks.some((t) => t.assignee === member);
+        const hasAnyTask = (member: string): boolean => tasks.some((t) => t.assignee !== member);
         const hasActiveTask = (member: string): boolean =>
           tasks.some((t) => t.assignee === member && t.status !== "done" && t.status !== "cancelled");
killedBy: Q6 成员状态机（#150） 存量兼容：spawned 且任务全部 done → reconcile 展示 stopped（读路径，不写盘）
statusReason: expected 'spawned' to be 'stopped' // Object.is equality

[Killed] ConditionalExpression
src/plugin/handlers.ts:1105:75
         // 任务已全部结束的成员仍停在 spawned。读路径语义适配（不写盘、无迁移脚本）：
         // 「有任务记录且全部 done/cancelled」的 spawned 成员按 stopped 展示——
         // 曾开工已收尾，非「从未派活」的刚 spawn 成员（后者保持 spawned 原样）。
-        const hasAnyTask = (member: string): boolean => tasks.some((t) => t.assignee === member);
+        const hasAnyTask = (member: string): boolean => tasks.some((t) => false);
         const hasActiveTask = (member: string): boolean =>
           tasks.some((t) => t.assignee === member && t.status !== "done" && t.status !== "cancelled");
killedBy: Q6 成员状态机（#150） 存量兼容：spawned 且任务全部 done → reconcile 展示 stopped（读路径，不写盘）
statusReason: expected 'spawned' to be 'stopped' // Object.is equality

[Survived] ArrowFunction
src/plugin/handlers.ts:1106:31
         // 「有任务记录且全部 done/cancelled」的 spawned 成员按 stopped 展示——
         // 曾开工已收尾，非「从未派活」的刚 spawn 成员（后者保持 spawned 原样）。
         const hasAnyTask = (member: string): boolean => tasks.some((t) => t.assignee === member);
-        const hasActiveTask = (member: string): boolean =>
-          tasks.some((t) => t.assignee === member && t.status !== "done" && t.status !== "cancelled");
+        const hasActiveTask = () => undefined;
         // #192：存活观测先于 memberLedger 组装（liveness 列消费探测结果）。
         let liveByDurableId: Map<string, "running" | "inactive"> | null = null;

[Killed] ConditionalExpression
src/plugin/handlers.ts:1107:54
         // 曾开工已收尾，非「从未派活」的刚 spawn 成员（后者保持 spawned 原样）。
         const hasAnyTask = (member: string): boolean => tasks.some((t) => t.assignee === member);
         const hasActiveTask = (member: string): boolean =>
-          tasks.some((t) => t.assignee === member && t.status !== "done" && t.status !== "cancelled");
+          tasks.some((t) => t.assignee === member && true && t.status !== "cancelled");
         // #192：存活观测先于 memberLedger 组装（liveness 列消费探测结果）。
         let liveByDurableId: Map<string, "running" | "inactive"> | null = null;
killedBy: Q6 成员状态机（#150） 存量兼容：spawned 且任务全部 done → reconcile 展示 stopped（读路径，不写盘）
statusReason: expected 'spawned' to be 'stopped' // Object.is equality

[Killed] EqualityOperator
src/plugin/handlers.ts:1107:54
         // 曾开工已收尾，非「从未派活」的刚 spawn 成员（后者保持 spawned 原样）。
         const hasAnyTask = (member: string): boolean => tasks.some((t) => t.assignee === member);
         const hasActiveTask = (member: string): boolean =>
-          tasks.some((t) => t.assignee === member && t.status !== "done" && t.status !== "cancelled");
+          tasks.some((t) => t.assignee === member && t.status === "done" && t.status !== "cancelled");
         // #192：存活观测先于 memberLedger 组装（liveness 列消费探测结果）。
         let liveByDurableId: Map<string, "running" | "inactive"> | null = null;
killedBy: Q6 成员状态机（#150） 存量兼容：spawned 且任务全部 done → reconcile 展示 stopped（读路径，不写盘）
statusReason: expected 'spawned' to be 'stopped' // Object.is equality

[Killed] EqualityOperator
src/plugin/handlers.ts:1111:13
         // #192：存活观测先于 memberLedger 组装（liveness 列消费探测结果）。
         let liveByDurableId: Map<string, "running" | "inactive"> | null = null;
         let livenessSource: "subagent-discovery" | "unavailable" = "unavailable";
-        if (livenessProbe !== undefined) {
+        if (livenessProbe === undefined) {
           try {
             liveByDurableId = await livenessProbe();
killedBy: execute 路由与输出包装 #192 存活探测：宿主 subagents 发现服务在场时 reconcile liveness 列为官方观测值
statusReason: expected 'unavailable' to be 'subagent-discovery' // Object.is equality

[Killed] BlockStatement
src/plugin/handlers.ts:1111:42
         // #192：存活观测先于 memberLedger 组装（liveness 列消费探测结果）。
         let liveByDurableId: Map<string, "running" | "inactive"> | null = null;
         let livenessSource: "subagent-discovery" | "unavailable" = "unavailable";
-        if (livenessProbe !== undefined) {
-          try {
-            liveByDurableId = await livenessProbe();
-            livenessSource = "subagent-discovery";
-          } catch {
-            liveByDurableId = null;
-            livenessSource = "unavailable";
-          }
-        }
+        if (livenessProbe !== undefined) {}
         const annotateLiveness = (m: MemberRecord): string => {
           if (liveByDurableId === null) return "framework-invisible";
killedBy: execute 路由与输出包装 #192 存活探测：宿主 subagents 发现服务在场时 reconcile liveness 列为官方观测值
statusReason: expected 'unavailable' to be 'subagent-discovery' // Object.is equality

[Killed] BlockStatement
src/plugin/handlers.ts:1112:15
         let liveByDurableId: Map<string, "running" | "inactive"> | null = null;
         let livenessSource: "subagent-discovery" | "unavailable" = "unavailable";
         if (livenessProbe !== undefined) {
-          try {
-            liveByDurableId = await livenessProbe();
-            livenessSource = "subagent-discovery";
-          } catch {
+          try {} catch {
             liveByDurableId = null;
             livenessSource = "unavailable";
killedBy: #192 存活核对官方化（subagent 发现 API 注入） 探测命中：liveness 列升级为官方观测值，liveness_source=subagent-discovery
statusReason: expected 'unavailable' to be 'subagent-discovery' // Object.is equality

[Survived] BlockStatement
src/plugin/handlers.ts:1115:19
           try {
             liveByDurableId = await livenessProbe();
             livenessSource = "subagent-discovery";
-          } catch {
-            liveByDurableId = null;
-            livenessSource = "unavailable";
-          }
+          } catch {}
         }
         const annotateLiveness = (m: MemberRecord): string => {

[Killed] StringLiteral
src/plugin/handlers.ts:1117:30
             livenessSource = "subagent-discovery";
           } catch {
             liveByDurableId = null;
-            livenessSource = "unavailable";
+            livenessSource = "";
           }
         }
killedBy: #192 存活核对官方化（subagent 发现 API 注入） 探测抛错 → 退化为 framework-invisible 旧口径（liveness_source=unavailable），不阻断对账
statusReason: expected '' to be 'unavailable' // Object.is equality

[Killed] BlockStatement
src/plugin/handlers.ts:1120:63
             livenessSource = "unavailable";
           }
         }
-        const annotateLiveness = (m: MemberRecord): string => {
-          if (liveByDurableId === null) return "framework-invisible";
-          if (m.tier === 0) return "root-session"; // 主控 = 宿主主会话，不经 subagent 面
-          const live = liveByDurableId.get(m.durableId);
-          if (live === "running") return "running";
-          if (live === "inactive") return "inactive";
-          return "missing"; // 发现面枚举不到 = 冷子代理/已释放（能力性缺席）
-        };
+        const annotateLiveness = (m: MemberRecord): string => {};
         const memberLedger = members.map((m) => ({
           member: m.member,
killedBy: execute 路由与输出包装 #192 存活探测：宿主 subagents 发现服务在场时 reconcile liveness 列为官方观测值
statusReason: expected undefined to be 'root-session' // Object.is equality

[Killed] ConditionalExpression
src/plugin/handlers.ts:1121:15
           }
         }
         const annotateLiveness = (m: MemberRecord): string => {
-          if (liveByDurableId === null) return "framework-invisible";
+          if (true) return "framework-invisible";
           if (m.tier === 0) return "root-session"; // 主控 = 宿主主会话，不经 subagent 面
           const live = liveByDurableId.get(m.durableId);
killedBy: #192 存活核对官方化（subagent 发现 API 注入） 探测命中：liveness 列升级为官方观测值，liveness_source=subagent-discovery
statusReason: expected 'framework-invisible' to be 'root-session' // Object.is equality

[Killed] ConditionalExpression
src/plugin/handlers.ts:1121:15
           }
         }
         const annotateLiveness = (m: MemberRecord): string => {
-          if (liveByDurableId === null) return "framework-invisible";
+          if (false) return "framework-invisible";
           if (m.tier === 0) return "root-session"; // 主控 = 宿主主会话，不经 subagent 面
           const live = liveByDurableId.get(m.durableId);
killedBy: Q6 成员状态机（#150） 存量兼容：spawned 且任务全部 done → reconcile 展示 stopped（读路径，不写盘）
statusReason: Cannot read properties of null (reading 'get')

[Killed] ConditionalExpression
src/plugin/handlers.ts:1122:15
         }
         const annotateLiveness = (m: MemberRecord): string => {
           if (liveByDurableId === null) return "framework-invisible";
-          if (m.tier === 0) return "root-session"; // 主控 = 宿主主会话，不经 subagent 面
+          if (true) return "root-session"; // 主控 = 宿主主会话，不经 subagent 面
           const live = liveByDurableId.get(m.durableId);
           if (live === "running") return "running";
killedBy: execute 路由与输出包装 #192 存活探测：宿主 subagents 发现服务在场时 reconcile liveness 列为官方观测值
statusReason: expected 'root-session' to be 'running' // Object.is equality

[Killed] ConditionalExpression
src/plugin/handlers.ts:1122:15
         }
         const annotateLiveness = (m: MemberRecord): string => {
           if (liveByDurableId === null) return "framework-invisible";
-          if (m.tier === 0) return "root-session"; // 主控 = 宿主主会话，不经 subagent 面
+          if (false) return "root-session"; // 主控 = 宿主主会话，不经 subagent 面
           const live = liveByDurableId.get(m.durableId);
           if (live === "running") return "running";
killedBy: execute 路由与输出包装 #192 存活探测：宿主 subagents 发现服务在场时 reconcile liveness 列为官方观测值
statusReason: expected 'missing' to be 'root-session' // Object.is equality

[Killed] EqualityOperator
src/plugin/handlers.ts:1124:15
           if (liveByDurableId === null) return "framework-invisible";
           if (m.tier === 0) return "root-session"; // 主控 = 宿主主会话，不经 subagent 面
           const live = liveByDurableId.get(m.durableId);
-          if (live === "running") return "running";
+          if (live !== "running") return "running";
           if (live === "inactive") return "inactive";
           return "missing"; // 发现面枚举不到 = 冷子代理/已释放（能力性缺席）
killedBy: #192 存活核对官方化（subagent 发现 API 注入） 探测命中：liveness 列升级为官方观测值，liveness_source=subagent-discovery
statusReason: expected 'missing' to be 'running' // Object.is equality

[Killed] ConditionalExpression
src/plugin/handlers.ts:1124:15
           if (liveByDurableId === null) return "framework-invisible";
           if (m.tier === 0) return "root-session"; // 主控 = 宿主主会话，不经 subagent 面
           const live = liveByDurableId.get(m.durableId);
-          if (live === "running") return "running";
+          if (false) return "running";
           if (live === "inactive") return "inactive";
           return "missing"; // 发现面枚举不到 = 冷子代理/已释放（能力性缺席）
killedBy: #192 存活核对官方化（subagent 发现 API 注入） 探测命中：liveness 列升级为官方观测值，liveness_source=subagent-discovery
statusReason: expected 'missing' to be 'running' // Object.is equality

[Killed] EqualityOperator
src/plugin/handlers.ts:1125:15
           if (m.tier === 0) return "root-session"; // 主控 = 宿主主会话，不经 subagent 面
           const live = liveByDurableId.get(m.durableId);
           if (live === "running") return "running";
-          if (live === "inactive") return "inactive";
+          if (live !== "inactive") return "inactive";
           return "missing"; // 发现面枚举不到 = 冷子代理/已释放（能力性缺席）
         };
killedBy: execute 路由与输出包装 #192 存活探测：宿主 subagents 发现服务在场时 reconcile liveness 列为官方观测值
statusReason: expected 'missing' to be 'inactive' // Object.is equality

[Killed] ConditionalExpression
src/plugin/handlers.ts:1125:15
           if (m.tier === 0) return "root-session"; // 主控 = 宿主主会话，不经 subagent 面
           const live = liveByDurableId.get(m.durableId);
           if (live === "running") return "running";
-          if (live === "inactive") return "inactive";
+          if (true) return "inactive";
           return "missing"; // 发现面枚举不到 = 冷子代理/已释放（能力性缺席）
         };
killedBy: #192 存活核对官方化（subagent 发现 API 注入） 发现面枚举不到的成员 → missing（保守缺席，供主控对账判 dead）
statusReason: expected 'inactive' to be 'missing' // Object.is equality
