[Killed] ArrowFunction
src/plugin/handlers.ts:1128:42
           if (live === "inactive") return "inactive";
           return "missing"; // 发现面枚举不到 = 冷子代理/已释放（能力性缺席）
         };
-        const memberLedger = members.map((m) => ({
-          member: m.member,
-          durable_id: m.durableId,
-          tier: m.tier,
-          parent: m.parent ?? null,
-          status:
-            m.status === "spawned" && hasAnyTask(m.member) && !hasActiveTask(m.member)
-              ? ("stopped" as const)
-              : m.status,
-          liveness: annotateLiveness(m),
-          assigned_task_ids: byAssignee.get(m.member) ?? [],
-        }));
+        const memberLedger = members.map(() => undefined);
         // 悬空态检测：账本指派了、但注册表无此成员。
         const registeredNames = new Set(members.map((m) => m.member));
killedBy: Q6 成员状态机（#150） 存量兼容：spawned 且任务全部 done → reconcile 展示 stopped（读路径，不写盘）
statusReason: Cannot read properties of undefined (reading 'member')

[Killed] BooleanLiteral
src/plugin/handlers.ts:1134:63
           tier: m.tier,
           parent: m.parent ?? null,
           status:
-            m.status === "spawned" && hasAnyTask(m.member) && !hasActiveTask(m.member)
+            m.status === "spawned" && hasAnyTask(m.member) && hasActiveTask(m.member)
               ? ("stopped" as const)
               : m.status,
killedBy: Q6 成员状态机（#150） 存量兼容：spawned 且任务全部 done → reconcile 展示 stopped（读路径，不写盘）
statusReason: expected 'spawned' to be 'stopped' // Object.is equality

[Killed] EqualityOperator
src/plugin/handlers.ts:1134:13
           tier: m.tier,
           parent: m.parent ?? null,
           status:
-            m.status === "spawned" && hasAnyTask(m.member) && !hasActiveTask(m.member)
+            m.status !== "spawned" && hasAnyTask(m.member) && !hasActiveTask(m.member)
               ? ("stopped" as const)
               : m.status,
killedBy: Q6 成员状态机（#150） 存量兼容：spawned 且任务全部 done → reconcile 展示 stopped（读路径，不写盘）
statusReason: expected 'spawned' to be 'stopped' // Object.is equality

[Killed] LogicalOperator
src/plugin/handlers.ts:1138:30
               ? ("stopped" as const)
               : m.status,
           liveness: annotateLiveness(m),
-          assigned_task_ids: byAssignee.get(m.member) ?? [],
+          assigned_task_ids: byAssignee.get(m.member) && [],
         }));
         // 悬空态检测：账本指派了、但注册表无此成员。
killedBy: Q6 PR-3a assignee 当前受理人语义（#150） 任务 done 后不再计入 assignee 的 assigned_task_ids（历史归属由事件流承载）
statusReason: expected undefined to deeply equal []

[Killed] ArrayDeclaration
src/plugin/handlers.ts:1138:58
               ? ("stopped" as const)
               : m.status,
           liveness: annotateLiveness(m),
-          assigned_task_ids: byAssignee.get(m.member) ?? [],
+          assigned_task_ids: byAssignee.get(m.member) ?? ["Stryker was here"],
         }));
         // 悬空态检测：账本指派了、但注册表无此成员。
killedBy: Q6 PR-3a assignee 当前受理人语义（#150） 任务 done 后不再计入 assignee 的 assigned_task_ids（历史归属由事件流承载）
statusReason: expected [ 'Stryker was here' ] to deeply equal []

[Killed] ConditionalExpression
src/plugin/handlers.ts:1149:26
         // tier=0 根主控豁免（单入口原则：有且仅有一个无父主控）。
         const orphan_members = members
           .filter((m) => m.tier !== 0)
-          .filter((m) => m.parent === undefined || m.parent === null || !registeredNames.has(m.parent))
+          .filter((m) => true)
           .map((m) => ({
             member: m.member,
killedBy: team_reconcile overview 孤儿标红：有 parent 且在册不标；悬空 parent 标 parent-dangling
statusReason: expected [ …(2) ] to deeply equal [ Array(1) ]

[Killed] ObjectLiteral
src/plugin/handlers.ts:1150:24
         const orphan_members = members
           .filter((m) => m.tier !== 0)
           .filter((m) => m.parent === undefined || m.parent === null || !registeredNames.has(m.parent))
-          .map((m) => ({
-            member: m.member,
-            tier: m.tier,
-            parent: m.parent ?? null,
-            reason: m.parent === undefined || m.parent === null ? "parent-missing" : "parent-dangling",
-          }));
+          .map((m) => ({}));
 
         // 任务账本快照：状态分布 + 明细。
killedBy: team_reconcile overview 一次调用返回快照摘要、成员对照、状态分布、事件游标与 goal 占位
statusReason: expected [ {} ] to deeply equal [ { member: 'coder', tier: 1, …(2) } ]

[Killed] LogicalOperator
src/plugin/handlers.ts:1154:21
             member: m.member,
             tier: m.tier,
             parent: m.parent ?? null,
-            reason: m.parent === undefined || m.parent === null ? "parent-missing" : "parent-dangling",
+            reason: m.parent === undefined && m.parent === null ? "parent-missing" : "parent-dangling",
           }));
 
killedBy: team_reconcile overview 一次调用返回快照摘要、成员对照、状态分布、事件游标与 goal 占位
statusReason: expected [ { member: 'coder', tier: 1, …(2) } ] to deeply equal [ { member: 'coder', tier: 1, …(2) } ]

[Killed] BlockStatement
src/plugin/handlers.ts:1176:37
         // （#97 ADR 0016：任一分片 blocked 即豁免 stale——等待输入非停摆）。
         const eventCursors: Array<{ room: string; seq: number }> = [];
         const blockedIndex = new Map<string, boolean>();
-        if (existsSync(l.roomsDir)) {
-          for (const room of readdirSync(l.roomsDir)) {
-            try {
-              // #187 尾窗化：lastSeq 读游标快路径 / 真偏移尾窗，替代旧
-              // init（全量扫）+ read（全量解析）——对账只要末笔 seq，长会话
-              // IO 从 O(全文件) 降到 O(游标/窗口)。
-              const seq = await new EventLog(join(l.roomsDir, room, "events.jsonl")).lastSeq();
-              eventCursors.push({ room, seq });
-            } catch {
-              // 房间目录存在但事件文件不可读：游标记 0
-              eventCursors.push({ room, seq: 0 });
-            }
-            try {
-              for (const shard of await listShards(teamHome, room)) {
-                if (shard.status === "blocked") blockedIndex.set(shard.role, true);
-              }
-            } catch {
-              // 黑板不可读按无免责数据处理（罕见 fs 异常路径；report-only
-              // 输出宁缺勿滥，不做二次兜底读）。
-            }
-          }
-        }
+        if (existsSync(l.roomsDir)) {}
 
         // stale 心跳标注（#97，ADR 0016，report-only）：#194 F5-2 双镜像收敛——
killedBy: team_reconcile overview 一次调用返回快照摘要、成员对照、状态分布、事件游标与 goal 占位
statusReason: expected undefined to be 'root' // Object.is equality

[Killed] ConditionalExpression
src/plugin/handlers.ts:1176:13
         // （#97 ADR 0016：任一分片 blocked 即豁免 stale——等待输入非停摆）。
         const eventCursors: Array<{ room: string; seq: number }> = [];
         const blockedIndex = new Map<string, boolean>();
-        if (existsSync(l.roomsDir)) {
+        if (false) {
           for (const room of readdirSync(l.roomsDir)) {
             try {
killedBy: team_reconcile overview 一次调用返回快照摘要、成员对照、状态分布、事件游标与 goal 占位
statusReason: expected undefined to be 'root' // Object.is equality

[Killed] BlockStatement
src/plugin/handlers.ts:1177:55
         const eventCursors: Array<{ room: string; seq: number }> = [];
         const blockedIndex = new Map<string, boolean>();
         if (existsSync(l.roomsDir)) {
-          for (const room of readdirSync(l.roomsDir)) {
-            try {
-              // #187 尾窗化：lastSeq 读游标快路径 / 真偏移尾窗，替代旧
-              // init（全量扫）+ read（全量解析）——对账只要末笔 seq，长会话
-              // IO 从 O(全文件) 降到 O(游标/窗口)。
-              const seq = await new EventLog(join(l.roomsDir, room, "events.jsonl")).lastSeq();
-              eventCursors.push({ room, seq });
-            } catch {
-              // 房间目录存在但事件文件不可读：游标记 0
-              eventCursors.push({ room, seq: 0 });
-            }
-            try {
-              for (const shard of await listShards(teamHome, room)) {
-                if (shard.status === "blocked") blockedIndex.set(shard.role, true);
-              }
-            } catch {
-              // 黑板不可读按无免责数据处理（罕见 fs 异常路径；report-only
-              // 输出宁缺勿滥，不做二次兜底读）。
-            }
-          }
+          for (const room of readdirSync(l.roomsDir)) {}
         }
 
killedBy: team_reconcile overview 一次调用返回快照摘要、成员对照、状态分布、事件游标与 goal 占位
statusReason: expected undefined to be 'root' // Object.is equality

[Killed] BlockStatement
src/plugin/handlers.ts:1178:17
         const blockedIndex = new Map<string, boolean>();
         if (existsSync(l.roomsDir)) {
           for (const room of readdirSync(l.roomsDir)) {
-            try {
-              // #187 尾窗化：lastSeq 读游标快路径 / 真偏移尾窗，替代旧
-              // init（全量扫）+ read（全量解析）——对账只要末笔 seq，长会话
-              // IO 从 O(全文件) 降到 O(游标/窗口)。
-              const seq = await new EventLog(join(l.roomsDir, room, "events.jsonl")).lastSeq();
-              eventCursors.push({ room, seq });
-            } catch {
+            try {} catch {
               // 房间目录存在但事件文件不可读：游标记 0
               eventCursors.push({ room, seq: 0 });
killedBy: team_reconcile overview 一次调用返回快照摘要、成员对照、状态分布、事件游标与 goal 占位
statusReason: expected undefined to be 'root' // Object.is equality

[Killed] ObjectLiteral
src/plugin/handlers.ts:1183:33
               // init（全量扫）+ read（全量解析）——对账只要末笔 seq，长会话
               // IO 从 O(全文件) 降到 O(游标/窗口)。
               const seq = await new EventLog(join(l.roomsDir, room, "events.jsonl")).lastSeq();
-              eventCursors.push({ room, seq });
+              eventCursors.push({});
             } catch {
               // 房间目录存在但事件文件不可读：游标记 0
killedBy: team_reconcile overview 一次调用返回快照摘要、成员对照、状态分布、事件游标与 goal 占位
statusReason: expected undefined to be 'root' // Object.is equality

[NoCoverage] BlockStatement
src/plugin/handlers.ts:1184:21
               // IO 从 O(全文件) 降到 O(游标/窗口)。
               const seq = await new EventLog(join(l.roomsDir, room, "events.jsonl")).lastSeq();
               eventCursors.push({ room, seq });
-            } catch {
-              // 房间目录存在但事件文件不可读：游标记 0
-              eventCursors.push({ room, seq: 0 });
-            }
+            } catch {}
             try {
               for (const shard of await listShards(teamHome, room)) {

[Killed] BlockStatement
src/plugin/handlers.ts:1188:17
               // 房间目录存在但事件文件不可读：游标记 0
               eventCursors.push({ room, seq: 0 });
             }
-            try {
-              for (const shard of await listShards(teamHome, room)) {
-                if (shard.status === "blocked") blockedIndex.set(shard.role, true);
-              }
-            } catch {
+            try {} catch {
               // 黑板不可读按无免责数据处理（罕见 fs 异常路径；report-only
               // 输出宁缺勿滥，不做二次兜底读）。
killedBy: team_reconcile stale 心跳标注（#97 ADR 0016） 超阈且黑板任一分片 blocked 归 awaiting_input 免责档，不再双列
statusReason: expected [] to deeply equal [ { member: 'waiter', …(1) } ]

[Killed] BlockStatement
src/plugin/handlers.ts:1189:69
               eventCursors.push({ room, seq: 0 });
             }
             try {
-              for (const shard of await listShards(teamHome, room)) {
-                if (shard.status === "blocked") blockedIndex.set(shard.role, true);
-              }
+              for (const shard of await listShards(teamHome, room)) {}
             } catch {
               // 黑板不可读按无免责数据处理（罕见 fs 异常路径；report-only
killedBy: team_reconcile stale 心跳标注（#97 ADR 0016） 超阈且黑板任一分片 blocked 归 awaiting_input 免责档，不再双列
statusReason: expected [] to deeply equal [ { member: 'waiter', …(1) } ]

[Killed] BooleanLiteral
src/plugin/handlers.ts:1190:78
             }
             try {
               for (const shard of await listShards(teamHome, room)) {
-                if (shard.status === "blocked") blockedIndex.set(shard.role, true);
+                if (shard.status === "blocked") blockedIndex.set(shard.role, false);
               }
             } catch {
killedBy: team_reconcile stale 心跳标注（#97 ADR 0016） 超阈且黑板任一分片 blocked 归 awaiting_input 免责档，不再双列
statusReason: expected [] to deeply equal [ { member: 'waiter', …(1) } ]

[Killed] EqualityOperator
src/plugin/handlers.ts:1190:21
             }
             try {
               for (const shard of await listShards(teamHome, room)) {
-                if (shard.status === "blocked") blockedIndex.set(shard.role, true);
+                if (shard.status !== "blocked") blockedIndex.set(shard.role, true);
               }
             } catch {
killedBy: team_reconcile stale 心跳标注（#97 ADR 0016） 超阈且黑板任一分片 blocked 归 awaiting_input 免责档，不再双列
statusReason: expected [] to deeply equal [ { member: 'waiter', …(1) } ]

[Killed] EqualityOperator
src/plugin/handlers.ts:1205:57
         // （候选过滤/严格大于/免责档/tier0 主控单项/排序）见 stale.ts 头注。
         const now = Date.now();
         const blockedRoles = new Set(
-          [...blockedIndex.entries()].filter(([, v]) => v === true).map(([k]) => k),
+          [...blockedIndex.entries()].filter(([, v]) => v !== true).map(([k]) => k),
         );
         const verdict = staleVerdict(members, blockedRoles, now);
killedBy: team_reconcile stale 心跳标注（#97 ADR 0016） 超阈且黑板任一分片 blocked 归 awaiting_input 免责档，不再双列
statusReason: expected [] to deeply equal [ { member: 'waiter', …(1) } ]

[Killed] ArrowFunction
src/plugin/handlers.ts:1205:73
         // （候选过滤/严格大于/免责档/tier0 主控单项/排序）见 stale.ts 头注。
         const now = Date.now();
         const blockedRoles = new Set(
-          [...blockedIndex.entries()].filter(([, v]) => v === true).map(([k]) => k),
+          [...blockedIndex.entries()].filter(([, v]) => v === true).map(() => undefined),
         );
         const verdict = staleVerdict(members, blockedRoles, now);
killedBy: team_reconcile stale 心跳标注（#97 ADR 0016） 超阈且黑板任一分片 blocked 归 awaiting_input 免责档，不再双列
statusReason: expected [] to deeply equal [ { member: 'waiter', …(1) } ]

[Killed] ArrowFunction
src/plugin/handlers.ts:1209:56
         );
         const verdict = staleVerdict(members, blockedRoles, now);
         const master_idle = verdict.masterIdle;
-        const stale_members = verdict.staleMembers.map((a) => ({
-          member: a.member,
-          last_seen_age_ms: a.lastSeenAgeMs,
-        }));
+        const stale_members = verdict.staleMembers.map(() => undefined);
         const awaiting_input = verdict.awaitingInput.map((a) => ({
           member: a.member,
killedBy: team_reconcile stale 心跳标注（#97 ADR 0016） running 成员超阈入 stale_members 并携带静默时长；主控不入名册
statusReason: expected [ undefined ] to deeply equal [ { member: 'coder', …(1) } ]

[Killed] ArrowFunction
src/plugin/handlers.ts:1213:58
           member: a.member,
           last_seen_age_ms: a.lastSeenAgeMs,
         }));
-        const awaiting_input = verdict.awaitingInput.map((a) => ({
-          member: a.member,
-          last_seen_age_ms: a.lastSeenAgeMs,
-        }));
+        const awaiting_input = verdict.awaitingInput.map(() => undefined);
 
         // 协议偏差机械检测（#212 P0-2，ADR 0024，report-only）：确定性事实
killedBy: team_reconcile stale 心跳标注（#97 ADR 0016） 超阈且黑板任一分片 blocked 归 awaiting_input 免责档，不再双列
statusReason: expected [ undefined ] to deeply equal [ { member: 'waiter', …(1) } ]

[Killed] ObjectLiteral
src/plugin/handlers.ts:1213:66
           member: a.member,
           last_seen_age_ms: a.lastSeenAgeMs,
         }));
-        const awaiting_input = verdict.awaitingInput.map((a) => ({
-          member: a.member,
-          last_seen_age_ms: a.lastSeenAgeMs,
-        }));
+        const awaiting_input = verdict.awaitingInput.map((a) => ({}));
 
         // 协议偏差机械检测（#212 P0-2，ADR 0024，report-only）：确定性事实
killedBy: team_reconcile stale 心跳标注（#97 ADR 0016） 超阈且黑板任一分片 blocked 归 awaiting_input 免责档，不再双列
statusReason: expected [ {} ] to deeply equal [ { member: 'waiter', …(1) } ]

[Killed] ConditionalExpression
src/plugin/handlers.ts:1224:24
         // 重复 append，repeat 标志供消费方抑制——告警疲劳防护）。
         const stats = await collectEventStats(l.roomsDir);
         const healthInput = {
-          initialized: snapshot !== null,
+          initialized: false,
           briefFrameworkWritten:
             snapshot && typeof snapshot.brief_framework_written === "boolean"
killedBy: protocol_health reconcile 契约 恒在场、三态结构；新实例宽限窗内 delegation available
statusReason: expected 'not-applicable' to be 'available' // Object.is equality

[Killed] EqualityOperator
src/plugin/handlers.ts:1224:24
         // 重复 append，repeat 标志供消费方抑制——告警疲劳防护）。
         const stats = await collectEventStats(l.roomsDir);
         const healthInput = {
-          initialized: snapshot !== null,
+          initialized: snapshot === null,
           briefFrameworkWritten:
             snapshot && typeof snapshot.brief_framework_written === "boolean"
killedBy: protocol_health reconcile 契约 恒在场、三态结构；新实例宽限窗内 delegation available
statusReason: expected 'not-applicable' to be 'available' // Object.is equality

[Killed] LogicalOperator
src/plugin/handlers.ts:1226:13
         const healthInput = {
           initialized: snapshot !== null,
           briefFrameworkWritten:
-            snapshot && typeof snapshot.brief_framework_written === "boolean"
+            snapshot || typeof snapshot.brief_framework_written === "boolean"
               ? (snapshot.brief_framework_written as boolean)
               : null,
killedBy: team_reconcile overview 未初始化实例返回 initialized=false 且不抛错
statusReason: Cannot read properties of null (reading 'brief_framework_written')

[Killed] ConditionalExpression
src/plugin/handlers.ts:1226:13
         const healthInput = {
           initialized: snapshot !== null,
           briefFrameworkWritten:
-            snapshot && typeof snapshot.brief_framework_written === "boolean"
+            true
               ? (snapshot.brief_framework_written as boolean)
               : null,
killedBy: team_reconcile overview 未初始化实例返回 initialized=false 且不抛错
statusReason: Cannot read properties of null (reading 'brief_framework_written')

[Killed] ConditionalExpression
src/plugin/handlers.ts:1240:13
           nowMs: now,
         };
         const protocolHealth = evaluateProtocolHealth(healthInput);
-        if (snapshot !== null) {
+        if (false) {
           for (const item of protocolHealth.items) {
             if (item.status !== "warning") continue;
killedBy: protocol_health reconcile 契约 no-delegation：宽限窗外 warning 首检落留痕，repeat 不重复 append
statusReason: actual value must be number or bigint, received "undefined"

[Killed] BlockStatement
src/plugin/handlers.ts:1240:32
           nowMs: now,
         };
         const protocolHealth = evaluateProtocolHealth(healthInput);
-        if (snapshot !== null) {
-          for (const item of protocolHealth.items) {
-            if (item.status !== "warning") continue;
-            const known = stats.deviations.get(item.check);
-            if (known !== undefined) {
-              item.first_detected_seq = known;
-              item.repeat = true;
-              item.detail = `repeat (first detected at seq ${known}): ${item.detail}`;
-              continue;
-            }
-            const appended = await appendEventSeq("system", DEVIATION_EVENT, {
-              check: item.check,
-              detail_digest: item.detail.slice(0, 200),
-            });
-            item.first_detected_seq = appended;
-          }
-        }
+        if (snapshot !== null) {}
 
         const overview = {
killedBy: protocol_health reconcile 契约 no-delegation：宽限窗外 warning 首检落留痕，repeat 不重复 append
statusReason: actual value must be number or bigint, received "undefined"

[Killed] BlockStatement
src/plugin/handlers.ts:1241:52
         };
         const protocolHealth = evaluateProtocolHealth(healthInput);
         if (snapshot !== null) {
-          for (const item of protocolHealth.items) {
-            if (item.status !== "warning") continue;
-            const known = stats.deviations.get(item.check);
-            if (known !== undefined) {
-              item.first_detected_seq = known;
-              item.repeat = true;
-              item.detail = `repeat (first detected at seq ${known}): ${item.detail}`;
-              continue;
-            }
-            const appended = await appendEventSeq("system", DEVIATION_EVENT, {
-              check: item.check,
-              detail_digest: item.detail.slice(0, 200),
-            });
-            item.first_detected_seq = appended;
-          }
+          for (const item of protocolHealth.items) {}
         }
 
killedBy: protocol_health reconcile 契约 no-delegation：宽限窗外 warning 首检落留痕，repeat 不重复 append
statusReason: actual value must be number or bigint, received "undefined"

[Killed] ConditionalExpression
src/plugin/handlers.ts:1242:17
         const protocolHealth = evaluateProtocolHealth(healthInput);
         if (snapshot !== null) {
           for (const item of protocolHealth.items) {
-            if (item.status !== "warning") continue;
+            if (true) continue;
             const known = stats.deviations.get(item.check);
             if (known !== undefined) {
killedBy: protocol_health reconcile 契约 no-delegation：宽限窗外 warning 首检落留痕，repeat 不重复 append
statusReason: actual value must be number or bigint, received "undefined"

[Killed] EqualityOperator
src/plugin/handlers.ts:1242:17
         const protocolHealth = evaluateProtocolHealth(healthInput);
         if (snapshot !== null) {
           for (const item of protocolHealth.items) {
-            if (item.status !== "warning") continue;
+            if (item.status === "warning") continue;
             const known = stats.deviations.get(item.check);
             if (known !== undefined) {
killedBy: protocol_health reconcile 契约 no-delegation：宽限窗外 warning 首检落留痕，repeat 不重复 append
statusReason: actual value must be number or bigint, received "undefined"

[Killed] BlockStatement
src/plugin/handlers.ts:1244:38
           for (const item of protocolHealth.items) {
             if (item.status !== "warning") continue;
             const known = stats.deviations.get(item.check);
-            if (known !== undefined) {
-              item.first_detected_seq = known;
-              item.repeat = true;
-              item.detail = `repeat (first detected at seq ${known}): ${item.detail}`;
-              continue;
-            }
+            if (known !== undefined) {}
             const appended = await appendEventSeq("system", DEVIATION_EVENT, {
               check: item.check,
killedBy: protocol_health reconcile 契约 no-delegation：宽限窗外 warning 首检落留痕，repeat 不重复 append
statusReason: expected undefined to be true // Object.is equality

[Killed] EqualityOperator
src/plugin/handlers.ts:1244:17
           for (const item of protocolHealth.items) {
             if (item.status !== "warning") continue;
             const known = stats.deviations.get(item.check);
-            if (known !== undefined) {
+            if (known === undefined) {
               item.first_detected_seq = known;
               item.repeat = true;
killedBy: protocol_health reconcile 契约 no-delegation：宽限窗外 warning 首检落留痕，repeat 不重复 append
statusReason: actual value must be number or bigint, received "undefined"

[Killed] BooleanLiteral
src/plugin/handlers.ts:1246:29
             const known = stats.deviations.get(item.check);
             if (known !== undefined) {
               item.first_detected_seq = known;
-              item.repeat = true;
+              item.repeat = false;
               item.detail = `repeat (first detected at seq ${known}): ${item.detail}`;
               continue;
killedBy: protocol_health reconcile 契约 no-delegation：宽限窗外 warning 首检落留痕，repeat 不重复 append
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
src/plugin/handlers.ts:1250:78
               item.detail = `repeat (first detected at seq ${known}): ${item.detail}`;
               continue;
             }
-            const appended = await appendEventSeq("system", DEVIATION_EVENT, {
-              check: item.check,
-              detail_digest: item.detail.slice(0, 200),
-            });
+            const appended = await appendEventSeq("system", DEVIATION_EVENT, {});
             item.first_detected_seq = appended;
           }
killedBy: protocol_health reconcile 契约 no-delegation：宽限窗外 warning 首检落留痕，repeat 不重复 append
statusReason: expected undefined to be true // Object.is equality

[Survived] MethodExpression
src/plugin/handlers.ts:1252:30
             }
             const appended = await appendEventSeq("system", DEVIATION_EVENT, {
               check: item.check,
-              detail_digest: item.detail.slice(0, 200),
+              detail_digest: item.detail,
             });
             item.first_detected_seq = appended;

[Killed] ObjectLiteral
src/plugin/handlers.ts:1299:16
           snapshot && typeof snapshot.workspace === "string" ? snapshot.workspace : null;
         const registeredPaths = tasks.flatMap((t) => t.touched ?? []);
         const report = auditWorkspace(workspace, registeredPaths);
-        return { ok: true, scope, overview, audit: report };
+        return {};
       } catch (error) {
         wrap(error);
killedBy: team_reconcile scope=audit 双向 diff：未登记文件命中、登记在案不误报、过期登记入 stale
statusReason: Cannot read properties of undefined (reading 'available')
