[Killed] BlockStatement
src/runtime/kernel/errors.ts:7:46
   /** 稳定小写 kebab 错误码，供上游路由与断言。 */
   readonly code: string;
 
-  constructor(code: string, message: string) {
-    super(message);
-    this.name = "RuntimeError";
-    this.code = code;
-  }
+  constructor(code: string, message: string) {}
 }
 
killedBy: CAS 锁 异实例持有冲突，错误携带当前 holder；peekLock 可诊断
statusReason: expected ReferenceError: Must call super construct… to be an instance of LockConflictError

[Killed] BlockStatement
src/runtime/kernel/errors.ts:15:46
 }
 
 export class LedgerError extends RuntimeError {
-  constructor(code: string, message: string) {
-    super(code, message);
-    this.name = "LedgerError";
-  }
+  constructor(code: string, message: string) {}
 }
 
killedBy: 任务账本 非法迁移 / 不存在任务 / rounds 回退 全拒
statusReason: expected ReferenceError: Must call super construct… to match object { code: 'illegal-transition' }

[Killed] BlockStatement
src/runtime/kernel/errors.ts:22:46
 }
 
 export class LockError extends RuntimeError {
-  constructor(code: string, message: string) {
-    super(code, message);
-    this.name = "LockError";
-  }
+  constructor(code: string, message: string) {}
 }
 
killedBy: CAS 锁 异实例持有冲突，错误携带当前 holder；peekLock 可诊断
statusReason: expected ReferenceError: Must call super construct… to be an instance of LockConflictError

[Survived] StringLiteral
src/runtime/kernel/errors.ts:24:17
 export class LockError extends RuntimeError {
   constructor(code: string, message: string) {
     super(code, message);
-    this.name = "LockError";
+    this.name = "";
   }
 }

[Killed] BlockStatement
src/runtime/kernel/errors.ts:29:46
 }
 
 export class GateError extends RuntimeError {
-  constructor(code: string, message: string) {
-    super(code, message);
-    this.name = "GateError";
-  }
+  constructor(code: string, message: string) {}
 }
 
killedBy: gates open pending → resolve 单向；重复 open / 重开 resolved 即拒
statusReason: expected ReferenceError: Must call super construct… to match object { code: 'gate-exists' }

[Survived] StringLiteral
src/runtime/kernel/errors.ts:31:17
 export class GateError extends RuntimeError {
   constructor(code: string, message: string) {
     super(code, message);
-    this.name = "GateError";
+    this.name = "";
   }
 }
