[Killed] StringLiteral
src/runtime/kernel/fs-utils.ts:15:27
 import { join, dirname } from "node:path";
 
 /** 临时文件前缀；目录枚举时须过滤，recovery 负责清扫。 */
-export const TMP_PREFIX = ".tmp-";
+export const TMP_PREFIX = "";
 
 /**
killedBy: fs-utils 原子写 sweepTmp 清扫两类临时残片并返回数量
statusReason: expected 4 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/runtime/kernel/fs-utils.ts:22:53
  * `<target>.<digest>`（含 ".json." 且不再以 .json 结尾）。
  * 协议内无合法文件名命中此形态（信箱暂存名以 .json 结尾，不受影响）。
  */
-const LIB_TMP_RESIDUE = (entry: string): boolean => entry.includes(".json.") && !entry.endsWith(".json");
+const LIB_TMP_RESIDUE = (entry: string): boolean => false;
 
 /** 确保目录存在（递归）。 */
killedBy: fs-utils 原子写 sweepTmp 清扫两类临时残片并返回数量
statusReason: expected 1 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/runtime/kernel/fs-utils.ts:22:53
  * `<target>.<digest>`（含 ".json." 且不再以 .json 结尾）。
  * 协议内无合法文件名命中此形态（信箱暂存名以 .json 结尾，不受影响）。
  */
-const LIB_TMP_RESIDUE = (entry: string): boolean => entry.includes(".json.") && !entry.endsWith(".json");
+const LIB_TMP_RESIDUE = (entry: string): boolean => true;
 
 /** 确保目录存在（递归）。 */
killedBy: fs-utils 原子写 sweepTmp 清扫两类临时残片并返回数量
statusReason: expected 4 to be 2 // Object.is equality

[Killed] BlockStatement
src/runtime/kernel/fs-utils.ts:25:61
 const LIB_TMP_RESIDUE = (entry: string): boolean => entry.includes(".json.") && !entry.endsWith(".json");
 
 /** 确保目录存在（递归）。 */
-export async function ensureDir(dir: string): Promise<void> {
-  await mkdir(dir, { recursive: true });
-}
+export async function ensureDir(dir: string): Promise<void> {}
 
 /**
killedBy: team_reconcile stale 心跳标注（#97 ADR 0016） 超阈且黑板任一分片 blocked 归 awaiting_input 免责档，不再双列
statusReason: ENOENT: no such file or directory, open '/tmp/xzg-rec-home-nl6pjD/rooms/root/state/waiter.json.4243580575'

[Killed] BooleanLiteral
src/runtime/kernel/fs-utils.ts:26:33
 
 /** 确保目录存在（递归）。 */
 export async function ensureDir(dir: string): Promise<void> {
-  await mkdir(dir, { recursive: true });
+  await mkdir(dir, { recursive: false });
 }
 
killedBy: team_reconcile overview 一次调用返回快照摘要、成员对照、状态分布、事件游标与 goal 占位
statusReason: EEXIST: file already exists, mkdir '/tmp/xzg-rec-home-Bf2hXo'

[Killed] BlockStatement
src/runtime/kernel/fs-utils.ts:33:84
  * 原子写 JSON：write-file-atomic 同目录临时文件 + rename 到位。
  * 崩溃只可能残留临时文件（不影响读者），由 {@link sweepTmp} 清扫。
  */
-export async function writeJsonAtomic(file: string, value: unknown): Promise<void> {
-  await ensureDir(dirname(file));
-  await writeFileAtomic(file, JSON.stringify(value, null, 2), "utf8");
-}
+export async function writeJsonAtomic(file: string, value: unknown): Promise<void> {}
 
 /** 读 JSON 文件；不存在时返回 undefined。 */
killedBy: team_reconcile overview 一次调用返回快照摘要、成员对照、状态分布、事件游标与 goal 占位
statusReason: task task-8265513d-2ab3-48de-a35b-a22b0ac46fc1 does not exist

[Killed] BlockStatement
src/runtime/kernel/fs-utils.ts:39:73
 }
 
 /** 读 JSON 文件；不存在时返回 undefined。 */
-export async function readJson<T>(file: string): Promise<T | undefined> {
-  if (!existsSync(file)) return undefined;
-  return JSON.parse(await readFile(file, "utf8")) as T;
-}
+export async function readJson<T>(file: string): Promise<T | undefined> {}
 
 /**
killedBy: team_reconcile overview 一次调用返回快照摘要、成员对照、状态分布、事件游标与 goal 占位
statusReason: task task-9bdfea11-7036-4fe8-9c2a-7f3bc27553f4 does not exist

[Killed] ConditionalExpression
src/runtime/kernel/fs-utils.ts:40:7
 
 /** 读 JSON 文件；不存在时返回 undefined。 */
 export async function readJson<T>(file: string): Promise<T | undefined> {
-  if (!existsSync(file)) return undefined;
+  if (true) return undefined;
   return JSON.parse(await readFile(file, "utf8")) as T;
 }
killedBy: team_reconcile overview 一次调用返回快照摘要、成员对照、状态分布、事件游标与 goal 占位
statusReason: task task-a5f06f67-fc5d-4d50-93ee-db066e192fca does not exist

[Killed] BooleanLiteral
src/runtime/kernel/fs-utils.ts:40:7
 
 /** 读 JSON 文件；不存在时返回 undefined。 */
 export async function readJson<T>(file: string): Promise<T | undefined> {
-  if (!existsSync(file)) return undefined;
+  if (existsSync(file)) return undefined;
   return JSON.parse(await readFile(file, "utf8")) as T;
 }
killedBy: team_reconcile overview 一次调用返回快照摘要、成员对照、状态分布、事件游标与 goal 占位
statusReason: ENOENT: no such file or directory, open '/tmp/xzg-rec-home-xjxDjx/agents.json'

[Killed] BlockStatement
src/runtime/kernel/fs-utils.ts:49:62
  * `<target>.<digest>` 形态。
  * @returns 清除的文件数。
  */
-export async function sweepTmp(dir: string): Promise<number> {
-  if (!existsSync(dir)) return 0;
-  let swept = 0;
-  for (const entry of await readdir(dir)) {
-    if (!entry.startsWith(TMP_PREFIX) && !LIB_TMP_RESIDUE(entry)) continue;
-    const full = join(dir, entry);
-    const s = await stat(full);
-    if (s.isFile()) {
-      await rm(full);
-      swept += 1;
-    }
-  }
-  return swept;
-}
+export async function sweepTmp(dir: string): Promise<number> {}
 
 /**
killedBy: fs-utils 原子写 sweepTmp 清扫两类临时残片并返回数量
statusReason: expected undefined to be 2 // Object.is equality

[Killed] ConditionalExpression
src/runtime/kernel/fs-utils.ts:50:7
  * @returns 清除的文件数。
  */
 export async function sweepTmp(dir: string): Promise<number> {
-  if (!existsSync(dir)) return 0;
+  if (true) return 0;
   let swept = 0;
   for (const entry of await readdir(dir)) {
killedBy: fs-utils 原子写 sweepTmp 清扫两类临时残片并返回数量
statusReason: expected +0 to be 2 // Object.is equality

[Killed] BooleanLiteral
src/runtime/kernel/fs-utils.ts:50:7
  * @returns 清除的文件数。
  */
 export async function sweepTmp(dir: string): Promise<number> {
-  if (!existsSync(dir)) return 0;
+  if (existsSync(dir)) return 0;
   let swept = 0;
   for (const entry of await readdir(dir)) {
killedBy: fs-utils 原子写 sweepTmp 清扫两类临时残片并返回数量
statusReason: expected +0 to be 2 // Object.is equality

[Killed] BlockStatement
src/runtime/kernel/fs-utils.ts:52:43
 export async function sweepTmp(dir: string): Promise<number> {
   if (!existsSync(dir)) return 0;
   let swept = 0;
-  for (const entry of await readdir(dir)) {
-    if (!entry.startsWith(TMP_PREFIX) && !LIB_TMP_RESIDUE(entry)) continue;
-    const full = join(dir, entry);
-    const s = await stat(full);
-    if (s.isFile()) {
-      await rm(full);
-      swept += 1;
-    }
-  }
+  for (const entry of await readdir(dir)) {}
   return swept;
 }
killedBy: fs-utils 原子写 sweepTmp 清扫两类临时残片并返回数量
statusReason: expected +0 to be 2 // Object.is equality

[Killed] BooleanLiteral
src/runtime/kernel/fs-utils.ts:53:42
   if (!existsSync(dir)) return 0;
   let swept = 0;
   for (const entry of await readdir(dir)) {
-    if (!entry.startsWith(TMP_PREFIX) && !LIB_TMP_RESIDUE(entry)) continue;
+    if (!entry.startsWith(TMP_PREFIX) && LIB_TMP_RESIDUE(entry)) continue;
     const full = join(dir, entry);
     const s = await stat(full);
killedBy: fs-utils 原子写 sweepTmp 清扫两类临时残片并返回数量
statusReason: expected 3 to be 2 // Object.is equality

[Killed] MethodExpression
src/runtime/kernel/fs-utils.ts:53:10
   if (!existsSync(dir)) return 0;
   let swept = 0;
   for (const entry of await readdir(dir)) {
-    if (!entry.startsWith(TMP_PREFIX) && !LIB_TMP_RESIDUE(entry)) continue;
+    if (!entry.endsWith(TMP_PREFIX) && !LIB_TMP_RESIDUE(entry)) continue;
     const full = join(dir, entry);
     const s = await stat(full);
killedBy: fs-utils 原子写 sweepTmp 清扫两类临时残片并返回数量
statusReason: expected 1 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/runtime/kernel/fs-utils.ts:56:9
     if (!entry.startsWith(TMP_PREFIX) && !LIB_TMP_RESIDUE(entry)) continue;
     const full = join(dir, entry);
     const s = await stat(full);
-    if (s.isFile()) {
+    if (true) {
       await rm(full);
       swept += 1;
killedBy: fs-utils 原子写 sweepTmp 清扫两类临时残片并返回数量
statusReason: Path is a directory: rm returned EISDIR (is a directory) /tmp/xzg-p2a-g32MB2/dir.json.not-a-file

[Killed] BlockStatement
src/runtime/kernel/fs-utils.ts:56:21
     if (!entry.startsWith(TMP_PREFIX) && !LIB_TMP_RESIDUE(entry)) continue;
     const full = join(dir, entry);
     const s = await stat(full);
-    if (s.isFile()) {
-      await rm(full);
-      swept += 1;
-    }
+    if (s.isFile()) {}
   }
   return swept;
killedBy: fs-utils 原子写 sweepTmp 清扫两类临时残片并返回数量
statusReason: expected +0 to be 2 // Object.is equality

[Killed] AssignmentOperator
src/runtime/kernel/fs-utils.ts:58:7
     const s = await stat(full);
     if (s.isFile()) {
       await rm(full);
-      swept += 1;
+      swept -= 1;
     }
   }
killedBy: fs-utils 原子写 sweepTmp 清扫两类临时残片并返回数量
statusReason: expected -2 to be 2 // Object.is equality

[Killed] BlockStatement
src/runtime/kernel/fs-utils.ts:68:69
  * 归档落点限位判定：target 必须落在 root 内（防越界写入）。
  * @returns 解析后的绝对目标路径。
  */
-export function confineToRoot(root: string, target: string): string {
-  const resolvedRoot = root.startsWith("/") ? root : join(process.cwd(), root);
-  const resolvedTarget = target.startsWith("/") ? target : join(resolvedRoot, target);
-  if (!resolvedTarget.startsWith(resolvedRoot.endsWith("/") ? resolvedRoot : resolvedRoot + "/")) {
-    throw new Error(`archive target escapes TEAM_HOME: ${target}`);
-  }
-  return resolvedTarget;
-}
+export function confineToRoot(root: string, target: string): string {}
 
 /**
killedBy: fs-utils 原子写 confineToRoot 拒绝越界目标
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Survived] MethodExpression
src/runtime/kernel/fs-utils.ts:69:24
  * @returns 解析后的绝对目标路径。
  */
 export function confineToRoot(root: string, target: string): string {
-  const resolvedRoot = root.startsWith("/") ? root : join(process.cwd(), root);
+  const resolvedRoot = root.endsWith("/") ? root : join(process.cwd(), root);
   const resolvedTarget = target.startsWith("/") ? target : join(resolvedRoot, target);
   if (!resolvedTarget.startsWith(resolvedRoot.endsWith("/") ? resolvedRoot : resolvedRoot + "/")) {

[Survived] StringLiteral
src/runtime/kernel/fs-utils.ts:69:40
  * @returns 解析后的绝对目标路径。
  */
 export function confineToRoot(root: string, target: string): string {
-  const resolvedRoot = root.startsWith("/") ? root : join(process.cwd(), root);
+  const resolvedRoot = root.startsWith("") ? root : join(process.cwd(), root);
   const resolvedTarget = target.startsWith("/") ? target : join(resolvedRoot, target);
   if (!resolvedTarget.startsWith(resolvedRoot.endsWith("/") ? resolvedRoot : resolvedRoot + "/")) {

[Survived] MethodExpression
src/runtime/kernel/fs-utils.ts:70:26
  */
 export function confineToRoot(root: string, target: string): string {
   const resolvedRoot = root.startsWith("/") ? root : join(process.cwd(), root);
-  const resolvedTarget = target.startsWith("/") ? target : join(resolvedRoot, target);
+  const resolvedTarget = target.endsWith("/") ? target : join(resolvedRoot, target);
   if (!resolvedTarget.startsWith(resolvedRoot.endsWith("/") ? resolvedRoot : resolvedRoot + "/")) {
     throw new Error(`archive target escapes TEAM_HOME: ${target}`);

[Killed] MethodExpression
src/runtime/kernel/fs-utils.ts:71:8
 export function confineToRoot(root: string, target: string): string {
   const resolvedRoot = root.startsWith("/") ? root : join(process.cwd(), root);
   const resolvedTarget = target.startsWith("/") ? target : join(resolvedRoot, target);
-  if (!resolvedTarget.startsWith(resolvedRoot.endsWith("/") ? resolvedRoot : resolvedRoot + "/")) {
+  if (!resolvedTarget.endsWith(resolvedRoot.endsWith("/") ? resolvedRoot : resolvedRoot + "/")) {
     throw new Error(`archive target escapes TEAM_HOME: ${target}`);
   }
killedBy: fs-utils 原子写 confineToRoot 拒绝越界目标
statusReason: archive target escapes TEAM_HOME: run-log.md

[Killed] ConditionalExpression
src/runtime/kernel/fs-utils.ts:71:7
 export function confineToRoot(root: string, target: string): string {
   const resolvedRoot = root.startsWith("/") ? root : join(process.cwd(), root);
   const resolvedTarget = target.startsWith("/") ? target : join(resolvedRoot, target);
-  if (!resolvedTarget.startsWith(resolvedRoot.endsWith("/") ? resolvedRoot : resolvedRoot + "/")) {
+  if (false) {
     throw new Error(`archive target escapes TEAM_HOME: ${target}`);
   }
killedBy: fs-utils 原子写 confineToRoot 拒绝越界目标
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/runtime/kernel/fs-utils.ts:82:84
  * Node 无 RENAME_NOREPLACE；防覆盖发布只能用 link。
  * @returns true = 本次创建；false = target 已存在（调用方决定残片处理）。
  */
-export async function linkNoReplace(src: string, target: string): Promise<boolean> {
-  try {
-    await link(src, target);
-    return true;
-  } catch (error) {
-    if ((error as NodeJS.ErrnoException).code === "EEXIST") return false;
-    throw error;
-  }
-}
+export async function linkNoReplace(src: string, target: string): Promise<boolean> {}
 
killedBy: Wave 1a 工具面反查挂载（子代理 → 主控实例） 子代理侧 handlers 认领主控侧信封并落主控账本
statusReason: dispatch stopped after [spawn, assign]: double-inject: envelope 7563720f-6e2a-4224-a186-4d035c301688 already in qa's mailbox

[Killed] BlockStatement
src/runtime/kernel/fs-utils.ts:83:7
  * @returns true = 本次创建；false = target 已存在（调用方决定残片处理）。
  */
 export async function linkNoReplace(src: string, target: string): Promise<boolean> {
-  try {
-    await link(src, target);
-    return true;
-  } catch (error) {
+  try {} catch (error) {
     if ((error as NodeJS.ErrnoException).code === "EEXIST") return false;
     throw error;
killedBy: team_dispatch 正常链路 spawn→assign→send 三步全成，注册表/账本/信箱/事件流逐项核对
statusReason: dispatch stopped after [spawn, assign]: double-inject: envelope 6fd34a57-3ea5-4164-94a5-f06a70319f16 already in coder's mailbox

[Killed] BooleanLiteral
src/runtime/kernel/fs-utils.ts:85:12
 export async function linkNoReplace(src: string, target: string): Promise<boolean> {
   try {
     await link(src, target);
-    return true;
+    return false;
   } catch (error) {
     if ((error as NodeJS.ErrnoException).code === "EEXIST") return false;
killedBy: Wave 1a 工具面反查挂载（子代理 → 主控实例） 子代理侧 handlers 认领主控侧信封并落主控账本
statusReason: dispatch stopped after [spawn, assign]: double-inject: envelope 320a5e78-202f-4b66-9eda-1babd12e5811 already in qa's mailbox

[Survived] BlockStatement
src/runtime/kernel/fs-utils.ts:86:19
   try {
     await link(src, target);
     return true;
-  } catch (error) {
-    if ((error as NodeJS.ErrnoException).code === "EEXIST") return false;
-    throw error;
-  }
+  } catch (error) {}
 }
 

[Killed] ConditionalExpression
src/runtime/kernel/fs-utils.ts:87:9
     await link(src, target);
     return true;
   } catch (error) {
-    if ((error as NodeJS.ErrnoException).code === "EEXIST") return false;
+    if (false) return false;
     throw error;
   }
killedBy: 信箱三段式 double-inject 拒绝：同 uuid 二次发布被 link 挡下
statusReason: expected [Function] to throw error matching /double-inject/ but got 'EEXIST: file already exists, link \'/…'

[Killed] BooleanLiteral
src/runtime/kernel/fs-utils.ts:87:68
     await link(src, target);
     return true;
   } catch (error) {
-    if ((error as NodeJS.ErrnoException).code === "EEXIST") return false;
+    if ((error as NodeJS.ErrnoException).code === "EEXIST") return true;
     throw error;
   }
killedBy: 信箱三段式 double-inject 拒绝：同 uuid 二次发布被 link 挡下
statusReason: promise resolved "'fixed-uuid'" instead of rejecting
