[Killed] BlockStatement
src/runtime/kernel/gates.ts:19:87
 }
 
 /** 打开闸口（status=pending）；同 id 已存在即拒（幂等键 = gate id）。 */
-export async function openGate(gatesDir: string, input: NewGate): Promise<GateRecord> {
-  // P0-2（#180）：gate id 入路径前白名单断言（`${id}.json` 拼文件路径）。
-  assertGateId(input.id);
-  const file = join(gatesDir, `${input.id}.json`);
-  const existing = await readJson<GateRecord>(file);
-  if (existing !== undefined) {
-    throw new GateError("gate-exists", `gate ${input.id} already exists (${existing.status})`);
-  }
-  const record: GateRecord = {
-    id: input.id,
-    status: "pending",
-    reason: input.reason,
-    requestedBy: input.requestedBy,
-    requestedAt: Date.now(),
-  };
-  await writeJsonAtomic(file, record);
-  return record;
-}
+export async function openGate(gatesDir: string, input: NewGate): Promise<GateRecord> {}
 
 /** 读单个 gate；不存在返回 undefined。 */
killedBy: gate resolve 端点 无 Origin 的 POST 被拒（agent bash/curl 场景）并留审计外无副作用
statusReason: expected undefined to be 'pending' // Object.is equality

[Killed] CallExpression
src/runtime/kernel/gates.ts:21:3
 /** 打开闸口（status=pending）；同 id 已存在即拒（幂等键 = gate id）。 */
 export async function openGate(gatesDir: string, input: NewGate): Promise<GateRecord> {
   // P0-2（#180）：gate id 入路径前白名单断言（`${id}.json` 拼文件路径）。
-  assertGateId(input.id);
+  ;
   const file = join(gatesDir, `${input.id}.json`);
   const existing = await readJson<GateRecord>(file);
killedBy: 入路径参数白名单（P0-2，#180） gates 原语 openGate/resolveGate/readGate 拒绝非法 gate id: "../../x"
statusReason: promise resolved "{ id: '../../x', …(4) }" instead of rejecting

[Killed] StringLiteral
src/runtime/kernel/gates.ts:22:31
 export async function openGate(gatesDir: string, input: NewGate): Promise<GateRecord> {
   // P0-2（#180）：gate id 入路径前白名单断言（`${id}.json` 拼文件路径）。
   assertGateId(input.id);
-  const file = join(gatesDir, `${input.id}.json`);
+  const file = join(gatesDir, ``);
   const existing = await readJson<GateRecord>(file);
   if (existing !== undefined) {
killedBy: gate resolve 端点 无 Origin 的 POST 被拒（agent bash/curl 场景）并留审计外无副作用
statusReason: expected undefined to be 'pending' // Object.is equality

[Killed] ConditionalExpression
src/runtime/kernel/gates.ts:24:7
   assertGateId(input.id);
   const file = join(gatesDir, `${input.id}.json`);
   const existing = await readJson<GateRecord>(file);
-  if (existing !== undefined) {
+  if (false) {
     throw new GateError("gate-exists", `gate ${input.id} already exists (${existing.status})`);
   }
killedBy: gates open pending → resolve 单向；重复 open / 重开 resolved 即拒
statusReason: promise resolved "{ id: 'plan-approval', …(4) }" instead of rejecting

[Killed] BlockStatement
src/runtime/kernel/gates.ts:24:31
   assertGateId(input.id);
   const file = join(gatesDir, `${input.id}.json`);
   const existing = await readJson<GateRecord>(file);
-  if (existing !== undefined) {
-    throw new GateError("gate-exists", `gate ${input.id} already exists (${existing.status})`);
-  }
+  if (existing !== undefined) {}
   const record: GateRecord = {
     id: input.id,
killedBy: gates open pending → resolve 单向；重复 open / 重开 resolved 即拒
statusReason: promise resolved "{ id: 'plan-approval', …(4) }" instead of rejecting

[Killed] StringLiteral
src/runtime/kernel/gates.ts:25:25
   const file = join(gatesDir, `${input.id}.json`);
   const existing = await readJson<GateRecord>(file);
   if (existing !== undefined) {
-    throw new GateError("gate-exists", `gate ${input.id} already exists (${existing.status})`);
+    throw new GateError("", `gate ${input.id} already exists (${existing.status})`);
   }
   const record: GateRecord = {
killedBy: gates open pending → resolve 单向；重复 open / 重开 resolved 即拒
statusReason: expected GateError: gate plan-approval already exi… { code: '' } to match object { code: 'gate-exists' }
(1 matching property omitted from actual)

[Survived] StringLiteral
src/runtime/kernel/gates.ts:25:40
   const file = join(gatesDir, `${input.id}.json`);
   const existing = await readJson<GateRecord>(file);
   if (existing !== undefined) {
-    throw new GateError("gate-exists", `gate ${input.id} already exists (${existing.status})`);
+    throw new GateError("gate-exists", ``);
   }
   const record: GateRecord = {

[Killed] ObjectLiteral
src/runtime/kernel/gates.ts:27:30
   if (existing !== undefined) {
     throw new GateError("gate-exists", `gate ${input.id} already exists (${existing.status})`);
   }
-  const record: GateRecord = {
-    id: input.id,
-    status: "pending",
-    reason: input.reason,
-    requestedBy: input.requestedBy,
-    requestedAt: Date.now(),
-  };
+  const record: GateRecord = {};
   await writeJsonAtomic(file, record);
   return record;
killedBy: gates open pending → resolve 单向；重复 open / 重开 resolved 即拒
statusReason: expected undefined to be 'pending' // Object.is equality

[Killed] BlockStatement
src/runtime/kernel/gates.ts:39:95
 }
 
 /** 读单个 gate；不存在返回 undefined。 */
-export async function readGate(gatesDir: string, id: string): Promise<GateRecord | undefined> {
-  assertGateId(id);
-  return readJson<GateRecord>(join(gatesDir, `${id}.json`));
-}
+export async function readGate(gatesDir: string, id: string): Promise<GateRecord | undefined> {}
 
 /**
killedBy: 入路径参数白名单（P0-2，#180） gates 原语 openGate/resolveGate/readGate 拒绝非法 gate id: "../../x"
statusReason: promise resolved "undefined" instead of rejecting

[Killed] CallExpression
src/runtime/kernel/gates.ts:40:3
 
 /** 读单个 gate；不存在返回 undefined。 */
 export async function readGate(gatesDir: string, id: string): Promise<GateRecord | undefined> {
-  assertGateId(id);
+  ;
   return readJson<GateRecord>(join(gatesDir, `${id}.json`));
 }
killedBy: 入路径参数白名单（P0-2，#180） gates 原语 openGate/resolveGate/readGate 拒绝非法 gate id: "../../x"
statusReason: promise resolved "{ id: '../../x', …(4) }" instead of rejecting

[Killed] BlockStatement
src/runtime/kernel/gates.ts:53:24
   id: string,
   decision: Exclude<GateStatus, "pending">,
   by: string,
-): Promise<GateRecord> {
-  assertGateId(id);
-  const file = join(gatesDir, `${id}.json`);
-  const current = await readJson<GateRecord>(file);
-  if (current === undefined) {
-    throw new GateError("gate-not-found", `gate ${id} does not exist`);
-  }
-  if (current.status !== "pending") {
-    throw new GateError("gate-resolved", `gate ${id} already resolved to ${current.status}`);
-  }
-  const next: GateRecord = {
-    ...current,
-    status: decision,
-    ...(decision === "approved" || decision === "denied"
-      ? { resolvedBy: by, resolvedAt: Date.now() }
-      : {}),
-  };
-  await writeJsonAtomic(file, next);
-  return next;
-}
+): Promise<GateRecord> {}
 
 /** 枚举全部 gate（跳过损坏文件并如实报告）。 */
killedBy: gate resolve 端点 浏览器同源批准：状态翻转 approved 且审计事件入库
statusReason: expected 409 to be 200 // Object.is equality

[Killed] CallExpression
src/runtime/kernel/gates.ts:54:3
   decision: Exclude<GateStatus, "pending">,
   by: string,
 ): Promise<GateRecord> {
-  assertGateId(id);
+  ;
   const file = join(gatesDir, `${id}.json`);
   const current = await readJson<GateRecord>(file);
killedBy: 入路径参数白名单（P0-2，#180） gates 原语 openGate/resolveGate/readGate 拒绝非法 gate id: "../../x"
statusReason: promise resolved "{ id: '../../x', …(6) }" instead of rejecting

[Killed] ConditionalExpression
src/runtime/kernel/gates.ts:57:7
   assertGateId(id);
   const file = join(gatesDir, `${id}.json`);
   const current = await readJson<GateRecord>(file);
-  if (current === undefined) {
+  if (true) {
     throw new GateError("gate-not-found", `gate ${id} does not exist`);
   }
killedBy: gates open pending → resolve 单向；重复 open / 重开 resolved 即拒
statusReason: gate plan-approval does not exist

[Killed] ConditionalExpression
src/runtime/kernel/gates.ts:57:7
   assertGateId(id);
   const file = join(gatesDir, `${id}.json`);
   const current = await readJson<GateRecord>(file);
-  if (current === undefined) {
+  if (false) {
     throw new GateError("gate-not-found", `gate ${id} does not exist`);
   }
killedBy: gates open pending → resolve 单向；重复 open / 重开 resolved 即拒
statusReason: expected TypeError: Cannot read properties of unde… to match object { code: 'gate-not-found' }

[Killed] ConditionalExpression
src/runtime/kernel/gates.ts:60:7
   if (current === undefined) {
     throw new GateError("gate-not-found", `gate ${id} does not exist`);
   }
-  if (current.status !== "pending") {
+  if (false) {
     throw new GateError("gate-resolved", `gate ${id} already resolved to ${current.status}`);
   }
killedBy: gates open pending → resolve 单向；重复 open / 重开 resolved 即拒
statusReason: promise resolved "{ id: 'plan-approval', …(6) }" instead of rejecting

[Killed] BlockStatement
src/runtime/kernel/gates.ts:60:37
   if (current === undefined) {
     throw new GateError("gate-not-found", `gate ${id} does not exist`);
   }
-  if (current.status !== "pending") {
-    throw new GateError("gate-resolved", `gate ${id} already resolved to ${current.status}`);
-  }
+  if (current.status !== "pending") {}
   const next: GateRecord = {
     ...current,
killedBy: gate resolve 端点 重复裁决被拒（pending → resolved 单向）
statusReason: expected 200 to be 409 // Object.is equality

[Killed] StringLiteral
src/runtime/kernel/gates.ts:61:25
     throw new GateError("gate-not-found", `gate ${id} does not exist`);
   }
   if (current.status !== "pending") {
-    throw new GateError("gate-resolved", `gate ${id} already resolved to ${current.status}`);
+    throw new GateError("", `gate ${id} already resolved to ${current.status}`);
   }
   const next: GateRecord = {
killedBy: gates open pending → resolve 单向；重复 open / 重开 resolved 即拒
statusReason: expected GateError: gate plan-approval already res… { code: '' } to match object { code: 'gate-resolved' }
(1 matching property omitted from actual)

[Killed] ObjectLiteral
src/runtime/kernel/gates.ts:63:28
   if (current.status !== "pending") {
     throw new GateError("gate-resolved", `gate ${id} already resolved to ${current.status}`);
   }
-  const next: GateRecord = {
-    ...current,
-    status: decision,
-    ...(decision === "approved" || decision === "denied"
-      ? { resolvedBy: by, resolvedAt: Date.now() }
-      : {}),
-  };
+  const next: GateRecord = {};
   await writeJsonAtomic(file, next);
   return next;
killedBy: gate resolve 端点 浏览器同源批准：状态翻转 approved 且审计事件入库
statusReason: expected undefined to be 'approved' // Object.is equality

[Killed] EqualityOperator
src/runtime/kernel/gates.ts:66:9
   const next: GateRecord = {
     ...current,
     status: decision,
-    ...(decision === "approved" || decision === "denied"
+    ...(decision !== "approved" || decision === "denied"
       ? { resolvedBy: by, resolvedAt: Date.now() }
       : {}),
killedBy: gate resolve 端点 浏览器同源批准：状态翻转 approved 且审计事件入库
statusReason: expected undefined to be 'human-web' // Object.is equality

[Killed] LogicalOperator
src/runtime/kernel/gates.ts:66:9
   const next: GateRecord = {
     ...current,
     status: decision,
-    ...(decision === "approved" || decision === "denied"
+    ...(decision === "approved" && decision === "denied"
       ? { resolvedBy: by, resolvedAt: Date.now() }
       : {}),
killedBy: gate resolve 端点 浏览器同源批准：状态翻转 approved 且审计事件入库
statusReason: expected undefined to be 'human-web' // Object.is equality

[Killed] BlockStatement
src/runtime/kernel/gates.ts:77:56
 /** 枚举全部 gate（跳过损坏文件并如实报告）。 */
 export async function listGates(
   gatesDir: string,
-): Promise<{ gates: GateRecord[]; corrupt: string[] }> {
-  let entries: string[];
-  try {
-    entries = await readdir(gatesDir);
-  } catch {
-    return { gates: [], corrupt: [] };
-  }
-  const gates: GateRecord[] = [];
-  const corrupt: string[] = [];
-  for (const entry of entries) {
-    if (!entry.endsWith(".json")) continue;
-    try {
-      const rec = JSON.parse(await readFile(join(gatesDir, entry), "utf8")) as unknown;
-      if (isGateRecord(rec)) gates.push(rec);
-      else corrupt.push(entry);
-    } catch {
-      corrupt.push(entry);
-    }
-  }
-  return { gates, corrupt };
-}
+): Promise<{ gates: GateRecord[]; corrupt: string[] }> {}
 
 function isGateRecord(value: unknown): value is GateRecord {
killedBy: gate resolve 端点 无 Origin 的 POST 被拒（agent bash/curl 场景）并留审计外无副作用
statusReason: Unexpected end of JSON input

[Killed] BlockStatement
src/runtime/kernel/gates.ts:79:7
   gatesDir: string,
 ): Promise<{ gates: GateRecord[]; corrupt: string[] }> {
   let entries: string[];
-  try {
-    entries = await readdir(gatesDir);
-  } catch {
+  try {} catch {
     return { gates: [], corrupt: [] };
   }
killedBy: gate resolve 端点 无 Origin 的 POST 被拒（agent bash/curl 场景）并留审计外无副作用
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[NoCoverage] BlockStatement
src/runtime/kernel/gates.ts:81:11
   let entries: string[];
   try {
     entries = await readdir(gatesDir);
-  } catch {
-    return { gates: [], corrupt: [] };
-  }
+  } catch {}
   const gates: GateRecord[] = [];
   const corrupt: string[] = [];

[NoCoverage] ArrayDeclaration
src/runtime/kernel/gates.ts:82:21
   try {
     entries = await readdir(gatesDir);
   } catch {
-    return { gates: [], corrupt: [] };
+    return { gates: ["Stryker was here"], corrupt: [] };
   }
   const gates: GateRecord[] = [];

[NoCoverage] ArrayDeclaration
src/runtime/kernel/gates.ts:82:34
   try {
     entries = await readdir(gatesDir);
   } catch {
-    return { gates: [], corrupt: [] };
+    return { gates: [], corrupt: ["Stryker was here"] };
   }
   const gates: GateRecord[] = [];

[Killed] ArrayDeclaration
src/runtime/kernel/gates.ts:84:31
   } catch {
     return { gates: [], corrupt: [] };
   }
-  const gates: GateRecord[] = [];
+  const gates: GateRecord[] = ["Stryker was here"];
   const corrupt: string[] = [];
   for (const entry of entries) {
killedBy: gate resolve 端点 无 Origin 的 POST 被拒（agent bash/curl 场景）并留审计外无副作用
statusReason: expected undefined to be 'pending' // Object.is equality

[Killed] BlockStatement
src/runtime/kernel/gates.ts:86:32
   }
   const gates: GateRecord[] = [];
   const corrupt: string[] = [];
-  for (const entry of entries) {
-    if (!entry.endsWith(".json")) continue;
-    try {
-      const rec = JSON.parse(await readFile(join(gatesDir, entry), "utf8")) as unknown;
-      if (isGateRecord(rec)) gates.push(rec);
-      else corrupt.push(entry);
-    } catch {
-      corrupt.push(entry);
-    }
-  }
+  for (const entry of entries) {}
   return { gates, corrupt };
 }
killedBy: gate resolve 端点 无 Origin 的 POST 被拒（agent bash/curl 场景）并留审计外无副作用
statusReason: expected undefined to be 'pending' // Object.is equality

[Killed] ConditionalExpression
src/runtime/kernel/gates.ts:87:9
   const gates: GateRecord[] = [];
   const corrupt: string[] = [];
   for (const entry of entries) {
-    if (!entry.endsWith(".json")) continue;
+    if (true) continue;
     try {
       const rec = JSON.parse(await readFile(join(gatesDir, entry), "utf8")) as unknown;
killedBy: gate resolve 端点 无 Origin 的 POST 被拒（agent bash/curl 场景）并留审计外无副作用
statusReason: expected undefined to be 'pending' // Object.is equality

[Killed] MethodExpression
src/runtime/kernel/gates.ts:87:10
   const gates: GateRecord[] = [];
   const corrupt: string[] = [];
   for (const entry of entries) {
-    if (!entry.endsWith(".json")) continue;
+    if (!entry.startsWith(".json")) continue;
     try {
       const rec = JSON.parse(await readFile(join(gatesDir, entry), "utf8")) as unknown;
killedBy: gate resolve 端点 无 Origin 的 POST 被拒（agent bash/curl 场景）并留审计外无副作用
statusReason: expected undefined to be 'pending' // Object.is equality

[Killed] BlockStatement
src/runtime/kernel/gates.ts:88:9
   const corrupt: string[] = [];
   for (const entry of entries) {
     if (!entry.endsWith(".json")) continue;
-    try {
-      const rec = JSON.parse(await readFile(join(gatesDir, entry), "utf8")) as unknown;
-      if (isGateRecord(rec)) gates.push(rec);
-      else corrupt.push(entry);
-    } catch {
+    try {} catch {
       corrupt.push(entry);
     }
killedBy: gate resolve 端点 无 Origin 的 POST 被拒（agent bash/curl 场景）并留审计外无副作用
statusReason: expected undefined to be 'pending' // Object.is equality

[Killed] CallExpression
src/runtime/kernel/gates.ts:90:30
     if (!entry.endsWith(".json")) continue;
     try {
       const rec = JSON.parse(await readFile(join(gatesDir, entry), "utf8")) as unknown;
-      if (isGateRecord(rec)) gates.push(rec);
+      if (isGateRecord(rec)) ;
       else corrupt.push(entry);
     } catch {
killedBy: gate resolve 端点 无 Origin 的 POST 被拒（agent bash/curl 场景）并留审计外无副作用
statusReason: expected undefined to be 'pending' // Object.is equality

[Killed] ConditionalExpression
src/runtime/kernel/gates.ts:90:11
     if (!entry.endsWith(".json")) continue;
     try {
       const rec = JSON.parse(await readFile(join(gatesDir, entry), "utf8")) as unknown;
-      if (isGateRecord(rec)) gates.push(rec);
+      if (false) gates.push(rec);
       else corrupt.push(entry);
     } catch {
killedBy: gate resolve 端点 无 Origin 的 POST 被拒（agent bash/curl 场景）并留审计外无副作用
statusReason: expected undefined to be 'pending' // Object.is equality

[NoCoverage] CallExpression
src/runtime/kernel/gates.ts:91:12
     try {
       const rec = JSON.parse(await readFile(join(gatesDir, entry), "utf8")) as unknown;
       if (isGateRecord(rec)) gates.push(rec);
-      else corrupt.push(entry);
+      else ;
     } catch {
       corrupt.push(entry);

[NoCoverage] BlockStatement
src/runtime/kernel/gates.ts:92:13
       const rec = JSON.parse(await readFile(join(gatesDir, entry), "utf8")) as unknown;
       if (isGateRecord(rec)) gates.push(rec);
       else corrupt.push(entry);
-    } catch {
-      corrupt.push(entry);
-    }
+    } catch {}
   }
   return { gates, corrupt };

[NoCoverage] CallExpression
src/runtime/kernel/gates.ts:93:7
       if (isGateRecord(rec)) gates.push(rec);
       else corrupt.push(entry);
     } catch {
-      corrupt.push(entry);
+      ;
     }
   }

[Killed] ObjectLiteral
src/runtime/kernel/gates.ts:96:10
       corrupt.push(entry);
     }
   }
-  return { gates, corrupt };
+  return {};
 }
 
killedBy: gate resolve 端点 无 Origin 的 POST 被拒（agent bash/curl 场景）并留审计外无副作用
statusReason: Cannot read properties of undefined (reading '0')

[Killed] BlockStatement
src/runtime/kernel/gates.ts:99:60
   return { gates, corrupt };
 }
 
-function isGateRecord(value: unknown): value is GateRecord {
-  const v = value as GateRecord;
-  return (
-    typeof v === "object" &&
-    v !== null &&
-    typeof v.id === "string" &&
-    (["pending", "approved", "denied"] as const).includes(v.status)
-  );
-}
+function isGateRecord(value: unknown): value is GateRecord {}
 
killedBy: gate resolve 端点 无 Origin 的 POST 被拒（agent bash/curl 场景）并留审计外无副作用
statusReason: expected undefined to be 'pending' // Object.is equality

[Killed] ConditionalExpression
src/runtime/kernel/gates.ts:102:5
 function isGateRecord(value: unknown): value is GateRecord {
   const v = value as GateRecord;
   return (
-    typeof v === "object" &&
-    v !== null &&
-    typeof v.id === "string" &&
-    (["pending", "approved", "denied"] as const).includes(v.status)
+    false
   );
 }
killedBy: gate resolve 端点 无 Origin 的 POST 被拒（agent bash/curl 场景）并留审计外无副作用
statusReason: expected undefined to be 'pending' // Object.is equality

[Killed] EqualityOperator
src/runtime/kernel/gates.ts:102:5
 function isGateRecord(value: unknown): value is GateRecord {
   const v = value as GateRecord;
   return (
-    typeof v === "object" &&
+    typeof v !== "object" &&
     v !== null &&
     typeof v.id === "string" &&
killedBy: gate resolve 端点 无 Origin 的 POST 被拒（agent bash/curl 场景）并留审计外无副作用
statusReason: expected undefined to be 'pending' // Object.is equality

[Killed] EqualityOperator
src/runtime/kernel/gates.ts:103:5
   const v = value as GateRecord;
   return (
     typeof v === "object" &&
-    v !== null &&
+    v === null &&
     typeof v.id === "string" &&
     (["pending", "approved", "denied"] as const).includes(v.status)
killedBy: gate resolve 端点 无 Origin 的 POST 被拒（agent bash/curl 场景）并留审计外无副作用
statusReason: expected undefined to be 'pending' // Object.is equality

[Survived] ConditionalExpression
src/runtime/kernel/gates.ts:103:5
   const v = value as GateRecord;
   return (
     typeof v === "object" &&
-    v !== null &&
+    true &&
     typeof v.id === "string" &&
     (["pending", "approved", "denied"] as const).includes(v.status)

[Killed] EqualityOperator
src/runtime/kernel/gates.ts:104:5
   return (
     typeof v === "object" &&
     v !== null &&
-    typeof v.id === "string" &&
+    typeof v.id !== "string" &&
     (["pending", "approved", "denied"] as const).includes(v.status)
   );
killedBy: gate resolve 端点 无 Origin 的 POST 被拒（agent bash/curl 场景）并留审计外无副作用
statusReason: expected undefined to be 'pending' // Object.is equality

[Survived] ConditionalExpression
src/runtime/kernel/gates.ts:104:5
   return (
     typeof v === "object" &&
     v !== null &&
-    typeof v.id === "string" &&
+    true &&
     (["pending", "approved", "denied"] as const).includes(v.status)
   );
