[Killed] BlockStatement
src/runtime/kernel/ledger.ts:47:51
 export class Ledger {
   private readonly tasksDir: string;
 
-  constructor(teamHome: string, tasksDir: string) {
-    this.tasksDir = tasksDir ?? join(teamHome, "ledger", "tasks");
-  }
+  constructor(teamHome: string, tasksDir: string) {}
 
   /** 创建任务，返回初始记录（status=queued, rev=1）。 */
killedBy: team_reconcile overview 一次调用返回快照摘要、成员对照、状态分布、事件游标与 goal 占位
statusReason: The "path" argument must be of type string or an instance of Buffer or URL. Received undefined

[Survived] LogicalOperator
src/runtime/kernel/ledger.ts:48:21
   private readonly tasksDir: string;
 
   constructor(teamHome: string, tasksDir: string) {
-    this.tasksDir = tasksDir ?? join(teamHome, "ledger", "tasks");
+    this.tasksDir = tasksDir && join(teamHome, "ledger", "tasks");
   }
 

[NoCoverage] StringLiteral
src/runtime/kernel/ledger.ts:48:58
   private readonly tasksDir: string;
 
   constructor(teamHome: string, tasksDir: string) {
-    this.tasksDir = tasksDir ?? join(teamHome, "ledger", "tasks");
+    this.tasksDir = tasksDir ?? join(teamHome, "ledger", "");
   }
 

[Killed] BlockStatement
src/runtime/kernel/ledger.ts:52:53
   }
 
   /** 创建任务，返回初始记录（status=queued, rev=1）。 */
-  async create(input: NewTask): Promise<TaskRecord> {
-    const now = Date.now();
-    const record: TaskRecord = {
-      id: `task-${randomUUID()}`,
-      title: input.title,
-      status: "queued",
-      room: input.room,
-      ...(input.assignee !== undefined ? { assignee: input.assignee } : {}),
-      touched: input.touched ?? [],
-      mutexGroups: input.mutexGroups ?? [],
-      rounds: 0,
-      maxRounds: input.maxRounds ?? null,
-      dod: input.dod ?? [],
-      ...(input.baseline !== undefined ? { baseline: input.baseline } : {}),
-      rev: 1,
-      createdAt: now,
-      updatedAt: now,
-    };
-    await writeJsonAtomic(this.taskFile(record.id), record);
-    return record;
-  }
+  async create(input: NewTask): Promise<TaskRecord> {}
 
   /** 读单个任务；不存在返回 undefined。 */
killedBy: team_reconcile overview 一次调用返回快照摘要、成员对照、状态分布、事件游标与 goal 占位
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] ObjectLiteral
src/runtime/kernel/ledger.ts:54:32
   /** 创建任务，返回初始记录（status=queued, rev=1）。 */
   async create(input: NewTask): Promise<TaskRecord> {
     const now = Date.now();
-    const record: TaskRecord = {
-      id: `task-${randomUUID()}`,
-      title: input.title,
-      status: "queued",
-      room: input.room,
-      ...(input.assignee !== undefined ? { assignee: input.assignee } : {}),
-      touched: input.touched ?? [],
-      mutexGroups: input.mutexGroups ?? [],
-      rounds: 0,
-      maxRounds: input.maxRounds ?? null,
-      dod: input.dod ?? [],
-      ...(input.baseline !== undefined ? { baseline: input.baseline } : {}),
-      rev: 1,
-      createdAt: now,
-      updatedAt: now,
-    };
+    const record: TaskRecord = {};
     await writeJsonAtomic(this.taskFile(record.id), record);
     return record;
killedBy: Wave 1a 工具面反查挂载（子代理 → 主控实例） 子代理侧 handlers 认领主控侧信封并落主控账本
statusReason: string field "task_id" is required

[Killed] StringLiteral
src/runtime/kernel/ledger.ts:57:15
     const record: TaskRecord = {
       id: `task-${randomUUID()}`,
       title: input.title,
-      status: "queued",
+      status: "",
       room: input.room,
       ...(input.assignee !== undefined ? { assignee: input.assignee } : {}),
killedBy: team_reconcile overview 一次调用返回快照摘要、成员对照、状态分布、事件游标与 goal 占位
statusReason: expected { '': 1 } to deeply equal { queued: 1 }

[Killed] EqualityOperator
src/runtime/kernel/ledger.ts:59:11
       title: input.title,
       status: "queued",
       room: input.room,
-      ...(input.assignee !== undefined ? { assignee: input.assignee } : {}),
+      ...(input.assignee === undefined ? { assignee: input.assignee } : {}),
       touched: input.touched ?? [],
       mutexGroups: input.mutexGroups ?? [],
killedBy: 白名单心跳触点（#97 ADR 0016） team_task_update 主控代管刷 assignee 而非调用者（镜像口径）
statusReason: expected 1700000001000 to be 1700000005000 // Object.is equality

[Killed] ConditionalExpression
src/runtime/kernel/ledger.ts:59:11
       title: input.title,
       status: "queued",
       room: input.room,
-      ...(input.assignee !== undefined ? { assignee: input.assignee } : {}),
+      ...(false ? { assignee: input.assignee } : {}),
       touched: input.touched ?? [],
       mutexGroups: input.mutexGroups ?? [],
killedBy: 白名单心跳触点（#97 ADR 0016） team_task_update 主控代管刷 assignee 而非调用者（镜像口径）
statusReason: expected 1700000001000 to be 1700000005000 // Object.is equality

[Killed] LogicalOperator
src/runtime/kernel/ledger.ts:60:16
       status: "queued",
       room: input.room,
       ...(input.assignee !== undefined ? { assignee: input.assignee } : {}),
-      touched: input.touched ?? [],
+      touched: input.touched && [],
       mutexGroups: input.mutexGroups ?? [],
       rounds: 0,
killedBy: team_reconcile overview T5-RO touched 字面交集撞车 → 冲突对入标注
statusReason: expected [] to have a length of 1 but got +0

[Killed] LogicalOperator
src/runtime/kernel/ledger.ts:61:20
       room: input.room,
       ...(input.assignee !== undefined ? { assignee: input.assignee } : {}),
       touched: input.touched ?? [],
-      mutexGroups: input.mutexGroups ?? [],
+      mutexGroups: input.mutexGroups && [],
       rounds: 0,
       maxRounds: input.maxRounds ?? null,
killedBy: team_reconcile overview T4-RO B 转 running 撞 running 的 A（同组）→ 冲突对入标注
statusReason: expected [] to have a length of 1 but got +0

[Killed] ArrayDeclaration
src/runtime/kernel/ledger.ts:61:41
       room: input.room,
       ...(input.assignee !== undefined ? { assignee: input.assignee } : {}),
       touched: input.touched ?? [],
-      mutexGroups: input.mutexGroups ?? [],
+      mutexGroups: input.mutexGroups ?? ["Stryker was here"],
       rounds: 0,
       maxRounds: input.maxRounds ?? null,
killedBy: team_reconcile overview T5-RO touched 字面交集撞车 → 冲突对入标注
statusReason: expected 'shared mutex group: Stryker was here' to contain 'touched path overlap: src/x.ts'

[Killed] LogicalOperator
src/runtime/kernel/ledger.ts:63:18
       touched: input.touched ?? [],
       mutexGroups: input.mutexGroups ?? [],
       rounds: 0,
-      maxRounds: input.maxRounds ?? null,
+      maxRounds: input.maxRounds && null,
       dod: input.dod ?? [],
       ...(input.baseline !== undefined ? { baseline: input.baseline } : {}),
killedBy: 任务账本 expectRev 乐观并发校验与 rounds 超限
statusReason: promise resolved "{ …(12) }" instead of rejecting

[Killed] LogicalOperator
src/runtime/kernel/ledger.ts:64:12
       mutexGroups: input.mutexGroups ?? [],
       rounds: 0,
       maxRounds: input.maxRounds ?? null,
-      dod: input.dod ?? [],
+      dod: input.dod && [],
       ...(input.baseline !== undefined ? { baseline: input.baseline } : {}),
       rev: 1,
killedBy: 账本字段级契约 create 完整入参：读回值与落盘一致（含可选字段）
statusReason: expected { …(14) } to deeply equal { id: StringMatching{…}, …(13) }

[Killed] ArrayDeclaration
src/runtime/kernel/ledger.ts:64:25
       mutexGroups: input.mutexGroups ?? [],
       rounds: 0,
       maxRounds: input.maxRounds ?? null,
-      dod: input.dod ?? [],
+      dod: input.dod ?? ["Stryker was here"],
       ...(input.baseline !== undefined ? { baseline: input.baseline } : {}),
       rev: 1,
killedBy: team_dispatch 正常链路 spawn→assign→send 三步全成，注册表/账本/信箱/事件流逐项核对
statusReason: expected { …(6) } to match object { from: 'root', to: 'coder', …(2) }
(3 matching properties omitted from actual)

[Killed] ConditionalExpression
src/runtime/kernel/ledger.ts:65:11
       rounds: 0,
       maxRounds: input.maxRounds ?? null,
       dod: input.dod ?? [],
-      ...(input.baseline !== undefined ? { baseline: input.baseline } : {}),
+      ...(false ? { baseline: input.baseline } : {}),
       rev: 1,
       createdAt: now,
killedBy: 账本字段级契约 create 完整入参：读回值与落盘一致（含可选字段）
statusReason: expected { …(13) } to deeply equal { id: StringMatching{…}, …(13) }

[Killed] EqualityOperator
src/runtime/kernel/ledger.ts:65:11
       rounds: 0,
       maxRounds: input.maxRounds ?? null,
       dod: input.dod ?? [],
-      ...(input.baseline !== undefined ? { baseline: input.baseline } : {}),
+      ...(input.baseline === undefined ? { baseline: input.baseline } : {}),
       rev: 1,
       createdAt: now,
killedBy: 账本字段级契约 create 完整入参：读回值与落盘一致（含可选字段）
statusReason: expected { …(13) } to deeply equal { id: StringMatching{…}, …(13) }

[Killed] BlockStatement
src/runtime/kernel/ledger.ts:75:58
   }
 
   /** 读单个任务；不存在返回 undefined。 */
-  async get(id: string): Promise<TaskRecord | undefined> {
-    return readJson<TaskRecord>(this.taskFile(id));
-  }
+  async get(id: string): Promise<TaskRecord | undefined> {}
 
   /**
killedBy: 任务账本 创建即 queued rev=1，update 合法迁移推进
statusReason: task task-551bbc2a-481c-47ea-8aff-4333e24273d9 does not exist

[Killed] EqualityOperator
src/runtime/kernel/ledger.ts:85:9
    */
   async update(id: string, patch: TaskPatch, opts: UpdateOptions = {}): Promise<TaskRecord> {
     const current = await this.get(id);
-    if (current === undefined) {
+    if (current !== undefined) {
       throw new LedgerError("task-not-found", `task ${id} does not exist`);
     }
killedBy: 任务账本 创建即 queued rev=1，update 合法迁移推进
statusReason: task task-63a24190-7045-4ade-b6ad-54df61854bbf does not exist

[Killed] ConditionalExpression
src/runtime/kernel/ledger.ts:85:9
    */
   async update(id: string, patch: TaskPatch, opts: UpdateOptions = {}): Promise<TaskRecord> {
     const current = await this.get(id);
-    if (current === undefined) {
+    if (false) {
       throw new LedgerError("task-not-found", `task ${id} does not exist`);
     }
killedBy: 任务账本 非法迁移 / 不存在任务 / rounds 回退 全拒
statusReason: expected TypeError: Cannot read properties of unde… to match object { code: 'task-not-found' }

[Killed] BlockStatement
src/runtime/kernel/ledger.ts:88:73
     if (current === undefined) {
       throw new LedgerError("task-not-found", `task ${id} does not exist`);
     }
-    if (opts.expectRev !== undefined && opts.expectRev !== current.rev) {
-      throw new LedgerError(
-        "rev-conflict",
-        `task ${id} rev mismatch: expected ${opts.expectRev}, current ${current.rev}`,
-      );
-    }
+    if (opts.expectRev !== undefined && opts.expectRev !== current.rev) {}
     if (patch.status !== undefined && !canTransition(current.status, patch.status)) {
       throw new LedgerError(
killedBy: team_dispatch 半事务语义 step2 rev 冲突即停：已完成 spawn 随错误留痕，assignee 未变、无信封
statusReason: promise resolved "{ ok: true, member: 'coder', …(4) }" instead of rejecting

[Killed] EqualityOperator
src/runtime/kernel/ledger.ts:88:9
     if (current === undefined) {
       throw new LedgerError("task-not-found", `task ${id} does not exist`);
     }
-    if (opts.expectRev !== undefined && opts.expectRev !== current.rev) {
+    if (opts.expectRev === undefined && opts.expectRev !== current.rev) {
       throw new LedgerError(
         "rev-conflict",
killedBy: team_dispatch 正常链路 spawn→assign→send 三步全成，注册表/账本/信箱/事件流逐项核对
statusReason: dispatch stopped after [spawn]: task task-61c66329-4822-44df-8c35-7639318f41b6 rev mismatch: expected undefined, current 1

[Killed] StringLiteral
src/runtime/kernel/ledger.ts:90:9
     }
     if (opts.expectRev !== undefined && opts.expectRev !== current.rev) {
       throw new LedgerError(
-        "rev-conflict",
+        "",
         `task ${id} rev mismatch: expected ${opts.expectRev}, current ${current.rev}`,
       );
killedBy: 任务账本 expectRev 乐观并发校验与 rounds 超限
statusReason: expected LedgerError: task task-b65fae48-5226-4a83… { code: '' } to match object { code: 'rev-conflict' }
(1 matching property omitted from actual)

[Survived] StringLiteral
src/runtime/kernel/ledger.ts:91:9
     if (opts.expectRev !== undefined && opts.expectRev !== current.rev) {
       throw new LedgerError(
         "rev-conflict",
-        `task ${id} rev mismatch: expected ${opts.expectRev}, current ${current.rev}`,
+        ``,
       );
     }

[Killed] EqualityOperator
src/runtime/kernel/ledger.ts:94:9
         `task ${id} rev mismatch: expected ${opts.expectRev}, current ${current.rev}`,
       );
     }
-    if (patch.status !== undefined && !canTransition(current.status, patch.status)) {
+    if (patch.status === undefined && !canTransition(current.status, patch.status)) {
       throw new LedgerError(
         "illegal-transition",
killedBy: Wave 1a 工具面反查挂载（子代理 → 主控实例） 子代理侧 handlers 认领主控侧信封并落主控账本
statusReason: dispatch stopped after [spawn]: task task-6ba5ea56-4dec-43d9-9569-cf6733a0a917: illegal transition queued -> undefined

[Killed] ConditionalExpression
src/runtime/kernel/ledger.ts:94:9
         `task ${id} rev mismatch: expected ${opts.expectRev}, current ${current.rev}`,
       );
     }
-    if (patch.status !== undefined && !canTransition(current.status, patch.status)) {
+    if (false) {
       throw new LedgerError(
         "illegal-transition",
killedBy: golden 场景一：init → spawn → task 全链路 单任务全流程：create→running→handoff→done，事件与账本逐项核对
statusReason: promise resolved "{ ok: true, …(3) }" instead of rejecting

[Survived] StringLiteral
src/runtime/kernel/ledger.ts:97:9
     if (patch.status !== undefined && !canTransition(current.status, patch.status)) {
       throw new LedgerError(
         "illegal-transition",
-        `task ${id}: illegal transition ${current.status} -> ${patch.status}`,
+        ``,
       );
     }

[Killed] BlockStatement
src/runtime/kernel/ledger.ts:100:70
         `task ${id}: illegal transition ${current.status} -> ${patch.status}`,
       );
     }
-    if (patch.rounds !== undefined && patch.rounds < current.rounds) {
-      throw new LedgerError("rounds-regress", `task ${id}: rounds cannot decrease`);
-    }
+    if (patch.rounds !== undefined && patch.rounds < current.rounds) {}
     const next: TaskRecord = {
       ...current,
killedBy: 任务账本 非法迁移 / 不存在任务 / rounds 回退 全拒
statusReason: promise resolved "{ …(12) }" instead of rejecting

[Killed] LogicalOperator
src/runtime/kernel/ledger.ts:100:9
         `task ${id}: illegal transition ${current.status} -> ${patch.status}`,
       );
     }
-    if (patch.rounds !== undefined && patch.rounds < current.rounds) {
+    if (patch.rounds !== undefined || patch.rounds < current.rounds) {
       throw new LedgerError("rounds-regress", `task ${id}: rounds cannot decrease`);
     }
killedBy: Wave 1a 工具面反查挂载（子代理 → 主控实例） 子代理侧 handlers 认领主控侧信封并落主控账本
statusReason: task task-c19a61cb-ca2c-4ae0-a2f9-e8b647685b1a: rounds cannot decrease

[Killed] ArithmeticOperator
src/runtime/kernel/ledger.ts:106:12
     const next: TaskRecord = {
       ...current,
       ...patch,
-      rev: current.rev + 1,
+      rev: current.rev - 1,
       updatedAt: Date.now(),
     };
killedBy: 任务账本 创建即 queued rev=1，update 合法迁移推进
statusReason: expected +0 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/runtime/kernel/ledger.ts:112:7
     // P2（#169 复核）：maxRounds 可为 null（未设上限），rounds-exceeded 仅在
     // 显式设定上限时触发——消除 `null > 0` 的歧义与 lint 告警。
     if (
-      patch.rounds !== undefined &&
-      next.maxRounds !== null &&
-      next.maxRounds > 0 &&
-      next.rounds > next.maxRounds
+      false
     ) {
       throw new LedgerError(
killedBy: 任务账本 expectRev 乐观并发校验与 rounds 超限
statusReason: promise resolved "{ …(12) }" instead of rejecting

[Killed] LogicalOperator
src/runtime/kernel/ledger.ts:112:7
     // P2（#169 复核）：maxRounds 可为 null（未设上限），rounds-exceeded 仅在
     // 显式设定上限时触发——消除 `null > 0` 的歧义与 lint 告警。
     if (
-      patch.rounds !== undefined &&
-      next.maxRounds !== null &&
-      next.maxRounds > 0 &&
-      next.rounds > next.maxRounds
+      patch.rounds !== undefined && next.maxRounds !== null && next.maxRounds > 0 || next.rounds > next.maxRounds
     ) {
       throw new LedgerError(
killedBy: 任务账本 非法迁移 / 不存在任务 / rounds 回退 全拒
statusReason: task task-70bb1f53-69b6-4523-a680-00043060c6b5: rounds 2 exceeds max null

[Killed] EqualityOperator
src/runtime/kernel/ledger.ts:113:7
     // 显式设定上限时触发——消除 `null > 0` 的歧义与 lint 告警。
     if (
       patch.rounds !== undefined &&
-      next.maxRounds !== null &&
+      next.maxRounds === null &&
       next.maxRounds > 0 &&
       next.rounds > next.maxRounds
killedBy: 任务账本 expectRev 乐观并发校验与 rounds 超限
statusReason: promise resolved "{ …(12) }" instead of rejecting

[Survived] ConditionalExpression
src/runtime/kernel/ledger.ts:113:7
     // 显式设定上限时触发——消除 `null > 0` 的歧义与 lint 告警。
     if (
       patch.rounds !== undefined &&
-      next.maxRounds !== null &&
+      true &&
       next.maxRounds > 0 &&
       next.rounds > next.maxRounds

[Killed] EqualityOperator
src/runtime/kernel/ledger.ts:114:7
     if (
       patch.rounds !== undefined &&
       next.maxRounds !== null &&
-      next.maxRounds > 0 &&
+      next.maxRounds <= 0 &&
       next.rounds > next.maxRounds
     ) {
killedBy: 任务账本 expectRev 乐观并发校验与 rounds 超限
statusReason: promise resolved "{ …(12) }" instead of rejecting

[Survived] EqualityOperator
src/runtime/kernel/ledger.ts:114:7
     if (
       patch.rounds !== undefined &&
       next.maxRounds !== null &&
-      next.maxRounds > 0 &&
+      next.maxRounds >= 0 &&
       next.rounds > next.maxRounds
     ) {

[Killed] ConditionalExpression
src/runtime/kernel/ledger.ts:115:7
       patch.rounds !== undefined &&
       next.maxRounds !== null &&
       next.maxRounds > 0 &&
-      next.rounds > next.maxRounds
+      true
     ) {
       throw new LedgerError(
killedBy: 账本字段级契约 update 各补丁字段生效且 updatedAt 单调推进、artifact 可写入
statusReason: task task-c52411f4-9001-4399-9d3e-04b97e763267: rounds 1 exceeds max 9

[Killed] EqualityOperator
src/runtime/kernel/ledger.ts:115:7
       patch.rounds !== undefined &&
       next.maxRounds !== null &&
       next.maxRounds > 0 &&
-      next.rounds > next.maxRounds
+      next.rounds <= next.maxRounds
     ) {
       throw new LedgerError(
killedBy: 任务账本 expectRev 乐观并发校验与 rounds 超限
statusReason: promise resolved "{ …(12) }" instead of rejecting

[Killed] BlockStatement
src/runtime/kernel/ledger.ts:116:7
       next.maxRounds !== null &&
       next.maxRounds > 0 &&
       next.rounds > next.maxRounds
-    ) {
-      throw new LedgerError(
-        "rounds-exceeded",
-        `task ${id}: rounds ${next.rounds} exceeds max ${next.maxRounds}`,
-      );
-    }
+    ) {}
     await writeJsonAtomic(this.taskFile(id), next);
     return next;
killedBy: 任务账本 expectRev 乐观并发校验与 rounds 超限
statusReason: promise resolved "{ …(12) }" instead of rejecting

[Killed] BlockStatement
src/runtime/kernel/ledger.ts:127:69
   }
 
   /** 列出全部任务（跳过临时残片与损坏文件——损坏文件名会出现在结果 warnings）。 */
-  async list(): Promise<{ tasks: TaskRecord[]; corrupt: string[] }> {
-    if (!existsSync(this.tasksDir)) {
-      await mkdir(this.tasksDir, { recursive: true });
-    }
-    const entries = await readdir(this.tasksDir);
-    const tasks: TaskRecord[] = [];
-    const corrupt: string[] = [];
-    for (const entry of entries) {
-      if (!entry.endsWith(".json")) continue;
-      try {
-        const raw = JSON.parse(await readFile(join(this.tasksDir, entry), "utf8")) as unknown;
-        if (raw === undefined || typeof raw !== "object" || typeof (raw as TaskRecord).id !== "string") {
-          corrupt.push(entry);
-          continue;
-        }
-        tasks.push(raw as TaskRecord);
-      } catch {
-        corrupt.push(entry);
-      }
-    }
-    return { tasks, corrupt };
-  }
+  async list(): Promise<{ tasks: TaskRecord[]; corrupt: string[] }> {}
 
   private taskFile(id: string): string {
killedBy: 任务账本 list 返回全部任务并可识别损坏文件
statusReason: Cannot destructure property 'tasks' of '(intermediate value)' as it is undefined.

[Killed] ConditionalExpression
src/runtime/kernel/ledger.ts:128:9
 
   /** 列出全部任务（跳过临时残片与损坏文件——损坏文件名会出现在结果 warnings）。 */
   async list(): Promise<{ tasks: TaskRecord[]; corrupt: string[] }> {
-    if (!existsSync(this.tasksDir)) {
+    if (false) {
       await mkdir(this.tasksDir, { recursive: true });
     }
killedBy: team_reconcile overview 未初始化实例返回 initialized=false 且不抛错
statusReason: ENOENT: no such file or directory, scandir '/tmp/xzg-rec-home-Ylhdbm/ledger/tasks'

[Killed] BlockStatement
src/runtime/kernel/ledger.ts:128:37
 
   /** 列出全部任务（跳过临时残片与损坏文件——损坏文件名会出现在结果 warnings）。 */
   async list(): Promise<{ tasks: TaskRecord[]; corrupt: string[] }> {
-    if (!existsSync(this.tasksDir)) {
-      await mkdir(this.tasksDir, { recursive: true });
-    }
+    if (!existsSync(this.tasksDir)) {}
     const entries = await readdir(this.tasksDir);
     const tasks: TaskRecord[] = [];
killedBy: team_reconcile overview 未初始化实例返回 initialized=false 且不抛错
statusReason: ENOENT: no such file or directory, scandir '/tmp/xzg-rec-home-nvetX3/ledger/tasks'

[Killed] BooleanLiteral
src/runtime/kernel/ledger.ts:129:47
   /** 列出全部任务（跳过临时残片与损坏文件——损坏文件名会出现在结果 warnings）。 */
   async list(): Promise<{ tasks: TaskRecord[]; corrupt: string[] }> {
     if (!existsSync(this.tasksDir)) {
-      await mkdir(this.tasksDir, { recursive: true });
+      await mkdir(this.tasksDir, { recursive: false });
     }
     const entries = await readdir(this.tasksDir);
killedBy: team_reconcile overview 未初始化实例返回 initialized=false 且不抛错
statusReason: ENOENT: no such file or directory, mkdir '/tmp/xzg-rec-home-VHHA87/ledger/tasks'

[Killed] ObjectLiteral
src/runtime/kernel/ledger.ts:129:34
   /** 列出全部任务（跳过临时残片与损坏文件——损坏文件名会出现在结果 warnings）。 */
   async list(): Promise<{ tasks: TaskRecord[]; corrupt: string[] }> {
     if (!existsSync(this.tasksDir)) {
-      await mkdir(this.tasksDir, { recursive: true });
+      await mkdir(this.tasksDir, {});
     }
     const entries = await readdir(this.tasksDir);
killedBy: team_reconcile overview 未初始化实例返回 initialized=false 且不抛错
statusReason: ENOENT: no such file or directory, mkdir '/tmp/xzg-rec-home-El5mzf/ledger/tasks'

[Killed] ArrayDeclaration
src/runtime/kernel/ledger.ts:132:33
       await mkdir(this.tasksDir, { recursive: true });
     }
     const entries = await readdir(this.tasksDir);
-    const tasks: TaskRecord[] = [];
+    const tasks: TaskRecord[] = ["Stryker was here"];
     const corrupt: string[] = [];
     for (const entry of entries) {
killedBy: team_reconcile overview 一次调用返回快照摘要、成员对照、状态分布、事件游标与 goal 占位
statusReason: expected { undefined: 1, queued: 1 } to deeply equal { queued: 1 }

[Killed] BlockStatement
src/runtime/kernel/ledger.ts:134:34
     const entries = await readdir(this.tasksDir);
     const tasks: TaskRecord[] = [];
     const corrupt: string[] = [];
-    for (const entry of entries) {
-      if (!entry.endsWith(".json")) continue;
-      try {
-        const raw = JSON.parse(await readFile(join(this.tasksDir, entry), "utf8")) as unknown;
-        if (raw === undefined || typeof raw !== "object" || typeof (raw as TaskRecord).id !== "string") {
-          corrupt.push(entry);
-          continue;
-        }
-        tasks.push(raw as TaskRecord);
-      } catch {
-        corrupt.push(entry);
-      }
-    }
+    for (const entry of entries) {}
     return { tasks, corrupt };
   }
killedBy: team_reconcile overview 一次调用返回快照摘要、成员对照、状态分布、事件游标与 goal 占位
statusReason: expected [] to deeply equal [ 'ghost' ]

[Killed] BlockStatement
src/runtime/kernel/ledger.ts:136:11
     const corrupt: string[] = [];
     for (const entry of entries) {
       if (!entry.endsWith(".json")) continue;
-      try {
-        const raw = JSON.parse(await readFile(join(this.tasksDir, entry), "utf8")) as unknown;
-        if (raw === undefined || typeof raw !== "object" || typeof (raw as TaskRecord).id !== "string") {
-          corrupt.push(entry);
-          continue;
-        }
-        tasks.push(raw as TaskRecord);
-      } catch {
+      try {} catch {
         corrupt.push(entry);
       }
killedBy: GET /api/xiaozhuge/team/detail T14: happy path——全字段形状 + stale/awaiting 划分正确
statusReason: expected [] to deeply equal [ 'task-1', 'task-2' ]

[Killed] EqualityOperator
src/runtime/kernel/ledger.ts:138:61
       if (!entry.endsWith(".json")) continue;
       try {
         const raw = JSON.parse(await readFile(join(this.tasksDir, entry), "utf8")) as unknown;
-        if (raw === undefined || typeof raw !== "object" || typeof (raw as TaskRecord).id !== "string") {
+        if (raw === undefined || typeof raw !== "object" || typeof (raw as TaskRecord).id === "string") {
           corrupt.push(entry);
           continue;
killedBy: team_reconcile overview 一次调用返回快照摘要、成员对照、状态分布、事件游标与 goal 占位
statusReason: expected [] to deeply equal [ 'ghost' ]

[Killed] EqualityOperator
src/runtime/kernel/ledger.ts:138:13
       if (!entry.endsWith(".json")) continue;
       try {
         const raw = JSON.parse(await readFile(join(this.tasksDir, entry), "utf8")) as unknown;
-        if (raw === undefined || typeof raw !== "object" || typeof (raw as TaskRecord).id !== "string") {
+        if (raw !== undefined || typeof raw !== "object" || typeof (raw as TaskRecord).id !== "string") {
           corrupt.push(entry);
           continue;
killedBy: team_reconcile overview 一次调用返回快照摘要、成员对照、状态分布、事件游标与 goal 占位
statusReason: expected [] to deeply equal [ 'ghost' ]

[NoCoverage] CallExpression
src/runtime/kernel/ledger.ts:139:11
       try {
         const raw = JSON.parse(await readFile(join(this.tasksDir, entry), "utf8")) as unknown;
         if (raw === undefined || typeof raw !== "object" || typeof (raw as TaskRecord).id !== "string") {
-          corrupt.push(entry);
+          ;
           continue;
         }

[Killed] CallExpression
src/runtime/kernel/ledger.ts:142:9
           corrupt.push(entry);
           continue;
         }
-        tasks.push(raw as TaskRecord);
+        ;
       } catch {
         corrupt.push(entry);
killedBy: team_reconcile overview 一次调用返回快照摘要、成员对照、状态分布、事件游标与 goal 占位
statusReason: expected [] to deeply equal [ 'ghost' ]

[Killed] BlockStatement
src/runtime/kernel/ledger.ts:143:15
           continue;
         }
         tasks.push(raw as TaskRecord);
-      } catch {
-        corrupt.push(entry);
-      }
+      } catch {}
     }
     return { tasks, corrupt };
killedBy: GET /api/xiaozhuge/team/detail T18: 账本损坏——corruptTaskFiles 如实透传，HTTP 仍 200
statusReason: expected [] to deeply equal [ 'broken-task.json' ]

[Killed] BlockStatement
src/runtime/kernel/ledger.ts:150:40
     return { tasks, corrupt };
   }
 
-  private taskFile(id: string): string {
-    return join(this.tasksDir, `${id}.json`);
-  }
+  private taskFile(id: string): string {}
 
   /** 清扫本目录内的临时残片，返回清除数。 */
killedBy: team_reconcile overview 一次调用返回快照摘要、成员对照、状态分布、事件游标与 goal 占位
statusReason: The "path" argument must be of type string. Received undefined

[Killed] StringLiteral
src/runtime/kernel/ledger.ts:151:32
   }
 
   private taskFile(id: string): string {
-    return join(this.tasksDir, `${id}.json`);
+    return join(this.tasksDir, ``);
   }
 
killedBy: team_reconcile overview 一次调用返回快照摘要、成员对照、状态分布、事件游标与 goal 占位
statusReason: EISDIR: illegal operation on a directory, rename '/tmp/xzg-rec-home-QYFSul/ledger/tasks.746895421' -> '/tmp/xzg-rec-home-QYFSul/ledger/tasks'

[NoCoverage] BlockStatement
src/runtime/kernel/ledger.ts:155:42
   }
 
   /** 清扫本目录内的临时残片，返回清除数。 */
-  async sweepTmpFiles(): Promise<number> {
-    return sweepTmp(this.tasksDir);
-  }
+  async sweepTmpFiles(): Promise<number> {}
 }
 

[Killed] BlockStatement
src/runtime/kernel/ledger.ts:168:52
  */
 export function findConflicts(
   tasks: TaskRecord[],
-): Array<{ a: string; b: string; reason: string }> {
-  const active = tasks.filter((t) => t.status === "running");
-  const conflicts: Array<{ a: string; b: string; reason: string }> = [];
-  for (let i = 0; i < active.length; i++) {
-    for (let j = i + 1; j < active.length; j++) {
-      const a = active[i]!;
-      const b = active[j]!;
-      if (a.room !== b.room) continue;
-      const sharedGroup = a.mutexGroups.find((g) => b.mutexGroups.includes(g));
-      if (sharedGroup !== undefined) {
-        conflicts.push({ a: a.id, b: b.id, reason: `shared mutex group: ${sharedGroup}` });
-        continue;
-      }
-      const overlap = a.touched.find((p) => b.touched.includes(p));
-      if (overlap !== undefined) {
-        conflicts.push({ a: a.id, b: b.id, reason: `touched path overlap: ${overlap}` });
-      }
-    }
-  }
-  return conflicts;
-}
+): Array<{ a: string; b: string; reason: string }> {}
 
killedBy: team_reconcile overview 一次调用返回快照摘要、成员对照、状态分布、事件游标与 goal 占位
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] ConditionalExpression
src/runtime/kernel/ledger.ts:169:38
 export function findConflicts(
   tasks: TaskRecord[],
 ): Array<{ a: string; b: string; reason: string }> {
-  const active = tasks.filter((t) => t.status === "running");
+  const active = tasks.filter((t) => true);
   const conflicts: Array<{ a: string; b: string; reason: string }> = [];
   for (let i = 0; i < active.length; i++) {
killedBy: team_reconcile overview T3 同组先后 create 均 queued 共存 → 不标（尚非 running）
statusReason: conflicts with task-1ef09d1b-b8bc-4216-aedb-e9633863b950: shared mutex group: g1

[Killed] EqualityOperator
src/runtime/kernel/ledger.ts:169:38
 export function findConflicts(
   tasks: TaskRecord[],
 ): Array<{ a: string; b: string; reason: string }> {
-  const active = tasks.filter((t) => t.status === "running");
+  const active = tasks.filter((t) => t.status !== "running");
   const conflicts: Array<{ a: string; b: string; reason: string }> = [];
   for (let i = 0; i < active.length; i++) {
killedBy: team_reconcile overview T3 同组先后 create 均 queued 共存 → 不标（尚非 running）
statusReason: expected [ { …(3) } ] to deeply equal []
