[Killed] BlockStatement
src/runtime/kernel/reachable.ts:45:85
 }
 
 /** 成员 → 其直接子成员集（children 邻接表）。 */
-export function childrenOf(members: readonly MemberRecord[]): Map<string, string[]> {
-  const children = new Map<string, string[]>();
-  for (const m of members) {
-    if (m.parent !== undefined && m.parent !== null && m.parent !== m.member) {
-      const list = children.get(m.parent) ?? [];
-      list.push(m.member);
-      children.set(m.parent, list);
-    }
-  }
-  return children;
-}
+export function childrenOf(members: readonly MemberRecord[]): Map<string, string[]> {}
 
 /** 沿 parent 链上溯至根的闭包（含自身；环/悬空时截断到已存在链）。 */
killedBy: golden 场景二：send/inbox 信箱协作 投递→认领→确认，越权发送被拒
statusReason: Cannot read properties of undefined (reading 'get')

[Killed] BlockStatement
src/runtime/kernel/reachable.ts:47:28
 /** 成员 → 其直接子成员集（children 邻接表）。 */
 export function childrenOf(members: readonly MemberRecord[]): Map<string, string[]> {
   const children = new Map<string, string[]>();
-  for (const m of members) {
-    if (m.parent !== undefined && m.parent !== null && m.parent !== m.member) {
-      const list = children.get(m.parent) ?? [];
-      list.push(m.member);
-      children.set(m.parent, list);
-    }
-  }
+  for (const m of members) {}
   return children;
 }
killedBy: golden 场景二：send/inbox 信箱协作 投递→认领→确认，越权发送被拒
statusReason: expected [ Array(1) ] to deeply equal []

[Killed] EqualityOperator
src/runtime/kernel/reachable.ts:48:9
 export function childrenOf(members: readonly MemberRecord[]): Map<string, string[]> {
   const children = new Map<string, string[]>();
   for (const m of members) {
-    if (m.parent !== undefined && m.parent !== null && m.parent !== m.member) {
+    if (m.parent === undefined && m.parent !== null && m.parent !== m.member) {
       const list = children.get(m.parent) ?? [];
       list.push(m.member);
killedBy: golden 场景二：send/inbox 信箱协作 投递→认领→确认，越权发送被拒
statusReason: expected [ Array(1) ] to deeply equal []

[Killed] BlockStatement
src/runtime/kernel/reachable.ts:48:79
 export function childrenOf(members: readonly MemberRecord[]): Map<string, string[]> {
   const children = new Map<string, string[]>();
   for (const m of members) {
-    if (m.parent !== undefined && m.parent !== null && m.parent !== m.member) {
-      const list = children.get(m.parent) ?? [];
-      list.push(m.member);
-      children.set(m.parent, list);
-    }
+    if (m.parent !== undefined && m.parent !== null && m.parent !== m.member) {}
   }
   return children;
killedBy: golden 场景二：send/inbox 信箱协作 投递→认领→确认，越权发送被拒
statusReason: expected [ Array(1) ] to deeply equal []

[Killed] LogicalOperator
src/runtime/kernel/reachable.ts:49:20
   const children = new Map<string, string[]>();
   for (const m of members) {
     if (m.parent !== undefined && m.parent !== null && m.parent !== m.member) {
-      const list = children.get(m.parent) ?? [];
+      const list = children.get(m.parent) && [];
       list.push(m.member);
       children.set(m.parent, list);
killedBy: golden 场景二：send/inbox 信箱协作 投递→认领→确认，越权发送被拒
statusReason: Cannot read properties of undefined (reading 'push')

[Killed] CallExpression
src/runtime/kernel/reachable.ts:50:7
   for (const m of members) {
     if (m.parent !== undefined && m.parent !== null && m.parent !== m.member) {
       const list = children.get(m.parent) ?? [];
-      list.push(m.member);
+      ;
       children.set(m.parent, list);
     }
killedBy: golden 场景二：send/inbox 信箱协作 投递→认领→确认，越权发送被拒
statusReason: expected [ Array(1) ] to deeply equal []

[Killed] CallExpression
src/runtime/kernel/reachable.ts:51:7
     if (m.parent !== undefined && m.parent !== null && m.parent !== m.member) {
       const list = children.get(m.parent) ?? [];
       list.push(m.member);
-      children.set(m.parent, list);
+      ;
     }
   }
killedBy: golden 场景二：send/inbox 信箱协作 投递→认领→确认，越权发送被拒
statusReason: expected [ Array(1) ] to deeply equal []

[Killed] BlockStatement
src/runtime/kernel/reachable.ts:58:90
 }
 
 /** 沿 parent 链上溯至根的闭包（含自身；环/悬空时截断到已存在链）。 */
-export function ancestorsOf(members: readonly MemberRecord[], from: string): Set<string> {
-  const byName = new Map(members.map((m) => [m.member, m] as const));
-  const seen = new Set<string>();
-  let cur: string | undefined = from;
-  while (cur !== undefined) {
-    if (seen.has(cur)) break; // 环保护：重复即停
-    seen.add(cur);
-    const rec = byName.get(cur);
-    if (rec === undefined) break; // 悬空/未在册：截断
-    const p = rec.parent;
-    cur = p === undefined || p === null || p === rec.member ? undefined : p;
-  }
-  return seen;
-}
+export function ancestorsOf(members: readonly MemberRecord[], from: string): Set<string> {}
 
 /** 由 from 出发经 children BFS 的子树闭包（含自身）。 */
killedBy: golden 场景二：send/inbox 信箱协作 投递→认领→确认，越权发送被拒
statusReason: Cannot read properties of undefined (reading 'has')

[Killed] ArrowFunction
src/runtime/kernel/reachable.ts:59:38
 
 /** 沿 parent 链上溯至根的闭包（含自身；环/悬空时截断到已存在链）。 */
 export function ancestorsOf(members: readonly MemberRecord[], from: string): Set<string> {
-  const byName = new Map(members.map((m) => [m.member, m] as const));
+  const byName = new Map(members.map(() => undefined));
   const seen = new Set<string>();
   let cur: string | undefined = from;
killedBy: golden 场景二：send/inbox 信箱协作 投递→认领→确认，越权发送被拒
statusReason: Iterator value undefined is not an entry object

[Killed] ConditionalExpression
src/runtime/kernel/reachable.ts:62:10
   const byName = new Map(members.map((m) => [m.member, m] as const));
   const seen = new Set<string>();
   let cur: string | undefined = from;
-  while (cur !== undefined) {
+  while (false) {
     if (seen.has(cur)) break; // 环保护：重复即停
     seen.add(cur);
killedBy: ancestorsOf / descendantsOf 祖先闭包：painter → {painter, coder, master}
statusReason: expected [] to deeply equal [ 'coder', 'master', 'painter' ]

[Killed] EqualityOperator
src/runtime/kernel/reachable.ts:62:10
   const byName = new Map(members.map((m) => [m.member, m] as const));
   const seen = new Set<string>();
   let cur: string | undefined = from;
-  while (cur !== undefined) {
+  while (cur === undefined) {
     if (seen.has(cur)) break; // 环保护：重复即停
     seen.add(cur);
killedBy: ancestorsOf / descendantsOf 祖先闭包：painter → {painter, coder, master}
statusReason: expected [] to deeply equal [ 'coder', 'master', 'painter' ]

[Killed] ConditionalExpression
src/runtime/kernel/reachable.ts:63:9
   const seen = new Set<string>();
   let cur: string | undefined = from;
   while (cur !== undefined) {
-    if (seen.has(cur)) break; // 环保护：重复即停
+    if (true) break; // 环保护：重复即停
     seen.add(cur);
     const rec = byName.get(cur);
killedBy: ancestorsOf / descendantsOf 祖先闭包：painter → {painter, coder, master}
statusReason: expected [] to deeply equal [ 'coder', 'master', 'painter' ]

[Survived] ConditionalExpression
src/runtime/kernel/reachable.ts:63:9
   const seen = new Set<string>();
   let cur: string | undefined = from;
   while (cur !== undefined) {
-    if (seen.has(cur)) break; // 环保护：重复即停
+    if (false) break; // 环保护：重复即停
     seen.add(cur);
     const rec = byName.get(cur);

[Killed] CallExpression
src/runtime/kernel/reachable.ts:64:5
   let cur: string | undefined = from;
   while (cur !== undefined) {
     if (seen.has(cur)) break; // 环保护：重复即停
-    seen.add(cur);
+    ;
     const rec = byName.get(cur);
     if (rec === undefined) break; // 悬空/未在册：截断
killedBy: ancestorsOf / descendantsOf 祖先闭包：painter → {painter, coder, master}
statusReason: expected [] to deeply equal [ 'coder', 'master', 'painter' ]

[Killed] EqualityOperator
src/runtime/kernel/reachable.ts:66:9
     if (seen.has(cur)) break; // 环保护：重复即停
     seen.add(cur);
     const rec = byName.get(cur);
-    if (rec === undefined) break; // 悬空/未在册：截断
+    if (rec !== undefined) break; // 悬空/未在册：截断
     const p = rec.parent;
     cur = p === undefined || p === null || p === rec.member ? undefined : p;
killedBy: ancestorsOf / descendantsOf 祖先闭包：painter → {painter, coder, master}
statusReason: expected [ 'painter' ] to deeply equal [ 'coder', 'master', 'painter' ]

[Killed] ConditionalExpression
src/runtime/kernel/reachable.ts:66:9
     if (seen.has(cur)) break; // 环保护：重复即停
     seen.add(cur);
     const rec = byName.get(cur);
-    if (rec === undefined) break; // 悬空/未在册：截断
+    if (true) break; // 悬空/未在册：截断
     const p = rec.parent;
     cur = p === undefined || p === null || p === rec.member ? undefined : p;
killedBy: ancestorsOf / descendantsOf 祖先闭包：painter → {painter, coder, master}
statusReason: expected [ 'painter' ] to deeply equal [ 'coder', 'master', 'painter' ]

[Killed] ConditionalExpression
src/runtime/kernel/reachable.ts:68:30
     const rec = byName.get(cur);
     if (rec === undefined) break; // 悬空/未在册：截断
     const p = rec.parent;
-    cur = p === undefined || p === null || p === rec.member ? undefined : p;
+    cur = p === undefined || false || p === rec.member ? undefined : p;
   }
   return seen;
killedBy: ancestorsOf / descendantsOf 祖先闭包：painter → {painter, coder, master}
statusReason: expected [ 'coder', 'master', null, 'painter' ] to deeply equal [ 'coder', 'master', 'painter' ]

[Killed] EqualityOperator
src/runtime/kernel/reachable.ts:68:30
     const rec = byName.get(cur);
     if (rec === undefined) break; // 悬空/未在册：截断
     const p = rec.parent;
-    cur = p === undefined || p === null || p === rec.member ? undefined : p;
+    cur = p === undefined || p !== null || p === rec.member ? undefined : p;
   }
   return seen;
killedBy: ancestorsOf / descendantsOf 祖先闭包：painter → {painter, coder, master}
statusReason: expected [ 'painter' ] to deeply equal [ 'coder', 'master', 'painter' ]

[Killed] BlockStatement
src/runtime/kernel/reachable.ts:74:92
 }
 
 /** 由 from 出发经 children BFS 的子树闭包（含自身）。 */
-export function descendantsOf(members: readonly MemberRecord[], from: string): Set<string> {
-  const children = childrenOf(members);
-  const seen = new Set<string>();
-  const queue = [from];
-  while (queue.length > 0) {
-    const cur = queue.shift()!;
-    if (seen.has(cur)) continue;
-    seen.add(cur);
-    for (const child of children.get(cur) ?? []) queue.push(child);
-  }
-  return seen;
-}
+export function descendantsOf(members: readonly MemberRecord[], from: string): Set<string> {}
 
 /** 树不变量校验（B-应修-1）：tier0 根唯一、非根 parent 必填且在册、无环、无自指。 */
killedBy: ancestorsOf / descendantsOf 后代闭包：master → 全员；coder → {coder, painter}
statusReason: desc is not iterable

[Killed] ArrayDeclaration
src/runtime/kernel/reachable.ts:77:17
 export function descendantsOf(members: readonly MemberRecord[], from: string): Set<string> {
   const children = childrenOf(members);
   const seen = new Set<string>();
-  const queue = [from];
+  const queue = [];
   while (queue.length > 0) {
     const cur = queue.shift()!;
killedBy: golden 场景二：send/inbox 信箱协作 投递→认领→确认，越权发送被拒
statusReason: expected [ Array(1) ] to deeply equal []

[Killed] ConditionalExpression
src/runtime/kernel/reachable.ts:78:10
   const children = childrenOf(members);
   const seen = new Set<string>();
   const queue = [from];
-  while (queue.length > 0) {
+  while (false) {
     const cur = queue.shift()!;
     if (seen.has(cur)) continue;
killedBy: ancestorsOf / descendantsOf 后代闭包：master → 全员；coder → {coder, painter}
statusReason: expected [] to deeply equal [ 'coder', 'master', 'painter', 'qa' ]

[Killed] EqualityOperator
src/runtime/kernel/reachable.ts:78:10
   const children = childrenOf(members);
   const seen = new Set<string>();
   const queue = [from];
-  while (queue.length > 0) {
+  while (queue.length <= 0) {
     const cur = queue.shift()!;
     if (seen.has(cur)) continue;
killedBy: ancestorsOf / descendantsOf 后代闭包：master → 全员；coder → {coder, painter}
statusReason: expected [] to deeply equal [ 'coder', 'master', 'painter', 'qa' ]

[Killed] ConditionalExpression
src/runtime/kernel/reachable.ts:80:9
   const queue = [from];
   while (queue.length > 0) {
     const cur = queue.shift()!;
-    if (seen.has(cur)) continue;
+    if (true) continue;
     seen.add(cur);
     for (const child of children.get(cur) ?? []) queue.push(child);
killedBy: ancestorsOf / descendantsOf 后代闭包：master → 全员；coder → {coder, painter}
statusReason: expected [] to deeply equal [ 'coder', 'master', 'painter', 'qa' ]

[Survived] ConditionalExpression
src/runtime/kernel/reachable.ts:80:9
   const queue = [from];
   while (queue.length > 0) {
     const cur = queue.shift()!;
-    if (seen.has(cur)) continue;
+    if (false) continue;
     seen.add(cur);
     for (const child of children.get(cur) ?? []) queue.push(child);

[Killed] CallExpression
src/runtime/kernel/reachable.ts:81:5
   while (queue.length > 0) {
     const cur = queue.shift()!;
     if (seen.has(cur)) continue;
-    seen.add(cur);
+    ;
     for (const child of children.get(cur) ?? []) queue.push(child);
   }
killedBy: golden 场景二：send/inbox 信箱协作 投递→认领→确认，越权发送被拒
statusReason: expected [ Array(1) ] to deeply equal []

[Killed] CallExpression
src/runtime/kernel/reachable.ts:82:50
     const cur = queue.shift()!;
     if (seen.has(cur)) continue;
     seen.add(cur);
-    for (const child of children.get(cur) ?? []) queue.push(child);
+    for (const child of children.get(cur) ?? []) ;
   }
   return seen;
killedBy: ancestorsOf / descendantsOf 后代闭包：master → 全员；coder → {coder, painter}
statusReason: expected [ 'master' ] to deeply equal [ 'coder', 'master', 'painter', 'qa' ]

[Killed] LogicalOperator
src/runtime/kernel/reachable.ts:82:25
     const cur = queue.shift()!;
     if (seen.has(cur)) continue;
     seen.add(cur);
-    for (const child of children.get(cur) ?? []) queue.push(child);
+    for (const child of children.get(cur) && []) queue.push(child);
   }
   return seen;
killedBy: ancestorsOf / descendantsOf 后代闭包：master → 全员；coder → {coder, painter}
statusReason: expected [ 'master' ] to deeply equal [ 'coder', 'master', 'painter', 'qa' ]

[Killed] ArrowFunction
src/runtime/kernel/reachable.ts:90:38
 /** 树不变量校验（B-应修-1）：tier0 根唯一、非根 parent 必填且在册、无环、无自指。 */
 export function checkTree(members: readonly MemberRecord[]): TreeViolation[] {
   const violations: TreeViolation[] = [];
-  const byName = new Map(members.map((m) => [m.member, m] as const));
+  const byName = new Map(members.map(() => undefined));
   // 单入口原则（handlers.ts:815）：有且仅有一个 tier0 无父主控。
   const tier0Roots = members.filter(
killedBy: golden 场景二：send/inbox 信箱协作 投递→认领→确认，越权发送被拒
statusReason: Iterator value undefined is not an entry object

[Killed] MethodExpression
src/runtime/kernel/reachable.ts:92:22
   const violations: TreeViolation[] = [];
   const byName = new Map(members.map((m) => [m.member, m] as const));
   // 单入口原则（handlers.ts:815）：有且仅有一个 tier0 无父主控。
-  const tier0Roots = members.filter(
-    (m) => m.tier === 0 && (m.parent === undefined || m.parent === null),
-  );
+  const tier0Roots = members;
   if (tier0Roots.length === 0) violations.push("root-missing");
   if (tier0Roots.length > 1) violations.push("multi-root");
killedBy: 树不变量（B-应修-1） 非 tier0 parent 缺省 → parent-missing 违规（孤儿同款语义）
statusReason: expected [ 'multi-root', 'parent-missing' ] to not include 'multi-root'

[Killed] EqualityOperator
src/runtime/kernel/reachable.ts:93:12
   const byName = new Map(members.map((m) => [m.member, m] as const));
   // 单入口原则（handlers.ts:815）：有且仅有一个 tier0 无父主控。
   const tier0Roots = members.filter(
-    (m) => m.tier === 0 && (m.parent === undefined || m.parent === null),
+    (m) => m.tier !== 0 && (m.parent === undefined || m.parent === null),
   );
   if (tier0Roots.length === 0) violations.push("root-missing");
killedBy: 树不变量（B-应修-1） tier0 多根 → multi-root 违规
statusReason: expected [ 'root-missing' ] to include 'multi-root'

[Killed] ArrowFunction
src/runtime/kernel/reachable.ts:93:5
   const byName = new Map(members.map((m) => [m.member, m] as const));
   // 单入口原则（handlers.ts:815）：有且仅有一个 tier0 无父主控。
   const tier0Roots = members.filter(
-    (m) => m.tier === 0 && (m.parent === undefined || m.parent === null),
+    () => undefined,
   );
   if (tier0Roots.length === 0) violations.push("root-missing");
killedBy: golden 场景二：send/inbox 信箱协作 投递→认领→确认，越权发送被拒
statusReason: expected [ 'tree violation: root-missing' ] to deeply equal []

[Killed] ConditionalExpression
src/runtime/kernel/reachable.ts:95:7
   const tier0Roots = members.filter(
     (m) => m.tier === 0 && (m.parent === undefined || m.parent === null),
   );
-  if (tier0Roots.length === 0) violations.push("root-missing");
+  if (false) violations.push("root-missing");
   if (tier0Roots.length > 1) violations.push("multi-root");
   for (const m of members) {
killedBy: 树不变量（B-应修-1） 无 tier0 根 → root-missing 违规
statusReason: expected [ 'cycle' ] to include 'root-missing'

[Killed] EqualityOperator
src/runtime/kernel/reachable.ts:95:7
   const tier0Roots = members.filter(
     (m) => m.tier === 0 && (m.parent === undefined || m.parent === null),
   );
-  if (tier0Roots.length === 0) violations.push("root-missing");
+  if (tier0Roots.length !== 0) violations.push("root-missing");
   if (tier0Roots.length > 1) violations.push("multi-root");
   for (const m of members) {
killedBy: golden 场景二：send/inbox 信箱协作 投递→认领→确认，越权发送被拒
statusReason: expected [ 'tree violation: root-missing' ] to deeply equal []

[Killed] EqualityOperator
src/runtime/kernel/reachable.ts:96:7
     (m) => m.tier === 0 && (m.parent === undefined || m.parent === null),
   );
   if (tier0Roots.length === 0) violations.push("root-missing");
-  if (tier0Roots.length > 1) violations.push("multi-root");
+  if (tier0Roots.length <= 1) violations.push("multi-root");
   for (const m of members) {
     const p = m.parent;
killedBy: golden 场景二：send/inbox 信箱协作 投递→认领→确认，越权发送被拒
statusReason: expected [ 'tree violation: multi-root' ] to deeply equal []

[Killed] ConditionalExpression
src/runtime/kernel/reachable.ts:96:7
     (m) => m.tier === 0 && (m.parent === undefined || m.parent === null),
   );
   if (tier0Roots.length === 0) violations.push("root-missing");
-  if (tier0Roots.length > 1) violations.push("multi-root");
+  if (true) violations.push("multi-root");
   for (const m of members) {
     const p = m.parent;
killedBy: golden 场景二：send/inbox 信箱协作 投递→认领→确认，越权发送被拒
statusReason: expected [ 'tree violation: multi-root' ] to deeply equal []

[Killed] ConditionalExpression
src/runtime/kernel/reachable.ts:99:28
   if (tier0Roots.length > 1) violations.push("multi-root");
   for (const m of members) {
     const p = m.parent;
-    if (p === undefined || p === null) {
+    if (p === undefined || false) {
       // 非 tier0 成员缺 parent = parent-missing（孤儿标红同款语义）。
       if (m.tier !== 0) violations.push("parent-missing");
killedBy: golden 场景二：send/inbox 信箱协作 投递→认领→确认，越权发送被拒
statusReason: expected [ 'tree violation: parent-dangling' ] to deeply equal []

[Killed] EqualityOperator
src/runtime/kernel/reachable.ts:99:28
   if (tier0Roots.length > 1) violations.push("multi-root");
   for (const m of members) {
     const p = m.parent;
-    if (p === undefined || p === null) {
+    if (p === undefined || p !== null) {
       // 非 tier0 成员缺 parent = parent-missing（孤儿标红同款语义）。
       if (m.tier !== 0) violations.push("parent-missing");
killedBy: 树不变量（B-应修-1） 非 tier0 parent 缺省 → parent-missing 违规（孤儿同款语义）
statusReason: expected [ 'parent-dangling' ] to include 'parent-missing'

[Killed] ConditionalExpression
src/runtime/kernel/reachable.ts:101:11
     const p = m.parent;
     if (p === undefined || p === null) {
       // 非 tier0 成员缺 parent = parent-missing（孤儿标红同款语义）。
-      if (m.tier !== 0) violations.push("parent-missing");
+      if (true) violations.push("parent-missing");
       continue;
     }
killedBy: 健康树零标注 标准树任意可达对 warnings 为空（固定 schema 恒在场）
statusReason: expected [ 'tree violation: parent-missing' ] to deeply equal []

[Killed] ConditionalExpression
src/runtime/kernel/reachable.ts:101:11
     const p = m.parent;
     if (p === undefined || p === null) {
       // 非 tier0 成员缺 parent = parent-missing（孤儿标红同款语义）。
-      if (m.tier !== 0) violations.push("parent-missing");
+      if (false) violations.push("parent-missing");
       continue;
     }
killedBy: golden 场景二：send/inbox 信箱协作 #138 report-only：parent-missing 成员向上发 → 触发违规标注（T6 RO 支）
statusReason: expected 'orphan and master are not ancestor-de…' to contain 'tree violation: parent-missing'

[Killed] BlockStatement
src/runtime/kernel/reachable.ts:104:25
       if (m.tier !== 0) violations.push("parent-missing");
       continue;
     }
-    if (p === m.member) {
-      violations.push("parent-self");
-      continue;
-    }
+    if (p === m.member) {}
     if (!byName.has(p)) {
       violations.push("parent-dangling");
killedBy: 树不变量（B-应修-1） 自指 → parent-self 违规
statusReason: expected [] to include 'parent-self'

[Killed] ConditionalExpression
src/runtime/kernel/reachable.ts:104:9
       if (m.tier !== 0) violations.push("parent-missing");
       continue;
     }
-    if (p === m.member) {
+    if (false) {
       violations.push("parent-self");
       continue;
killedBy: 树不变量（B-应修-1） 自指 → parent-self 违规
statusReason: expected [] to include 'parent-self'

[Killed] BooleanLiteral
src/runtime/kernel/reachable.ts:108:9
       violations.push("parent-self");
       continue;
     }
-    if (!byName.has(p)) {
+    if (byName.has(p)) {
       violations.push("parent-dangling");
       continue;
killedBy: 树不变量（B-应修-1） parent 悬空 → parent-dangling 违规
statusReason: expected [ 'cycle' ] to include 'parent-dangling'

[Killed] ConditionalExpression
src/runtime/kernel/reachable.ts:108:9
       violations.push("parent-self");
       continue;
     }
-    if (!byName.has(p)) {
+    if (false) {
       violations.push("parent-dangling");
       continue;
killedBy: 树不变量（B-应修-1） parent 悬空 → parent-dangling 违规
statusReason: expected [ 'cycle' ] to include 'parent-dangling'

[Killed] BooleanLiteral
src/runtime/kernel/reachable.ts:115:33
     // 环检测：从该节点沿 parent 链上溯，重复即环。
     const seen = new Set<string>();
     let cur: string | undefined = m.member;
-    while (cur !== undefined && !seen.has(cur)) {
+    while (cur !== undefined && seen.has(cur)) {
       seen.add(cur);
       const rec = byName.get(cur);
killedBy: golden 场景二：send/inbox 信箱协作 投递→认领→确认，越权发送被拒
statusReason: expected [ 'tree violation: cycle' ] to deeply equal []

[Killed] EqualityOperator
src/runtime/kernel/reachable.ts:115:12
     // 环检测：从该节点沿 parent 链上溯，重复即环。
     const seen = new Set<string>();
     let cur: string | undefined = m.member;
-    while (cur !== undefined && !seen.has(cur)) {
+    while (cur === undefined && !seen.has(cur)) {
       seen.add(cur);
       const rec = byName.get(cur);
killedBy: 健康树零标注 标准树任意可达对 warnings 为空（固定 schema 恒在场）
statusReason: expected [ 'tree violation: cycle' ] to deeply equal []

[Timeout] CallExpression
src/runtime/kernel/reachable.ts:116:7
     const seen = new Set<string>();
     let cur: string | undefined = m.member;
     while (cur !== undefined && !seen.has(cur)) {
-      seen.add(cur);
+      ;
       const rec = byName.get(cur);
       if (rec === undefined) break;

[Killed] EqualityOperator
src/runtime/kernel/reachable.ts:118:11
     while (cur !== undefined && !seen.has(cur)) {
       seen.add(cur);
       const rec = byName.get(cur);
-      if (rec === undefined) break;
+      if (rec !== undefined) break;
       const np = rec.parent;
       cur = np === undefined || np === null || np === rec.member ? undefined : np;
killedBy: 健康树零标注 标准树任意可达对 warnings 为空（固定 schema 恒在场）
statusReason: expected [ 'tree violation: cycle' ] to deeply equal []

[Killed] ConditionalExpression
src/runtime/kernel/reachable.ts:118:11
     while (cur !== undefined && !seen.has(cur)) {
       seen.add(cur);
       const rec = byName.get(cur);
-      if (rec === undefined) break;
+      if (false) break;
       const np = rec.parent;
       cur = np === undefined || np === null || np === rec.member ? undefined : np;
killedBy: 盲区语义 B-盲-2 发件人 parent-dangling 时：anc 截断、desc 照常（向下发可达）
statusReason: Cannot read properties of undefined (reading 'parent')

[Killed] ConditionalExpression
src/runtime/kernel/reachable.ts:120:33
       const rec = byName.get(cur);
       if (rec === undefined) break;
       const np = rec.parent;
-      cur = np === undefined || np === null || np === rec.member ? undefined : np;
+      cur = np === undefined || false || np === rec.member ? undefined : np;
     }
     if (cur !== undefined) violations.push("cycle");
killedBy: 健康树零标注 标准树任意可达对 warnings 为空（固定 schema 恒在场）
statusReason: expected [ 'tree violation: cycle' ] to deeply equal []

[Killed] EqualityOperator
src/runtime/kernel/reachable.ts:120:33
       const rec = byName.get(cur);
       if (rec === undefined) break;
       const np = rec.parent;
-      cur = np === undefined || np === null || np === rec.member ? undefined : np;
+      cur = np === undefined || np !== null || np === rec.member ? undefined : np;
     }
     if (cur !== undefined) violations.push("cycle");
killedBy: 树不变量（B-应修-1） 环 → cycle 违规
statusReason: expected [ 'root-missing' ] to include 'cycle'

[Killed] ConditionalExpression
src/runtime/kernel/reachable.ts:122:9
       const np = rec.parent;
       cur = np === undefined || np === null || np === rec.member ? undefined : np;
     }
-    if (cur !== undefined) violations.push("cycle");
+    if (true) violations.push("cycle");
   }
   // 去重（同环多节点各自检出；保留首见即可）
killedBy: 健康树零标注 标准树任意可达对 warnings 为空（固定 schema 恒在场）
statusReason: expected [ 'tree violation: cycle' ] to deeply equal []

[Killed] EqualityOperator
src/runtime/kernel/reachable.ts:122:9
       const np = rec.parent;
       cur = np === undefined || np === null || np === rec.member ? undefined : np;
     }
-    if (cur !== undefined) violations.push("cycle");
+    if (cur === undefined) violations.push("cycle");
   }
   // 去重（同环多节点各自检出；保留首见即可）
killedBy: 树不变量（B-应修-1） 环 → cycle 违规
statusReason: expected [ 'root-missing' ] to include 'cycle'

[Killed] BlockStatement
src/runtime/kernel/reachable.ts:145:31
 ): ReachabilityResult {
   const warnings: string[] = [];
   const violations = checkTree(members);
-  for (const v of violations) {
-    warnings.push(`tree violation: ${v}`);
-  }
+  for (const v of violations) {}
 
   if (from === to) {
killedBy: 树不变量（B-应修-1） tier0 多根 → multi-root 违规
statusReason: expected '' to contain 'tree violation: multi-root'

[Killed] StringLiteral
src/runtime/kernel/reachable.ts:146:19
   const warnings: string[] = [];
   const violations = checkTree(members);
   for (const v of violations) {
-    warnings.push(`tree violation: ${v}`);
+    warnings.push(``);
   }
 
killedBy: 树不变量（B-应修-1） tier0 多根 → multi-root 违规
statusReason: expected '' to contain 'tree violation: multi-root'

[Killed] ConditionalExpression
src/runtime/kernel/reachable.ts:149:7
     warnings.push(`tree violation: ${v}`);
   }
 
-  if (from === to) {
+  if (true) {
     // B-盲-1：from==to 自发恒可达（自查/自记），显式锚定。
     return { reachable: true, warnings, violations };
killedBy: auto 模式可达性（T1-T4） T3 跨分支兄弟不可达（warning 含原因）
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/runtime/kernel/reachable.ts:149:7
     warnings.push(`tree violation: ${v}`);
   }
 
-  if (from === to) {
+  if (from !== to) {
     // B-盲-1：from==to 自发恒可达（自查/自记），显式锚定。
     return { reachable: true, warnings, violations };
killedBy: auto 模式可达性（T1-T4） T3 跨分支兄弟不可达（warning 含原因）
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/runtime/kernel/reachable.ts:151:25
 
   if (from === to) {
     // B-盲-1：from==to 自发恒可达（自查/自记），显式锚定。
-    return { reachable: true, warnings, violations };
+    return { reachable: false, warnings, violations };
   }
 
killedBy: 盲区语义 B-盲-1 from==to 自发恒可达（自查/自记）
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/runtime/kernel/reachable.ts:154:7
     return { reachable: true, warnings, violations };
   }
 
-  if (mode === "explicit") {
+  if (false) {
     // B-硬伤-1 修法 1：白名单边 ⊆ 树边动态校验——explicit 声明的边必须是
     // 当前成员树的父子边（auto 可达语义即树上连通）；超树边声明即违规标注。
killedBy: explicit 模式（T5） T5 白名单外（树上相邻但未声明）不可达
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/runtime/kernel/reachable.ts:154:7
     return { reachable: true, warnings, violations };
   }
 
-  if (mode === "explicit") {
+  if (mode !== "explicit") {
     // B-硬伤-1 修法 1：白名单边 ⊆ 树边动态校验——explicit 声明的边必须是
     // 当前成员树的父子边（auto 可达语义即树上连通）；超树边声明即违规标注。
killedBy: golden 场景二：send/inbox 信箱协作 投递→认领→确认，越权发送被拒
statusReason: expected [ Array(1) ] to deeply equal []

[Killed] BlockStatement
src/runtime/kernel/reachable.ts:158:30
     // B-硬伤-1 修法 1：白名单边 ⊆ 树边动态校验——explicit 声明的边必须是
     // 当前成员树的父子边（auto 可达语义即树上连通）；超树边声明即违规标注。
     const treeAdj = new Set<string>();
-    for (const m of members) {
-      if (m.parent !== undefined && m.parent !== null && m.parent !== m.member) {
-        treeAdj.add(`${m.parent}->${m.member}`);
-        treeAdj.add(`${m.member}->${m.parent}`);
-      }
-    }
+    for (const m of members) {}
     for (const edge of comm) {
       if (!treeAdj.has(`${edge.from}->${edge.to}`)) {
killedBy: golden 场景二：send/inbox 信箱协作 #138 explicit 端到端：快照白名单判定 send 可达性（T5 RO 支，覆盖快照 comm 解析）
statusReason: expected [ Array(1) ] to deeply equal []

[Killed] EqualityOperator
src/runtime/kernel/reachable.ts:159:37
     // 当前成员树的父子边（auto 可达语义即树上连通）；超树边声明即违规标注。
     const treeAdj = new Set<string>();
     for (const m of members) {
-      if (m.parent !== undefined && m.parent !== null && m.parent !== m.member) {
+      if (m.parent !== undefined && m.parent === null && m.parent !== m.member) {
         treeAdj.add(`${m.parent}->${m.member}`);
         treeAdj.add(`${m.member}->${m.parent}`);
killedBy: golden 场景二：send/inbox 信箱协作 #138 explicit 端到端：快照白名单判定 send 可达性（T5 RO 支，覆盖快照 comm 解析）
statusReason: expected [ Array(1) ] to deeply equal []
