[Killed] BlockStatement
src/runtime/kernel/registry.ts:20:76
 const writeChains = new Map<string, Promise<unknown>>();
 
 /** 排队执行一次写任务；链尾结算后无后继则清除，避免 Map 随会话累积。 */
-function enqueueWrite<T>(file: string, task: () => Promise<T>): Promise<T> {
-  const prev = writeChains.get(file) ?? Promise.resolve();
-  const run = prev.catch(() => undefined).then(task);
-  writeChains.set(file, run);
-  // then(clear, clear) 而非 finally：run reject 时 finally 派生 promise 无人
-  // 处理会触发 unhandled rejection（与 event-log 同款理由）。
-  const clear = () => {
-    if (writeChains.get(file) === run) writeChains.delete(file);
-  };
-  void run.then(clear, clear);
-  return run;
-}
+function enqueueWrite<T>(file: string, task: () => Promise<T>): Promise<T> {}
 
 export class Registry {
killedBy: team_reconcile overview 一次调用返回快照摘要、成员对照、状态分布、事件游标与 goal 占位
statusReason: expected [] to have a length of 2 but got +0

[Killed] LogicalOperator
src/runtime/kernel/registry.ts:21:16
 
 /** 排队执行一次写任务；链尾结算后无后继则清除，避免 Map 随会话累积。 */
 function enqueueWrite<T>(file: string, task: () => Promise<T>): Promise<T> {
-  const prev = writeChains.get(file) ?? Promise.resolve();
+  const prev = writeChains.get(file) && Promise.resolve();
   const run = prev.catch(() => undefined).then(task);
   writeChains.set(file, run);
killedBy: team_reconcile overview 一次调用返回快照摘要、成员对照、状态分布、事件游标与 goal 占位
statusReason: Cannot read properties of undefined (reading 'catch')

[Survived] BlockStatement
src/runtime/kernel/registry.ts:26:23
   writeChains.set(file, run);
   // then(clear, clear) 而非 finally：run reject 时 finally 派生 promise 无人
   // 处理会触发 unhandled rejection（与 event-log 同款理由）。
-  const clear = () => {
-    if (writeChains.get(file) === run) writeChains.delete(file);
-  };
+  const clear = () => {};
   void run.then(clear, clear);
   return run;

[Survived] EqualityOperator
src/runtime/kernel/registry.ts:27:9
   // then(clear, clear) 而非 finally：run reject 时 finally 派生 promise 无人
   // 处理会触发 unhandled rejection（与 event-log 同款理由）。
   const clear = () => {
-    if (writeChains.get(file) === run) writeChains.delete(file);
+    if (writeChains.get(file) !== run) writeChains.delete(file);
   };
   void run.then(clear, clear);

[Killed] BlockStatement
src/runtime/kernel/registry.ts:36:33
 export class Registry {
   private readonly file: string;
 
-  constructor(teamHome: string) {
-    this.file = join(teamHome, "agents.json");
-  }
+  constructor(teamHome: string) {}
 
   /**
killedBy: GET /api/xiaozhuge/team/overview 团队实例投影：成员表 + 房间计数 + 尾部事件摘要（payload 不出投影面）
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/runtime/kernel/registry.ts:37:32
   private readonly file: string;
 
   constructor(teamHome: string) {
-    this.file = join(teamHome, "agents.json");
+    this.file = join(teamHome, "");
   }
 
killedBy: GET /api/xiaozhuge/team/overview 团队实例投影：成员表 + 房间计数 + 尾部事件摘要（payload 不出投影面）
statusReason: expected 500 to be 200 // Object.is equality

[Killed] BlockStatement
src/runtime/kernel/registry.ts:45:39
    * 队列外裸读：writeJsonAtomic 是临时文件 + rename 原子发布，读侧永远
    * 只见完整旧版或完整新版，不见半态；RMW 的读在队列任务内执行（见下）。
    */
-  async read(): Promise<TeamRegistry> {
-    const data = await readJson<TeamRegistry>(this.file);
-    return data ?? { members: {} };
-  }
+  async read(): Promise<TeamRegistry> {}
 
   /** 整体原子写（入队：与 RMW 任务共用同一写链，串行互斥）。 */
killedBy: golden 场景一：init → spawn → task 全链路 单任务全流程：create→running→handoff→done，事件与账本逐项核对
statusReason: Cannot read properties of undefined (reading 'members')

[Killed] LogicalOperator
src/runtime/kernel/registry.ts:47:12
    */
   async read(): Promise<TeamRegistry> {
     const data = await readJson<TeamRegistry>(this.file);
-    return data ?? { members: {} };
+    return data && {
+  members: {}
+};
   }
 
killedBy: 注册表 upsert/get/setStatus/liveMembers 对账语义
statusReason: Cannot read properties of undefined (reading 'members')

[Killed] BlockStatement
src/runtime/kernel/registry.ts:51:48
   }
 
   /** 整体原子写（入队：与 RMW 任务共用同一写链，串行互斥）。 */
-  write(registry: TeamRegistry): Promise<void> {
-    return enqueueWrite(this.file, () => writeJsonAtomic(this.file, registry));
-  }
+  write(registry: TeamRegistry): Promise<void> {}
 
   /**
killedBy: team_reconcile stale 心跳标注（#97 ADR 0016） running 成员超阈入 stale_members 并携带静默时长；主控不入名册
statusReason: expected [] to deeply equal [ { member: 'coder', …(1) } ]

[Killed] ArrowFunction
src/runtime/kernel/registry.ts:52:36
 
   /** 整体原子写（入队：与 RMW 任务共用同一写链，串行互斥）。 */
   write(registry: TeamRegistry): Promise<void> {
-    return enqueueWrite(this.file, () => writeJsonAtomic(this.file, registry));
+    return enqueueWrite(this.file, () => undefined);
   }
 
killedBy: team_reconcile stale 心跳标注（#97 ADR 0016） running 成员超阈入 stale_members 并携带静默时长；主控不入名册
statusReason: expected [] to deeply equal [ { member: 'coder', …(1) } ]

[Killed] BlockStatement
src/runtime/kernel/registry.ts:65:94
    * 整个 RMW 入队：read 在队列任务内执行，读到的必是前序写完成后的
    * 最新注册表（P0-1，#180——修并发交错覆盖丢成员记录）。
    */
-  async upsertMember(record: MemberRecord): Promise<"registered" | "idempotent" | "revived"> {
-    return enqueueWrite(this.file, async () => {
-      const reg = await this.read();
-      const existing = reg.members[record.member];
-      if (existing !== undefined && existing.status !== "dead") {
-        if (existing.durableId !== record.durableId || existing.tier !== record.tier) {
-          const err = new Error(
-            `member ${record.member} already registered as ${existing.durableId} (tier ${existing.tier}); ` +
-              "mark the old record dead before re-registering with a different durable id",
-          );
-          (err as Error & { code?: string }).code = "member-conflict";
-          throw err;
-        }
-        existing.lastSeen = Date.now();
-        await writeJsonAtomic(this.file, reg);
-        return "idempotent";
-      }
-      reg.members[record.member] = record;
-      await writeJsonAtomic(this.file, reg);
-      return existing === undefined ? "registered" : "revived";
-    });
-  }
+  async upsertMember(record: MemberRecord): Promise<"registered" | "idempotent" | "revived"> {}
 
   /** 读单个成员。 */
killedBy: team_reconcile overview 一次调用返回快照摘要、成员对照、状态分布、事件游标与 goal 占位
statusReason: expected [] to have a length of 2 but got +0

[Killed] BlockStatement
src/runtime/kernel/registry.ts:66:48
    * 最新注册表（P0-1，#180——修并发交错覆盖丢成员记录）。
    */
   async upsertMember(record: MemberRecord): Promise<"registered" | "idempotent" | "revived"> {
-    return enqueueWrite(this.file, async () => {
-      const reg = await this.read();
-      const existing = reg.members[record.member];
-      if (existing !== undefined && existing.status !== "dead") {
-        if (existing.durableId !== record.durableId || existing.tier !== record.tier) {
-          const err = new Error(
-            `member ${record.member} already registered as ${existing.durableId} (tier ${existing.tier}); ` +
-              "mark the old record dead before re-registering with a different durable id",
-          );
-          (err as Error & { code?: string }).code = "member-conflict";
-          throw err;
-        }
-        existing.lastSeen = Date.now();
-        await writeJsonAtomic(this.file, reg);
-        return "idempotent";
-      }
-      reg.members[record.member] = record;
-      await writeJsonAtomic(this.file, reg);
-      return existing === undefined ? "registered" : "revived";
-    });
+    return enqueueWrite(this.file, async () => {});
   }
 
killedBy: team_reconcile overview 一次调用返回快照摘要、成员对照、状态分布、事件游标与 goal 占位
statusReason: expected [] to have a length of 2 but got +0

[Killed] ConditionalExpression
src/runtime/kernel/registry.ts:69:11
     return enqueueWrite(this.file, async () => {
       const reg = await this.read();
       const existing = reg.members[record.member];
-      if (existing !== undefined && existing.status !== "dead") {
+      if (false) {
         if (existing.durableId !== record.durableId || existing.tier !== record.tier) {
           const err = new Error(
killedBy: init 预登记 tier0 主控（#79） 同会话重入幂等：注册表仍单条 master，事件载荷 outcome=idempotent
statusReason: expected { instance_note: null, …(2) } to match object { master: { outcome: 'idempotent' } }
(3 matching properties omitted from actual)

[Killed] BlockStatement
src/runtime/kernel/registry.ts:69:65
     return enqueueWrite(this.file, async () => {
       const reg = await this.read();
       const existing = reg.members[record.member];
-      if (existing !== undefined && existing.status !== "dead") {
-        if (existing.durableId !== record.durableId || existing.tier !== record.tier) {
-          const err = new Error(
-            `member ${record.member} already registered as ${existing.durableId} (tier ${existing.tier}); ` +
-              "mark the old record dead before re-registering with a different durable id",
-          );
-          (err as Error & { code?: string }).code = "member-conflict";
-          throw err;
-        }
-        existing.lastSeen = Date.now();
-        await writeJsonAtomic(this.file, reg);
-        return "idempotent";
-      }
+      if (existing !== undefined && existing.status !== "dead") {}
       reg.members[record.member] = record;
       await writeJsonAtomic(this.file, reg);
killedBy: init 预登记 tier0 主控（#79） 同会话重入幂等：注册表仍单条 master，事件载荷 outcome=idempotent
statusReason: expected { instance_note: null, …(2) } to match object { master: { outcome: 'idempotent' } }
(3 matching properties omitted from actual)

[Killed] EqualityOperator
src/runtime/kernel/registry.ts:70:13
       const reg = await this.read();
       const existing = reg.members[record.member];
       if (existing !== undefined && existing.status !== "dead") {
-        if (existing.durableId !== record.durableId || existing.tier !== record.tier) {
+        if (existing.durableId === record.durableId || existing.tier !== record.tier) {
           const err = new Error(
             `member ${record.member} already registered as ${existing.durableId} (tier ${existing.tier}); ` +
killedBy: 注册表 upsert 三态判定（#79）：同 id 幂等刷新 / 异 id 拒绝 / dead 复活
statusReason: member coder already registered as dur-1 (tier 1); mark the old record dead before re-registering with a different durable id

[Killed] EqualityOperator
src/runtime/kernel/registry.ts:70:56
       const reg = await this.read();
       const existing = reg.members[record.member];
       if (existing !== undefined && existing.status !== "dead") {
-        if (existing.durableId !== record.durableId || existing.tier !== record.tier) {
+        if (existing.durableId !== record.durableId || existing.tier === record.tier) {
           const err = new Error(
             `member ${record.member} already registered as ${existing.durableId} (tier ${existing.tier}); ` +
killedBy: init 预登记 tier0 主控（#79） 同会话重入幂等：注册表仍单条 master，事件载荷 outcome=idempotent
statusReason: member master already registered as session-init-master-1 (tier 0); mark the old record dead before re-registering with a different durable id

[Killed] ConditionalExpression
src/runtime/kernel/registry.ts:84:14
       }
       reg.members[record.member] = record;
       await writeJsonAtomic(this.file, reg);
-      return existing === undefined ? "registered" : "revived";
+      return false ? "registered" : "revived";
     });
   }
killedBy: 注册表 upsert 三态判定（#79）：同 id 幂等刷新 / 异 id 拒绝 / dead 复活
statusReason: expected 'revived' to be 'registered' // Object.is equality

[Killed] ConditionalExpression
src/runtime/kernel/registry.ts:84:14
       }
       reg.members[record.member] = record;
       await writeJsonAtomic(this.file, reg);
-      return existing === undefined ? "registered" : "revived";
+      return true ? "registered" : "revived";
     });
   }
killedBy: 注册表 upsert 三态判定（#79）：同 id 幂等刷新 / 异 id 拒绝 / dead 复活
statusReason: expected 'registered' to be 'revived' // Object.is equality

[Killed] BlockStatement
src/runtime/kernel/registry.ts:89:70
   }
 
   /** 读单个成员。 */
-  async getMember(member: string): Promise<MemberRecord | undefined> {
-    const reg = await this.read();
-    return reg.members[member];
-  }
+  async getMember(member: string): Promise<MemberRecord | undefined> {}
 
   /** 更新成员状态与 lastSeen；成员不存在即拒（RMW 入队）。 */
killedBy: Q6 PR-3a assignee 当前受理人语义（#150） handoff 移交后：旧持有者 assigned_task_ids 清空、新持有者含任务（当前受理人）
statusReason: handoff target qa is not registered

[Killed] BlockStatement
src/runtime/kernel/registry.ts:95:82
   }
 
   /** 更新成员状态与 lastSeen；成员不存在即拒（RMW 入队）。 */
-  async setStatus(member: string, status: MemberRecord["status"]): Promise<void> {
-    await enqueueWrite(this.file, async () => {
-      const reg = await this.read();
-      const existing = reg.members[member];
-      if (existing === undefined) {
-        throw new Error(`member ${member} is not registered`);
-      }
-      existing.status = status;
-      existing.lastSeen = Date.now();
-      await writeJsonAtomic(this.file, reg);
-    });
-  }
+  async setStatus(member: string, status: MemberRecord["status"]): Promise<void> {}
 
   /** 存活成员清单（status !== dead），供 reattach 对账。 */
killedBy: init 预登记 tier0 主控（#79） 同名异 durableId 注册被拒（member-conflict）；接管路径先标 dead 后可复位
statusReason: promise rejected "ToolError: member master already register… { code: '…' }" instead of resolving

[Killed] BlockStatement
src/runtime/kernel/registry.ts:96:47
 
   /** 更新成员状态与 lastSeen；成员不存在即拒（RMW 入队）。 */
   async setStatus(member: string, status: MemberRecord["status"]): Promise<void> {
-    await enqueueWrite(this.file, async () => {
-      const reg = await this.read();
-      const existing = reg.members[member];
-      if (existing === undefined) {
-        throw new Error(`member ${member} is not registered`);
-      }
-      existing.status = status;
-      existing.lastSeen = Date.now();
-      await writeJsonAtomic(this.file, reg);
-    });
+    await enqueueWrite(this.file, async () => {});
   }
 
killedBy: init 预登记 tier0 主控（#79） 同名异 durableId 注册被拒（member-conflict）；接管路径先标 dead 后可复位
statusReason: promise rejected "ToolError: member master already register… { code: '…' }" instead of resolving

[Killed] BlockStatement
src/runtime/kernel/registry.ts:99:35
     await enqueueWrite(this.file, async () => {
       const reg = await this.read();
       const existing = reg.members[member];
-      if (existing === undefined) {
-        throw new Error(`member ${member} is not registered`);
-      }
+      if (existing === undefined) {}
       existing.status = status;
       existing.lastSeen = Date.now();
killedBy: Registry 进程内写链（P0-1，#180） 写链任务失败不阻断后续写（队列用 catch 续链）
statusReason: expected [Function] to throw error matching /not registered/ but got 'Cannot set properties of undefined (s…'

[Killed] ConditionalExpression
src/runtime/kernel/registry.ts:99:11
     await enqueueWrite(this.file, async () => {
       const reg = await this.read();
       const existing = reg.members[member];
-      if (existing === undefined) {
+      if (true) {
         throw new Error(`member ${member} is not registered`);
       }
killedBy: 注册表 upsert/get/setStatus/liveMembers 对账语义
statusReason: member coder is not registered

[Killed] BlockStatement
src/runtime/kernel/registry.ts:109:48
   }
 
   /** 存活成员清单（status !== dead），供 reattach 对账。 */
-  async liveMembers(): Promise<MemberRecord[]> {
-    const reg = await this.read();
-    return Object.values(reg.members).filter((m) => m.status !== "dead");
-  }
+  async liveMembers(): Promise<MemberRecord[]> {}
 
   /**
killedBy: 注册表 upsert/get/setStatus/liveMembers 对账语义
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] ArrowFunction
src/runtime/kernel/registry.ts:111:46
   /** 存活成员清单（status !== dead），供 reattach 对账。 */
   async liveMembers(): Promise<MemberRecord[]> {
     const reg = await this.read();
-    return Object.values(reg.members).filter((m) => m.status !== "dead");
+    return Object.values(reg.members).filter(() => undefined);
   }
 
killedBy: 注册表 upsert/get/setStatus/liveMembers 对账语义
statusReason: expected [] to deeply equal [ 'master' ]

[Killed] MethodExpression
src/runtime/kernel/registry.ts:111:12
   /** 存活成员清单（status !== dead），供 reattach 对账。 */
   async liveMembers(): Promise<MemberRecord[]> {
     const reg = await this.read();
-    return Object.values(reg.members).filter((m) => m.status !== "dead");
+    return Object.values(reg.members);
   }
 
killedBy: 注册表 upsert/get/setStatus/liveMembers 对账语义
statusReason: expected [ 'coder', 'master' ] to deeply equal [ 'master' ]

[Killed] BlockStatement
src/runtime/kernel/registry.ts:120:52
    * ADR 0016 暂缓文件锁时期暴露的写窗口在此收敛）。成员不存在时静默跳过：
    * 非登记成员无账可刷，可达性校验由调用方 handler 负责。
    */
-  async touchMember(member: string): Promise<void> {
-    await enqueueWrite(this.file, async () => {
-      const reg = await this.read();
-      const existing = reg.members[member];
-      if (existing === undefined) return;
-      existing.lastSeen = Date.now();
-      await writeJsonAtomic(this.file, reg);
-    });
-  }
+  async touchMember(member: string): Promise<void> {}
 }
 
killedBy: 白名单心跳触点（#97 ADR 0016） team_send 刷发件人、不动收件人
statusReason: expected 1700000000000 to be 1700000005000 // Object.is equality

[Killed] BlockStatement
src/runtime/kernel/registry.ts:121:47
    * 非登记成员无账可刷，可达性校验由调用方 handler 负责。
    */
   async touchMember(member: string): Promise<void> {
-    await enqueueWrite(this.file, async () => {
-      const reg = await this.read();
-      const existing = reg.members[member];
-      if (existing === undefined) return;
-      existing.lastSeen = Date.now();
-      await writeJsonAtomic(this.file, reg);
-    });
+    await enqueueWrite(this.file, async () => {});
   }
 }
killedBy: 白名单心跳触点（#97 ADR 0016） team_send 刷发件人、不动收件人
statusReason: expected 1700000000000 to be 1700000005000 // Object.is equality

[Killed] EqualityOperator
src/runtime/kernel/registry.ts:124:11
     await enqueueWrite(this.file, async () => {
       const reg = await this.read();
       const existing = reg.members[member];
-      if (existing === undefined) return;
+      if (existing !== undefined) return;
       existing.lastSeen = Date.now();
       await writeJsonAtomic(this.file, reg);
killedBy: 注册表 touchMember 刷新 lastSeen；未登记静默跳过；其余字段保形（#97）
statusReason: expected 1000 to be greater than or equal to 1788159710891

[Killed] ConditionalExpression
src/runtime/kernel/registry.ts:124:11
     await enqueueWrite(this.file, async () => {
       const reg = await this.read();
       const existing = reg.members[member];
-      if (existing === undefined) return;
+      if (false) return;
       existing.lastSeen = Date.now();
       await writeJsonAtomic(this.file, reg);
killedBy: 注册表 touchMember 刷新 lastSeen；未登记静默跳过；其余字段保形（#97）
statusReason: promise rejected "TypeError: Cannot set properties of undef…" instead of resolving
