[Killed] StringLiteral
src/runtime/kernel/types.ts:41:12
  * done / cancelled 为终态；blocked 可回 running；queued 只能入 running 或取消。
  */
 export const TASK_TRANSITIONS: Readonly<Record<TaskStatus, readonly TaskStatus[]>> = {
-  queued: ["running", "cancelled"],
+  queued: ["", "cancelled"],
   running: ["blocked", "done", "cancelled"],
   blocked: ["running", "cancelled"],
killedBy: 状态机 合法迁移放行
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/runtime/kernel/types.ts:42:13
  */
 export const TASK_TRANSITIONS: Readonly<Record<TaskStatus, readonly TaskStatus[]>> = {
   queued: ["running", "cancelled"],
-  running: ["blocked", "done", "cancelled"],
+  running: ["", "done", "cancelled"],
   blocked: ["running", "cancelled"],
   done: [],
killedBy: 状态机 合法迁移放行
statusReason: expected false to be true // Object.is equality

[Killed] ArrayDeclaration
src/runtime/kernel/types.ts:42:12
  */
 export const TASK_TRANSITIONS: Readonly<Record<TaskStatus, readonly TaskStatus[]>> = {
   queued: ["running", "cancelled"],
-  running: ["blocked", "done", "cancelled"],
+  running: [],
   blocked: ["running", "cancelled"],
   done: [],
killedBy: 状态机 合法迁移放行
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/runtime/kernel/types.ts:43:13
 export const TASK_TRANSITIONS: Readonly<Record<TaskStatus, readonly TaskStatus[]>> = {
   queued: ["running", "cancelled"],
   running: ["blocked", "done", "cancelled"],
-  blocked: ["running", "cancelled"],
+  blocked: ["", "cancelled"],
   done: [],
   cancelled: [],
killedBy: 状态机 合法迁移放行
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/runtime/kernel/types.ts:49:74
 };
 
 /** 是否允许从 from 迁移到 to。 */
-export function canTransition(from: TaskStatus, to: TaskStatus): boolean {
-  return TASK_TRANSITIONS[from].includes(to);
-}
+export function canTransition(from: TaskStatus, to: TaskStatus): boolean {}
 
 /**
killedBy: 状态机 合法迁移放行
statusReason: expected undefined to be true // Object.is equality

[Killed] ArithmeticOperator
src/runtime/kernel/types.ts:63:35
  * 判定为严格大于（恰达阈值仍算新鲜——宁少标勿错标）。待真实运行误标率
  * 数据产出后以增量 ADR 调参（Wave 3 数据驱动，见 issue #120 计划）。
  */
-export const STALE_THRESHOLD_MS = 30 * 60 * 1000;
+export const STALE_THRESHOLD_MS = 30 * 60 / 1000;
 
 /** 共享任务账本单条记录（每任务一文件，原子写）。 */
killedBy: team_reconcile overview 一次调用返回快照摘要、成员对照、状态分布、事件游标与 goal 占位
statusReason: expected true to be false // Object.is equality

[Killed] ArithmeticOperator
src/runtime/kernel/types.ts:63:35
  * 判定为严格大于（恰达阈值仍算新鲜——宁少标勿错标）。待真实运行误标率
  * 数据产出后以增量 ADR 调参（Wave 3 数据驱动，见 issue #120 计划）。
  */
-export const STALE_THRESHOLD_MS = 30 * 60 * 1000;
+export const STALE_THRESHOLD_MS = 30 / 60 * 1000;
 
 /** 共享任务账本单条记录（每任务一文件，原子写）。 */
killedBy: team_reconcile stale 心跳标注（#97 ADR 0016） STALE_THRESHOLD_MS 锚点恒等：3× delivering TTL（协议常量区与 recovery 层不漂移脱钩）
statusReason: expected 500 to be 1800000 // Object.is equality

[Killed] BlockStatement
src/runtime/kernel/types.ts:165:72
 }
 
 /** 保留态判定（原 isStage，语义收窄为保留态三元组）。 */
-export function isReservedStage(value: string): value is ReservedStage {
-  return (RESERVED_STAGES as readonly string[]).includes(value);
-}
+export function isReservedStage(value: string): value is ReservedStage {}
 
killedBy: golden 场景三：黑板读写与非法值全拒 state_set 保留态强制 + state_get 读回
statusReason: blackboard status must be one of running|blocked|done, got: running
