[Killed] BlockStatement
src/runtime/kernel/fs-utils.ts:42:82
  * 原子写 UTF-8 文本（#212 P0-1 brief 工件化）：与 {@link writeJsonAtomic}
  * 同一 write-file-atomic 通道（同目录临时文件 + rename）。
  */
-export async function writeTextAtomic(file: string, text: string): Promise<void> {
-  await ensureDir(dirname(file));
-  await writeFileAtomic(file, text, "utf8");
-}
+export async function writeTextAtomic(file: string, text: string): Promise<void> {}
 
 /** 读 JSON 文件；不存在时返回 undefined。 */
killedBy: P0-1 init brief 工件化 user_prompt 非空：brief 在场且水印外与 user_prompt 逐字节一致
statusReason: ENOENT: no such file or directory, open '/tmp/xzg-brief-qdvZo6/rooms/root/brief/user-request.md'

[Killed] ConditionalExpression
src/runtime/kernel/fs-utils.ts:49:7
 
 /** 读 JSON 文件；不存在时返回 undefined。 */
 export async function readJson<T>(file: string): Promise<T | undefined> {
-  if (!existsSync(file)) return undefined;
+  if (false) return undefined;
   return JSON.parse(await readFile(file, "utf8")) as T;
 }
killedBy: team_reconcile overview 一次调用返回快照摘要、成员对照、状态分布、事件游标与 goal 占位
statusReason: ENOENT: no such file or directory, open '/tmp/xzg-rec-home-x9BJxr/agents.json'

[Killed] LogicalOperator
src/runtime/kernel/fs-utils.ts:62:9
   if (!existsSync(dir)) return 0;
   let swept = 0;
   for (const entry of await readdir(dir)) {
-    if (!entry.startsWith(TMP_PREFIX) && !LIB_TMP_RESIDUE(entry)) continue;
+    if (!entry.startsWith(TMP_PREFIX) || !LIB_TMP_RESIDUE(entry)) continue;
     const full = join(dir, entry);
     const s = await stat(full);
killedBy: fs-utils 原子写 sweepTmp 清扫两类临时残片并返回数量
statusReason: expected +0 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/runtime/kernel/fs-utils.ts:65:9
     if (!entry.startsWith(TMP_PREFIX) && !LIB_TMP_RESIDUE(entry)) continue;
     const full = join(dir, entry);
     const s = await stat(full);
-    if (s.isFile()) {
+    if (false) {
       await rm(full);
       swept += 1;
killedBy: fs-utils 原子写 sweepTmp 清扫两类临时残片并返回数量
statusReason: expected +0 to be 2 // Object.is equality

[Killed] StringLiteral
src/runtime/kernel/fs-utils.ts:79:44
  */
 export function confineToRoot(root: string, target: string): string {
   const resolvedRoot = root.startsWith("/") ? root : join(process.cwd(), root);
-  const resolvedTarget = target.startsWith("/") ? target : join(resolvedRoot, target);
+  const resolvedTarget = target.startsWith("") ? target : join(resolvedRoot, target);
   if (!resolvedTarget.startsWith(resolvedRoot.endsWith("/") ? resolvedRoot : resolvedRoot + "/")) {
     throw new Error(`archive target escapes TEAM_HOME: ${target}`);
killedBy: fs-utils 原子写 confineToRoot 拒绝越界目标
statusReason: archive target escapes TEAM_HOME: run-log.md

[Killed] BlockStatement
src/runtime/kernel/fs-utils.ts:80:99
 export function confineToRoot(root: string, target: string): string {
   const resolvedRoot = root.startsWith("/") ? root : join(process.cwd(), root);
   const resolvedTarget = target.startsWith("/") ? target : join(resolvedRoot, target);
-  if (!resolvedTarget.startsWith(resolvedRoot.endsWith("/") ? resolvedRoot : resolvedRoot + "/")) {
-    throw new Error(`archive target escapes TEAM_HOME: ${target}`);
-  }
+  if (!resolvedTarget.startsWith(resolvedRoot.endsWith("/") ? resolvedRoot : resolvedRoot + "/")) {}
   return resolvedTarget;
 }
killedBy: fs-utils 原子写 confineToRoot 拒绝越界目标
statusReason: expected [Function] to throw an error

[Killed] StringLiteral
src/runtime/kernel/fs-utils.ts:81:21
   const resolvedRoot = root.startsWith("/") ? root : join(process.cwd(), root);
   const resolvedTarget = target.startsWith("/") ? target : join(resolvedRoot, target);
   if (!resolvedTarget.startsWith(resolvedRoot.endsWith("/") ? resolvedRoot : resolvedRoot + "/")) {
-    throw new Error(`archive target escapes TEAM_HOME: ${target}`);
+    throw new Error(``);
   }
   return resolvedTarget;
killedBy: fs-utils 原子写 confineToRoot 拒绝越界目标
statusReason: expected [Function] to throw error matching /escapes/ but got ''

[Killed] EqualityOperator
src/runtime/kernel/fs-utils.ts:96:9
     await link(src, target);
     return true;
   } catch (error) {
-    if ((error as NodeJS.ErrnoException).code === "EEXIST") return false;
+    if ((error as NodeJS.ErrnoException).code !== "EEXIST") return false;
     throw error;
   }
killedBy: 信箱三段式 double-inject 拒绝：同 uuid 二次发布被 link 挡下
statusReason: expected [Function] to throw error matching /double-inject/ but got 'EEXIST: file already exists, link \'/…'
