[Killed] BlockStatement
src/runtime/kernel/recovery.ts:84:32
 export async function discardRunningSentinels(
   stateDir: string,
   aliveRoles?: ReadonlySet<string>,
-): Promise<SentinelRecovery[]> {
-  if (!existsSync(stateDir)) return [];
-  const result: SentinelRecovery[] = [];
-  for (const entry of await readdir(stateDir)) {
-    if (!entry.endsWith(".json")) continue;
-    const full = join(stateDir, entry);
-    const role = entry.replace(/\.json$/, "");
-    const shard = await readJson<{ status?: string }>(full);
-    if (shard?.status !== "running") continue;
-    if (aliveRoles !== undefined && aliveRoles.has(role)) {
-      result.push({ role, action: "kept-alive" });
-      continue;
-    }
-    await rm(full);
-    result.push({ role, action: "discarded" });
-  }
-  return result;
-}
+): Promise<SentinelRecovery[]> {}
 
killedBy: 黑板分片 哨兵恢复与黑板联动：作废后分片消失
statusReason: expected undefined to deeply equal [ { role: 'coder', …(1) } ]

[Killed] ConditionalExpression
src/runtime/kernel/recovery.ts:85:7
   stateDir: string,
   aliveRoles?: ReadonlySet<string>,
 ): Promise<SentinelRecovery[]> {
-  if (!existsSync(stateDir)) return [];
+  if (true) return [];
   const result: SentinelRecovery[] = [];
   for (const entry of await readdir(stateDir)) {
killedBy: 恢复原语 黑板 running 哨兵整分片作废
statusReason: expected [] to deeply equal [ { role: 'coder', …(1) } ]

[Killed] ConditionalExpression
src/runtime/kernel/recovery.ts:85:7
   stateDir: string,
   aliveRoles?: ReadonlySet<string>,
 ): Promise<SentinelRecovery[]> {
-  if (!existsSync(stateDir)) return [];
+  if (false) return [];
   const result: SentinelRecovery[] = [];
   for (const entry of await readdir(stateDir)) {
killedBy: 恢复原语边界补强 stateDir 不存在时哨兵恢复返回空
statusReason: ENOENT: no such file or directory, scandir '/tmp/xzg-p2a-QMT3br/no-such-state'

[Killed] ArrayDeclaration
src/runtime/kernel/recovery.ts:86:38
   aliveRoles?: ReadonlySet<string>,
 ): Promise<SentinelRecovery[]> {
   if (!existsSync(stateDir)) return [];
-  const result: SentinelRecovery[] = [];
+  const result: SentinelRecovery[] = ["Stryker was here"];
   for (const entry of await readdir(stateDir)) {
     if (!entry.endsWith(".json")) continue;
killedBy: 恢复原语 黑板 running 哨兵整分片作废
statusReason: expected [ 'Stryker was here', …(1) ] to deeply equal [ { role: 'coder', …(1) } ]

[Killed] BlockStatement
src/runtime/kernel/recovery.ts:87:48
 ): Promise<SentinelRecovery[]> {
   if (!existsSync(stateDir)) return [];
   const result: SentinelRecovery[] = [];
-  for (const entry of await readdir(stateDir)) {
-    if (!entry.endsWith(".json")) continue;
-    const full = join(stateDir, entry);
-    const role = entry.replace(/\.json$/, "");
-    const shard = await readJson<{ status?: string }>(full);
-    if (shard?.status !== "running") continue;
-    if (aliveRoles !== undefined && aliveRoles.has(role)) {
-      result.push({ role, action: "kept-alive" });
-      continue;
-    }
-    await rm(full);
-    result.push({ role, action: "discarded" });
-  }
+  for (const entry of await readdir(stateDir)) {}
   return result;
 }
killedBy: 黑板分片 哨兵恢复与黑板联动：作废后分片消失
statusReason: expected [] to deeply equal [ { role: 'coder', …(1) } ]

[Survived] Regex
src/runtime/kernel/recovery.ts:90:32
   for (const entry of await readdir(stateDir)) {
     if (!entry.endsWith(".json")) continue;
     const full = join(stateDir, entry);
-    const role = entry.replace(/\.json$/, "");
+    const role = entry.replace(/\.json/, "");
     const shard = await readJson<{ status?: string }>(full);
     if (shard?.status !== "running") continue;

[Killed] LogicalOperator
src/runtime/kernel/recovery.ts:93:9
     const role = entry.replace(/\.json$/, "");
     const shard = await readJson<{ status?: string }>(full);
     if (shard?.status !== "running") continue;
-    if (aliveRoles !== undefined && aliveRoles.has(role)) {
+    if (aliveRoles !== undefined || aliveRoles.has(role)) {
       result.push({ role, action: "kept-alive" });
       continue;
killedBy: 黑板分片 哨兵恢复与黑板联动：作废后分片消失
statusReason: Cannot read properties of undefined (reading 'has')

[Killed] ConditionalExpression
src/runtime/kernel/recovery.ts:93:9
     const role = entry.replace(/\.json$/, "");
     const shard = await readJson<{ status?: string }>(full);
     if (shard?.status !== "running") continue;
-    if (aliveRoles !== undefined && aliveRoles.has(role)) {
+    if (true) {
       result.push({ role, action: "kept-alive" });
       continue;
killedBy: 黑板分片 哨兵恢复与黑板联动：作废后分片消失
statusReason: expected [ { role: 'coder', …(1) } ] to deeply equal [ { role: 'coder', …(1) } ]

[Killed] StringLiteral
src/runtime/kernel/recovery.ts:94:35
     const shard = await readJson<{ status?: string }>(full);
     if (shard?.status !== "running") continue;
     if (aliveRoles !== undefined && aliveRoles.has(role)) {
-      result.push({ role, action: "kept-alive" });
+      result.push({ role, action: "" });
       continue;
     }
killedBy: 黑板分片 #192 存活前置：aliveRoles 命中的 running 分片保留（热重载不误删），未命中的照常作废
statusReason: expected [ { role: 'coder', action: '' }, …(1) ] to deeply equal [ { role: 'coder', …(1) }, …(1) ]
