[Killed] MethodExpression
src/runtime/kernel/stale.ts:42:22
   blockedRoles: ReadonlySet<string>,
   nowMs: number,
 ): StaleVerdict {
-  const candidates = members.filter(
-    (m) => m.tier !== 0 && m.status === "running" && Number.isFinite(m.lastSeen),
-  );
+  const candidates = members;
   const annotate = (m: MemberRecord): StaleMemberAnnotation => ({
     member: m.member,
killedBy: team_reconcile stale 心跳标注（#97 ADR 0016） tier0 主控超阈仅亮 master_idle（消除自刷矛盾与续命放大通道）
statusReason: expected [ { member: 'master', …(1) } ] to deeply equal []

[Killed] ConditionalExpression
src/runtime/kernel/stale.ts:43:12
   nowMs: number,
 ): StaleVerdict {
   const candidates = members.filter(
-    (m) => m.tier !== 0 && m.status === "running" && Number.isFinite(m.lastSeen),
+    (m) => false,
   );
   const annotate = (m: MemberRecord): StaleMemberAnnotation => ({
killedBy: team_reconcile stale 心跳标注（#97 ADR 0016） running 成员超阈入 stale_members 并携带静默时长；主控不入名册
statusReason: expected [] to deeply equal [ { member: 'coder', …(1) } ]

[Killed] ArrowFunction
src/runtime/kernel/stale.ts:45:20
   const candidates = members.filter(
     (m) => m.tier !== 0 && m.status === "running" && Number.isFinite(m.lastSeen),
   );
-  const annotate = (m: MemberRecord): StaleMemberAnnotation => ({
-    member: m.member,
-    lastSeenAgeMs: nowMs - m.lastSeen,
-  });
+  const annotate = () => undefined;
   const byNameAsc = (a: { member: string }, b: { member: string }): number =>
     a.member.localeCompare(b.member);
killedBy: team_reconcile stale 心跳标注（#97 ADR 0016） running 成员超阈入 stale_members 并携带静默时长；主控不入名册
statusReason: Cannot read properties of undefined (reading 'member')

[Killed] ArithmeticOperator
src/runtime/kernel/stale.ts:51:55
   });
   const byNameAsc = (a: { member: string }, b: { member: string }): number =>
     a.member.localeCompare(b.member);
-  const overThreshold = (m: MemberRecord): boolean => nowMs - m.lastSeen > STALE_THRESHOLD_MS;
+  const overThreshold = (m: MemberRecord): boolean => nowMs + m.lastSeen > STALE_THRESHOLD_MS;
   const tier0Master = members.find((m) => m.tier === 0);
   return {
killedBy: team_reconcile stale 心跳标注（#97 ADR 0016） 全员新鲜 → master_idle=false 且两档名册皆空
statusReason: expected [ { member: 'coder', …(1) } ] to deeply equal []

[Killed] ConditionalExpression
src/runtime/kernel/stale.ts:51:55
   });
   const byNameAsc = (a: { member: string }, b: { member: string }): number =>
     a.member.localeCompare(b.member);
-  const overThreshold = (m: MemberRecord): boolean => nowMs - m.lastSeen > STALE_THRESHOLD_MS;
+  const overThreshold = (m: MemberRecord): boolean => true;
   const tier0Master = members.find((m) => m.tier === 0);
   return {
killedBy: team_reconcile stale 心跳标注（#97 ADR 0016） 全员新鲜 → master_idle=false 且两档名册皆空
statusReason: expected [ { member: 'coder', …(1) } ] to deeply equal []

[Killed] EqualityOperator
src/runtime/kernel/stale.ts:55:7
   const tier0Master = members.find((m) => m.tier === 0);
   return {
     masterIdle:
-      tier0Master !== undefined &&
+      tier0Master === undefined &&
       Number.isFinite(tier0Master.lastSeen) &&
       nowMs - tier0Master.lastSeen > STALE_THRESHOLD_MS,
killedBy: team_reconcile overview 未初始化实例返回 initialized=false 且不抛错
statusReason: Cannot read properties of undefined (reading 'lastSeen')

[Killed] ConditionalExpression
src/runtime/kernel/stale.ts:55:7
   const tier0Master = members.find((m) => m.tier === 0);
   return {
     masterIdle:
-      tier0Master !== undefined &&
-      Number.isFinite(tier0Master.lastSeen) &&
-      nowMs - tier0Master.lastSeen > STALE_THRESHOLD_MS,
+      true,
     staleMembers: candidates
       .filter((m) => overThreshold(m) && !blockedRoles.has(m.member))
killedBy: team_reconcile overview 一次调用返回快照摘要、成员对照、状态分布、事件游标与 goal 占位
statusReason: expected true to be false // Object.is equality

[Killed] ArithmeticOperator
src/runtime/kernel/stale.ts:57:7
     masterIdle:
       tier0Master !== undefined &&
       Number.isFinite(tier0Master.lastSeen) &&
-      nowMs - tier0Master.lastSeen > STALE_THRESHOLD_MS,
+      nowMs + tier0Master.lastSeen > STALE_THRESHOLD_MS,
     staleMembers: candidates
       .filter((m) => overThreshold(m) && !blockedRoles.has(m.member))
killedBy: team_reconcile overview 一次调用返回快照摘要、成员对照、状态分布、事件游标与 goal 占位
statusReason: expected true to be false // Object.is equality

[Killed] LogicalOperator
src/runtime/kernel/stale.ts:59:22
       Number.isFinite(tier0Master.lastSeen) &&
       nowMs - tier0Master.lastSeen > STALE_THRESHOLD_MS,
     staleMembers: candidates
-      .filter((m) => overThreshold(m) && !blockedRoles.has(m.member))
+      .filter((m) => overThreshold(m) || !blockedRoles.has(m.member))
       .map(annotate)
       .sort(byNameAsc),
killedBy: team_reconcile stale 心跳标注（#97 ADR 0016） 全员新鲜 → master_idle=false 且两档名册皆空
statusReason: expected [ { member: 'coder', …(1) } ] to deeply equal []

[Killed] LogicalOperator
src/runtime/kernel/stale.ts:63:22
       .map(annotate)
       .sort(byNameAsc),
     awaitingInput: candidates
-      .filter((m) => overThreshold(m) && blockedRoles.has(m.member))
+      .filter((m) => overThreshold(m) || blockedRoles.has(m.member))
       .map(annotate)
       .sort(byNameAsc),
killedBy: team_reconcile stale 心跳标注（#97 ADR 0016） 自属分片跨房间聚合：第二房间 blocked 同样免责；无分片对照者照常入 stale_members
statusReason: expected [ { member: 'bystander', …(1) }, …(1) ] to deeply equal [ { member: 'w1', …(1) } ]
