[Killed] StringLiteral
src/plugin/team-launch.ts:44:3
 /** 启动消息头（不含规程正文）；bootMessage 与页面脚本共用同一前缀。
  * 尾部附首 turn 检查单（#79 L2）：注意力聚焦三件事，规程正文不再依赖跳读。 */
 export const BOOT_MESSAGE_HEAD =
-  "团队已由人经入口创建，实例初始化完成。以下是你的 Tier-0 规程与场景编排" +
+  "" +
   "提示词全文（规程在前、场景段在后，以固定分隔符分界），请从启动对账节开始执行。" +
   "首 turn 检查单：① 第一个工具调用必须是 team_reconcile（readiness gate，失败即上行摘要）；② 确认 goal 已创建；③ 输出首轮摘要上行。";
killedBy: 客户端插件构建产物 client 与服务端 BOOT_MESSAGE_HEAD 文案一致（bundle 隔离，须手动同步）
statusReason: expected '团队已由人经入口创建，实例初始化完成。以下是你的 Tier-0 规程与场景…' to be '提示词全文（规程在前、场景段在后，以固定分隔符分界），请从启动对账节开始执…' // Object.is equality

[Survived] ConditionalExpression
src/plugin/team-launch.ts:61:27
       path: "/api/xiaozhuge/team/scenarios",
       handler: async (req, res) => {
         const url = new URL(req.url ?? "/", "http://localhost");
-        const workspace = url.searchParams.get("workspace") || undefined;
+        const workspace = false;
         // 三级来源根组装（project 层可选，需 workspace 参数）
         const roots: Array<{ source: "builtin" | "user" | "project"; dir: string }> = [

[Killed] ArrayDeclaration
src/plugin/team-launch.ts:63:87
         const url = new URL(req.url ?? "/", "http://localhost");
         const workspace = url.searchParams.get("workspace") || undefined;
         // 三级来源根组装（project 层可选，需 workspace 参数）
-        const roots: Array<{ source: "builtin" | "user" | "project"; dir: string }> = [
-          { source: "builtin", dir: join(PACKAGE_ROOT, "templates") },
-          { source: "user", dir: userTemplatesRoot() },
-        ];
+        const roots: Array<{ source: "builtin" | "user" | "project"; dir: string }> = [];
         if (workspace) {
           roots.push({ source: "project", dir: projectTemplatesRoot(workspace) });
killedBy: 场景枚举 列出全部 builtin 场景（oss-maintenance + research-report）带 source 标记
statusReason: expected [] to deeply equal [ …(2) ]

[Killed] BlockStatement
src/plugin/team-launch.ts:85:43
         }
         // 白名单防御（issue #103）：sessionId 进入文件系统寻址前校验，
         // 错误码对齐 overview 口径。
-        if (!isValidSessionId(sessionId)) {
-          writeJson(res, 400, { error: "invalid session parameter" });
-          return;
-        }
+        if (!isValidSessionId(sessionId)) {}
         // 视图供数解析：主会话直查优先；子会话按成员 durable id 反查所属
         // 实例（#97 问题 3），命中即以实例根身份应答并附归属信息。
killedBy: team/status 团队会话探测 session 白名单（issue #103）：路径逃逸/超长 → 400 invalid session parameter
statusReason: evil=../../etc: expected 200 to be 400 // Object.is equality

[Killed] StringLiteral
src/plugin/team-launch.ts:86:40
         // 白名单防御（issue #103）：sessionId 进入文件系统寻址前校验，
         // 错误码对齐 overview 口径。
         if (!isValidSessionId(sessionId)) {
-          writeJson(res, 400, { error: "invalid session parameter" });
+          writeJson(res, 400, { error: "" });
           return;
         }
killedBy: team/status 团队会话探测 session 白名单（issue #103）：路径逃逸/超长 → 400 invalid session parameter
statusReason: evil=../../etc: expected '' to be 'invalid session parameter' // Object.is equality

[Survived] StringLiteral
src/plugin/team-launch.ts:129:40
         }
         // 安全最小集：与 Gate Console 同款双头断言（复用同一实现）。
         if (!originAllowed(req)) {
-          writeJson(res, 403, { error: "forbidden: missing or cross-origin Origin header" });
+          writeJson(res, 403, { error: "" });
           return;
         }

[Killed] BlockStatement
src/plugin/team-launch.ts:132:37
           writeJson(res, 403, { error: "forbidden: missing or cross-origin Origin header" });
           return;
         }
-        if (!fetchSiteAllowed(req)) {
-          writeJson(res, 403, { error: "forbidden: cross-site Sec-Fetch-Site" });
-          return;
-        }
+        if (!fetchSiteAllowed(req)) {}
         try {
           const body = JSON.parse(await readBody(req)) as {
killedBy: team/create 一键建团 缺 session 参数 400；无 Origin POST 403；SFS 跨站 403
statusReason: expected 200 to be 403 // Object.is equality

[Killed] ConditionalExpression
src/plugin/team-launch.ts:144:15
             workspace?: string;
             instance_note?: string;
           };
-          if (typeof body.session !== "string" || body.session.length === 0) {
+          if (false || body.session.length === 0) {
             writeJson(res, 400, { error: "session required" });
             return;
killedBy: team/create 一键建团 缺 session 参数 400；无 Origin POST 403；SFS 跨站 403
statusReason: expected 409 to be 400 // Object.is equality

[Killed] ConditionalExpression
src/plugin/team-launch.ts:151:15
           // P0-2（#180）：create 端点 session 入路径前白名单早校验——此前仅查
           // 非空（`../../..` 可把实例根写出 sessions 目录建目录写文件），现对齐
           // status 端点 SESSION_PATTERN 口径。
-          if (!isValidSessionId(body.session)) {
+          if (false) {
             writeJson(res, 400, { error: "invalid session parameter" });
             return;
killedBy: team/create 一键建团 create 端点 session 白名单（P0-2，#180）：路径逃逸/超长 → 400 且无实例落盘
statusReason: evil=../../etc: expected 200 to be 400 // Object.is equality

[Killed] BlockStatement
src/plugin/team-launch.ts:158:45
           // Wave 1b（#123）：拒绝已登记成员自建 root 提权——该会话已是某
           // 实例的成员（agents.json 反查命中）时，不允许再当主控建团。
           const existing = resolveTeamHomeForView(body.session);
-          if (existing.membership !== null) {
-            writeJson(res, 409, {
-              error: {
-                code: "member-conflict",
-                message: `session is already a member (${existing.membership.member}) of ${existing.membership.root_session}; cannot create a new team`,
-              },
-            });
-            return;
-          }
+          if (existing.membership !== null) {}
           // handler 层负责 scenario 校验（unknown-scenario / ambiguous-scenario 稳定错误码）。
           const handlers = createHandlers(resolveTeamHome(body.session), body.session, rootCaller());
killedBy: team/create 一键建团 已登记成员自建 root 被拒（Wave 1b 提权防护，HTTP 409 member-conflict）
statusReason: expected 200 to be 409 // Object.is equality

[Killed] EqualityOperator
src/plugin/team-launch.ts:158:15
           // Wave 1b（#123）：拒绝已登记成员自建 root 提权——该会话已是某
           // 实例的成员（agents.json 反查命中）时，不允许再当主控建团。
           const existing = resolveTeamHomeForView(body.session);
-          if (existing.membership !== null) {
+          if (existing.membership === null) {
             writeJson(res, 409, {
               error: {
killedBy: team/create 一键建团 默认场景：init 持久化 + tier0_prompt 组装 + 快照落盘
statusReason: expected 409 to be 200 // Object.is equality

[Survived] StringLiteral
src/plugin/team-launch.ts:162:26
             writeJson(res, 409, {
               error: {
                 code: "member-conflict",
-                message: `session is already a member (${existing.membership.member}) of ${existing.membership.root_session}; cannot create a new team`,
+                message: ``,
               },
             });

[Killed] ConditionalExpression
src/plugin/team-launch.ts:178:59
           writeJson(res, 200, value);
         } catch (error) {
           const e = error as { code?: string; message?: string };
-          const status = e.code === "unknown-scenario" || e.code === "ambiguous-scenario" ? 400 : 409;
+          const status = e.code === "unknown-scenario" || false ? 400 : 409;
           writeJson(res, status, {
             error: { code: e.code ?? "internal-error", message: e.message ?? String(error) },
killedBy: team/create 一键建团 同名场景（user+project）未指定 source → ambiguous-scenario（HTTP 400）
statusReason: expected 409 to be 400 // Object.is equality
