[Killed] StringLiteral
src/plugin/tool-manifest.ts:21:4
 export const TEAM_TOOL_MANIFEST: ReadonlyArray<readonly [string, string]> = [
   ["team_spawn", "登记成员 durable id 入注册表"],
   ["team_dispatch", "注册 → 指派 → 派单复合原语（半事务，失败报告已完成步骤）"],
-  ["team_send", "定向信箱投递（含可达性 report-only 标注）"],
+  ["", "定向信箱投递（含可达性 report-only 标注）"],
   ["team_inbox", "读未读 / 认领指定信封"],
   ["team_ack", "确认信封处理完成"],
killedBy: tool manifest 保留段 清单与运行时实际注册的 team_* 工具名互锁（防漂移）
statusReason: expected [ '', 'team_ack', …(10) ] to deeply equal [ 'team_ack', 'team_dispatch', …(10) ]

[Survived] StringLiteral
src/plugin/tool-manifest.ts:21:17
 export const TEAM_TOOL_MANIFEST: ReadonlyArray<readonly [string, string]> = [
   ["team_spawn", "登记成员 durable id 入注册表"],
   ["team_dispatch", "注册 → 指派 → 派单复合原语（半事务，失败报告已完成步骤）"],
-  ["team_send", "定向信箱投递（含可达性 report-only 标注）"],
+  ["team_send", ""],
   ["team_inbox", "读未读 / 认领指定信封"],
   ["team_ack", "确认信封处理完成"],

[Killed] StringLiteral
src/plugin/tool-manifest.ts:29:4
   ["team_task_list", "任务账本查询"],
   ["team_state_get", "黑板读"],
   ["team_state_set", "黑板写（running|blocked|done）"],
-  ["team_reconcile", "对账全量视图（scope=audit 为旁路 report-only；overview 含互斥冲突标注）"],
+  ["", "对账全量视图（scope=audit 为旁路 report-only；overview 含互斥冲突标注）"],
   ["team_handoff", "显式交接（dod 回执核验）"],
 ];
killedBy: tool manifest 保留段 清单与运行时实际注册的 team_* 工具名互锁（防漂移）
statusReason: expected [ '', 'team_ack', …(10) ] to deeply equal [ 'team_ack', 'team_dispatch', …(10) ]

[Survived] StringLiteral
src/plugin/tool-manifest.ts:29:22
   ["team_task_list", "任务账本查询"],
   ["team_state_get", "黑板读"],
   ["team_state_set", "黑板写（running|blocked|done）"],
-  ["team_reconcile", "对账全量视图（scope=audit 为旁路 report-only；overview 含互斥冲突标注）"],
+  ["team_reconcile", ""],
   ["team_handoff", "显式交接（dod 回执核验）"],
 ];

[Survived] StringLiteral
src/plugin/tool-manifest.ts:30:20
   ["team_state_get", "黑板读"],
   ["team_state_set", "黑板写（running|blocked|done）"],
   ["team_reconcile", "对账全量视图（scope=audit 为旁路 report-only；overview 含互斥冲突标注）"],
-  ["team_handoff", "显式交接（dod 回执核验）"],
+  ["team_handoff", ""],
 ];
 
