[Killed] BlockStatement
src/plugin/host.ts:41:70
  * 读取或加载主会话的英文系统提示词（ADR 0023）。
  * 极速快路径：仅检查主会话专属目录，杜绝子代理穿透与全目录扫描 I/O 雪崩。
  */
-export function getOrLoadTeamSystemPrompt(sessionId: string): string {
-  const cached = systemPromptCache.get(sessionId);
-  if (cached !== undefined) return cached;
-
-  const rootDir = resolveTeamHome(sessionId);
-  const teamYamlPath = join(rootDir, "team.yaml");
-  if (!existsSync(teamYamlPath)) {
-    return "";
-  }
-
-  try {
-    const raw = readFileSync(teamYamlPath, "utf8");
-    const snap = JSON.parse(raw) as { system_prompt?: string | null; tier0_prompt?: string | null };
-    const prompt = snap.system_prompt ?? snap.tier0_prompt ?? "";
-    if (prompt.length > 0) {
-      systemPromptCache.set(sessionId, prompt);
-    }
-    return prompt;
-  } catch {
-    return "";
-  }
-}
+export function getOrLoadTeamSystemPrompt(sessionId: string): string {}
 
 /** 显式预热或写入系统提示词内存缓存（init 时调用）。 */
killedBy: 插件装配 宿主 systemPrompt 在场时注册 xiaozhuge-team-orchestrator 段（ADR 0023）
statusReason: expected undefined to be '' // Object.is equality

[Killed] EqualityOperator
src/plugin/host.ts:43:7
  */
 export function getOrLoadTeamSystemPrompt(sessionId: string): string {
   const cached = systemPromptCache.get(sessionId);
-  if (cached !== undefined) return cached;
+  if (cached === undefined) return cached;
 
   const rootDir = resolveTeamHome(sessionId);
killedBy: 插件装配 宿主 systemPrompt 在场时注册 xiaozhuge-team-orchestrator 段（ADR 0023）
statusReason: expected undefined to be '' // Object.is equality

[Killed] ConditionalExpression
src/plugin/host.ts:43:7
  */
 export function getOrLoadTeamSystemPrompt(sessionId: string): string {
   const cached = systemPromptCache.get(sessionId);
-  if (cached !== undefined) return cached;
+  if (true) return cached;
 
   const rootDir = resolveTeamHome(sessionId);
killedBy: 插件装配 宿主 systemPrompt 在场时注册 xiaozhuge-team-orchestrator 段（ADR 0023）
statusReason: expected undefined to be '' // Object.is equality

[Killed] ConditionalExpression
src/plugin/host.ts:47:7
 
   const rootDir = resolveTeamHome(sessionId);
   const teamYamlPath = join(rootDir, "team.yaml");
-  if (!existsSync(teamYamlPath)) {
+  if (true) {
     return "";
   }
killedBy: 插件装配 宿主 systemPrompt 在场时注册 xiaozhuge-team-orchestrator 段（ADR 0023）
statusReason: expected '' to contain 'Resource Protection Triad'

[Killed] BooleanLiteral
src/plugin/host.ts:47:7
 
   const rootDir = resolveTeamHome(sessionId);
   const teamYamlPath = join(rootDir, "team.yaml");
-  if (!existsSync(teamYamlPath)) {
+  if (existsSync(teamYamlPath)) {
     return "";
   }
killedBy: 插件装配 宿主 systemPrompt 在场时注册 xiaozhuge-team-orchestrator 段（ADR 0023）
statusReason: expected '' to contain 'Resource Protection Triad'

[Killed] StringLiteral
src/plugin/host.ts:48:12
   const rootDir = resolveTeamHome(sessionId);
   const teamYamlPath = join(rootDir, "team.yaml");
   if (!existsSync(teamYamlPath)) {
-    return "";
+    return "Stryker was here!";
   }
 
killedBy: 插件装配 宿主 systemPrompt 在场时注册 xiaozhuge-team-orchestrator 段（ADR 0023）
statusReason: expected 'Stryker was here!' to be '' // Object.is equality

[Killed] BlockStatement
src/plugin/host.ts:51:7
     return "";
   }
 
-  try {
-    const raw = readFileSync(teamYamlPath, "utf8");
-    const snap = JSON.parse(raw) as { system_prompt?: string | null; tier0_prompt?: string | null };
-    const prompt = snap.system_prompt ?? snap.tier0_prompt ?? "";
-    if (prompt.length > 0) {
-      systemPromptCache.set(sessionId, prompt);
-    }
-    return prompt;
-  } catch {
+  try {} catch {
     return "";
   }
killedBy: 插件装配 宿主 systemPrompt 在场时注册 xiaozhuge-team-orchestrator 段（ADR 0023）
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Survived] StringLiteral
src/plugin/host.ts:52:44
   }
 
   try {
-    const raw = readFileSync(teamYamlPath, "utf8");
+    const raw = readFileSync(teamYamlPath, "");
     const snap = JSON.parse(raw) as { system_prompt?: string | null; tier0_prompt?: string | null };
     const prompt = snap.system_prompt ?? snap.tier0_prompt ?? "";

[Killed] LogicalOperator
src/plugin/host.ts:54:20
   try {
     const raw = readFileSync(teamYamlPath, "utf8");
     const snap = JSON.parse(raw) as { system_prompt?: string | null; tier0_prompt?: string | null };
-    const prompt = snap.system_prompt ?? snap.tier0_prompt ?? "";
+    const prompt = (snap.system_prompt ?? snap.tier0_prompt) && "";
     if (prompt.length > 0) {
       systemPromptCache.set(sessionId, prompt);
killedBy: 插件装配 宿主 systemPrompt 在场时注册 xiaozhuge-team-orchestrator 段（ADR 0023）
statusReason: expected '' to contain 'Resource Protection Triad'

[Killed] LogicalOperator
src/plugin/host.ts:54:20
   try {
     const raw = readFileSync(teamYamlPath, "utf8");
     const snap = JSON.parse(raw) as { system_prompt?: string | null; tier0_prompt?: string | null };
-    const prompt = snap.system_prompt ?? snap.tier0_prompt ?? "";
+    const prompt = snap.system_prompt && snap.tier0_prompt ?? "";
     if (prompt.length > 0) {
       systemPromptCache.set(sessionId, prompt);
killedBy: 插件装配 宿主 systemPrompt 在场时注册 xiaozhuge-team-orchestrator 段（ADR 0023）
statusReason: expected '' to contain 'Resource Protection Triad'

[Survived] ConditionalExpression
src/plugin/host.ts:55:9
     const raw = readFileSync(teamYamlPath, "utf8");
     const snap = JSON.parse(raw) as { system_prompt?: string | null; tier0_prompt?: string | null };
     const prompt = snap.system_prompt ?? snap.tier0_prompt ?? "";
-    if (prompt.length > 0) {
+    if (false) {
       systemPromptCache.set(sessionId, prompt);
     }

[Survived] EqualityOperator
src/plugin/host.ts:55:9
     const raw = readFileSync(teamYamlPath, "utf8");
     const snap = JSON.parse(raw) as { system_prompt?: string | null; tier0_prompt?: string | null };
     const prompt = snap.system_prompt ?? snap.tier0_prompt ?? "";
-    if (prompt.length > 0) {
+    if (prompt.length <= 0) {
       systemPromptCache.set(sessionId, prompt);
     }

[Survived] CallExpression
src/plugin/host.ts:56:7
     const snap = JSON.parse(raw) as { system_prompt?: string | null; tier0_prompt?: string | null };
     const prompt = snap.system_prompt ?? snap.tier0_prompt ?? "";
     if (prompt.length > 0) {
-      systemPromptCache.set(sessionId, prompt);
+      ;
     }
     return prompt;

[NoCoverage] BlockStatement
src/plugin/host.ts:59:11
       systemPromptCache.set(sessionId, prompt);
     }
     return prompt;
-  } catch {
-    return "";
-  }
+  } catch {}
 }
 

[NoCoverage] BlockStatement
src/plugin/host.ts:65:77
 }
 
 /** 显式预热或写入系统提示词内存缓存（init 时调用）。 */
-export function setTeamPromptCache(sessionId: string, prompt: string): void {
-  systemPromptCache.set(sessionId, prompt);
-}
+export function setTeamPromptCache(sessionId: string, prompt: string): void {}
 
 /** 清空内存提示词缓存（卸载或测试重置）。 */

[NoCoverage] CallExpression
src/plugin/host.ts:66:3
 
 /** 显式预热或写入系统提示词内存缓存（init 时调用）。 */
 export function setTeamPromptCache(sessionId: string, prompt: string): void {
-  systemPromptCache.set(sessionId, prompt);
+  ;
 }
 

[Survived] BlockStatement
src/plugin/host.ts:70:64
 }
 
 /** 清空内存提示词缓存（卸载或测试重置）。 */
-export function clearTeamPromptCache(sessionId?: string): void {
-  if (sessionId) systemPromptCache.delete(sessionId);
-  else systemPromptCache.clear();
-}
+export function clearTeamPromptCache(sessionId?: string): void {}
 
 /**

[NoCoverage] CallExpression
src/plugin/host.ts:71:18
 
 /** 清空内存提示词缓存（卸载或测试重置）。 */
 export function clearTeamPromptCache(sessionId?: string): void {
-  if (sessionId) systemPromptCache.delete(sessionId);
+  if (sessionId) ;
   else systemPromptCache.clear();
 }

[Survived] ConditionalExpression
src/plugin/host.ts:71:7
 
 /** 清空内存提示词缓存（卸载或测试重置）。 */
 export function clearTeamPromptCache(sessionId?: string): void {
-  if (sessionId) systemPromptCache.delete(sessionId);
+  if (false) systemPromptCache.delete(sessionId);
   else systemPromptCache.clear();
 }

[Survived] CallExpression
src/plugin/host.ts:72:8
 /** 清空内存提示词缓存（卸载或测试重置）。 */
 export function clearTeamPromptCache(sessionId?: string): void {
   if (sessionId) systemPromptCache.delete(sessionId);
-  else systemPromptCache.clear();
+  else ;
 }
 

[Killed] BlockStatement
src/plugin/host.ts:81:56
  * 内部稳定 code（agent-required）供框架路由与测试断言，不静默挂空实例
  * （复核必改 3；官方先例为裸 Error，code 是内部增强，端到端呈现以 message 为准）。
  */
-function sessionIdOf(agent: Agent | undefined): string {
-  if (agent?.id === undefined) {
-    throw new ToolError("agent-required", "team_* tools require an agent context (exec.agent.id)");
-  }
-  return agent.id;
-}
+function sessionIdOf(agent: Agent | undefined): string {}
 
 /**
killedBy: Wave 1a 工具面反查挂载（子代理 → 主控实例） host.execute 子代理侧反查接主控实例（L51 接线验证）
statusReason: The "path" argument must be of type string. Received undefined

[Killed] ConditionalExpression
src/plugin/host.ts:82:7
  * （复核必改 3；官方先例为裸 Error，code 是内部增强，端到端呈现以 message 为准）。
  */
 function sessionIdOf(agent: Agent | undefined): string {
-  if (agent?.id === undefined) {
+  if (true) {
     throw new ToolError("agent-required", "team_* tools require an agent context (exec.agent.id)");
   }
killedBy: Wave 1a 工具面反查挂载（子代理 → 主控实例） host.execute 子代理侧反查接主控实例（L51 接线验证）
statusReason: team_* tools require an agent context (exec.agent.id)

[Killed] EqualityOperator
src/plugin/host.ts:82:7
  * （复核必改 3；官方先例为裸 Error，code 是内部增强，端到端呈现以 message 为准）。
  */
 function sessionIdOf(agent: Agent | undefined): string {
-  if (agent?.id === undefined) {
+  if (agent?.id !== undefined) {
     throw new ToolError("agent-required", "team_* tools require an agent context (exec.agent.id)");
   }
killedBy: Wave 1a 工具面反查挂载（子代理 → 主控实例） host.execute 子代理侧反查接主控实例（L51 接线验证）
statusReason: team_* tools require an agent context (exec.agent.id)

[Killed] StringLiteral
src/plugin/host.ts:83:25
  */
 function sessionIdOf(agent: Agent | undefined): string {
   if (agent?.id === undefined) {
-    throw new ToolError("agent-required", "team_* tools require an agent context (exec.agent.id)");
+    throw new ToolError("", "team_* tools require an agent context (exec.agent.id)");
   }
   return agent.id;
killedBy: Wave 1a 工具面反查挂载（子代理 → 主控实例） agentless 调用抛稳定错误码 agent-required（复核必改 3）
statusReason: expected ToolError: team_* tools require an agent … { code: '' } to match object { code: 'agent-required' }
(1 matching property omitted from actual)

[Killed] ArrayDeclaration
src/plugin/host.ts:109:40
   on?: (event: "webserver/index-inject", listener: (table: unknown[]) => void) => void;
 }): () => void {
   void ctx.get;
-  const disposers: Array<() => void> = [];
+  const disposers: Array<() => void> = ["Stryker was here"];
 
   /**
killedBy: 插件装配 宿主 systemPrompt 在场时注册 xiaozhuge-team-orchestrator 段（ADR 0023）
statusReason: dispose is not a function

[Killed] BlockStatement
src/plugin/host.ts:125:24
   function makeLivenessProbe(
     rootSessionId: string,
   ): () => Promise<Map<string, "running" | "inactive">> {
-    return async () => {
-      const subagents = ctx.get("subagents") as
-        | {
-            listDescendants(
-              rootSessionId: string,
-              signal?: AbortSignal,
-            ): Promise<Array<{ kind: string; id: string; activity?: string }>>;
-          }
-        | undefined;
-      if (subagents === undefined || typeof subagents.listDescendants !== "function") {
-        // 服务未挂载：探测失败语义（handlers 层退化 framework-invisible 旧口径，
-        // liveness_source=unavailable），不与「服务在场但枚举为空」混淆。
-        throw new Error("subagent discovery service not mounted");
-      }
-      const live = new Map<string, "running" | "inactive">();
-      const entries = await subagents.listDescendants(rootSessionId);
-      for (const e of entries) {
-        if (e.kind !== "child") continue;
-        if (e.activity === "running" || e.activity === "inactive") {
-          live.set(e.id, e.activity);
-        }
-      }
-      return live;
-    };
+    return async () => {};
   }
 
killedBy: execute 路由与输出包装 #192 存活探测：宿主 subagents 发现服务在场时 reconcile liveness 列为官方观测值
statusReason: Cannot read properties of undefined (reading 'get')

[Killed] EqualityOperator
src/plugin/host.ts:134:38
             ): Promise<Array<{ kind: string; id: string; activity?: string }>>;
           }
         | undefined;
-      if (subagents === undefined || typeof subagents.listDescendants !== "function") {
+      if (subagents === undefined || typeof subagents.listDescendants === "function") {
         // 服务未挂载：探测失败语义（handlers 层退化 framework-invisible 旧口径，
         // liveness_source=unavailable），不与「服务在场但枚举为空」混淆。
killedBy: execute 路由与输出包装 #192 存活探测：宿主 subagents 发现服务在场时 reconcile liveness 列为官方观测值
statusReason: expected 'unavailable' to be 'subagent-discovery' // Object.is equality

[Killed] EqualityOperator
src/plugin/host.ts:134:11
             ): Promise<Array<{ kind: string; id: string; activity?: string }>>;
           }
         | undefined;
-      if (subagents === undefined || typeof subagents.listDescendants !== "function") {
+      if (subagents !== undefined || typeof subagents.listDescendants !== "function") {
         // 服务未挂载：探测失败语义（handlers 层退化 framework-invisible 旧口径，
         // liveness_source=unavailable），不与「服务在场但枚举为空」混淆。
killedBy: execute 路由与输出包装 #192 存活探测：宿主 subagents 发现服务在场时 reconcile liveness 列为官方观测值
statusReason: expected 'unavailable' to be 'subagent-discovery' // Object.is equality

[Killed] BlockStatement
src/plugin/host.ts:141:32
       }
       const live = new Map<string, "running" | "inactive">();
       const entries = await subagents.listDescendants(rootSessionId);
-      for (const e of entries) {
-        if (e.kind !== "child") continue;
-        if (e.activity === "running" || e.activity === "inactive") {
-          live.set(e.id, e.activity);
-        }
-      }
+      for (const e of entries) {}
       return live;
     };
killedBy: execute 路由与输出包装 #192 存活探测：宿主 subagents 发现服务在场时 reconcile liveness 列为官方观测值
statusReason: expected 'missing' to be 'running' // Object.is equality

[Killed] EqualityOperator
src/plugin/host.ts:142:13
       const live = new Map<string, "running" | "inactive">();
       const entries = await subagents.listDescendants(rootSessionId);
       for (const e of entries) {
-        if (e.kind !== "child") continue;
+        if (e.kind === "child") continue;
         if (e.activity === "running" || e.activity === "inactive") {
           live.set(e.id, e.activity);
killedBy: execute 路由与输出包装 #192 存活探测：宿主 subagents 发现服务在场时 reconcile liveness 列为官方观测值
statusReason: expected 'missing' to be 'running' // Object.is equality

[Killed] ConditionalExpression
src/plugin/host.ts:142:13
       const live = new Map<string, "running" | "inactive">();
       const entries = await subagents.listDescendants(rootSessionId);
       for (const e of entries) {
-        if (e.kind !== "child") continue;
+        if (true) continue;
         if (e.activity === "running" || e.activity === "inactive") {
           live.set(e.id, e.activity);
killedBy: execute 路由与输出包装 #192 存活探测：宿主 subagents 发现服务在场时 reconcile liveness 列为官方观测值
statusReason: expected 'missing' to be 'running' // Object.is equality

[Killed] EqualityOperator
src/plugin/host.ts:143:41
       const entries = await subagents.listDescendants(rootSessionId);
       for (const e of entries) {
         if (e.kind !== "child") continue;
-        if (e.activity === "running" || e.activity === "inactive") {
+        if (e.activity === "running" || e.activity !== "inactive") {
           live.set(e.id, e.activity);
         }
killedBy: execute 路由与输出包装 #192 存活探测：宿主 subagents 发现服务在场时 reconcile liveness 列为官方观测值
statusReason: expected 'missing' to be 'inactive' // Object.is equality

[Killed] LogicalOperator
src/plugin/host.ts:143:13
       const entries = await subagents.listDescendants(rootSessionId);
       for (const e of entries) {
         if (e.kind !== "child") continue;
-        if (e.activity === "running" || e.activity === "inactive") {
+        if (e.activity === "running" && e.activity === "inactive") {
           live.set(e.id, e.activity);
         }
killedBy: execute 路由与输出包装 #192 存活探测：宿主 subagents 发现服务在场时 reconcile liveness 列为官方观测值
statusReason: expected 'missing' to be 'running' // Object.is equality

[Killed] CallExpression
src/plugin/host.ts:144:11
       for (const e of entries) {
         if (e.kind !== "child") continue;
         if (e.activity === "running" || e.activity === "inactive") {
-          live.set(e.id, e.activity);
+          ;
         }
       }
killedBy: execute 路由与输出包装 #192 存活探测：宿主 subagents 发现服务在场时 reconcile liveness 列为官方观测值
statusReason: expected 'missing' to be 'running' // Object.is equality

[Killed] ConditionalExpression
src/plugin/host.ts:160:9
   function handlersFor(agent: Agent | undefined): Handlers {
     const sessionId = sessionIdOf(agent);
     let h = handlerCache.get(sessionId);
-    if (h === undefined) {
+    if (false) {
       // Wave 1a：与 HTTP 视图路由同款反查挂载主控实例根（#120 v2 计划 1a）。
       // 主会话直查；子代理（成员 durable id）反查所属主控的 TEAM_HOME，
killedBy: execute 路由与输出包装 team_spawn 经 execute 走到 handler 并包装 ok 输出
statusReason: Cannot read properties of undefined (reading 'spawn')

[Killed] ConditionalExpression
src/plugin/host.ts:169:9
       // membership 非空 = 子代理（成员名随反查获得）；主会话自身根有
       // team.yaml = 主控；其余（未登记/未初始化）= 无身份（写操作被拒）。
       const caller: Caller =
-        resolution.membership !== null
+        false
           ? { kind: "member", member: resolution.membership.member }
           : existsSync(join(resolveTeamHome(sessionId), "team.yaml"))
killedBy: Wave 1a 工具面反查挂载（子代理 → 主控实例） host.execute 子代理侧反查接主控实例（L51 接线验证）
statusReason: unauthenticated session is not allowed to team_inbox

[Killed] ConditionalExpression
src/plugin/host.ts:169:9
       // membership 非空 = 子代理（成员名随反查获得）；主会话自身根有
       // team.yaml = 主控；其余（未登记/未初始化）= 无身份（写操作被拒）。
       const caller: Caller =
-        resolution.membership !== null
+        true
           ? { kind: "member", member: resolution.membership.member }
           : existsSync(join(resolveTeamHome(sessionId), "team.yaml"))
killedBy: Wave 1a 工具面反查挂载（子代理 → 主控实例） host.execute 子代理侧反查接主控实例（L51 接线验证）
statusReason: Cannot read properties of null (reading 'member')

[Killed] ObjectLiteral
src/plugin/host.ts:170:13
       // team.yaml = 主控；其余（未登记/未初始化）= 无身份（写操作被拒）。
       const caller: Caller =
         resolution.membership !== null
-          ? { kind: "member", member: resolution.membership.member }
+          ? {}
           : existsSync(join(resolveTeamHome(sessionId), "team.yaml"))
             ? { kind: "root" }
killedBy: Wave 1a 工具面反查挂载（子代理 → 主控实例） host.execute 子代理侧反查接主控实例（L51 接线验证）
statusReason: unauthenticated session is not allowed to team_inbox

[Killed] ObjectLiteral
src/plugin/host.ts:172:15
         resolution.membership !== null
           ? { kind: "member", member: resolution.membership.member }
           : existsSync(join(resolveTeamHome(sessionId), "team.yaml"))
-            ? { kind: "root" }
+            ? {}
             : undefined;
       // #192：探测树根 = 实例根会话 id。membership 命中即子代理 → 用反查
killedBy: Wave 1a 工具面反查挂载（子代理 → 主控实例） host.execute 子代理侧反查接主控实例（L51 接线验证）
statusReason: unauthenticated session is not allowed to team_task_create

[Killed] ConditionalExpression
src/plugin/host.ts:177:9
       // #192：探测树根 = 实例根会话 id。membership 命中即子代理 → 用反查
       // 所得的 root_session；主控自身 → 用调用会话 id（主会话直查场景）。
       const probeRoot =
-        resolution.membership !== null ? resolution.membership.root_session : sessionId;
+        true ? resolution.membership.root_session : sessionId;
       h = createHandlers(
         resolution.teamHome,
killedBy: execute 路由与输出包装 team_spawn 经 execute 走到 handler 并包装 ok 输出
statusReason: Cannot read properties of null (reading 'root_session')

[Killed] EqualityOperator
src/plugin/host.ts:177:9
       // #192：探测树根 = 实例根会话 id。membership 命中即子代理 → 用反查
       // 所得的 root_session；主控自身 → 用调用会话 id（主会话直查场景）。
       const probeRoot =
-        resolution.membership !== null ? resolution.membership.root_session : sessionId;
+        resolution.membership === null ? resolution.membership.root_session : sessionId;
       h = createHandlers(
         resolution.teamHome,
killedBy: execute 路由与输出包装 team_spawn 经 execute 走到 handler 并包装 ok 输出
statusReason: Cannot read properties of null (reading 'root_session')

[Killed] EqualityOperator
src/plugin/host.ts:195:9
       // 被永久缓存（独立审核发现的中危边界）。
       const selfRoot = resolveTeamHome(sessionId);
       const hit =
-        resolution.membership !== null || existsSync(join(selfRoot, "team.yaml"));
+        resolution.membership === null || existsSync(join(selfRoot, "team.yaml"));
       if (hit) handlerCache.set(sessionId, h);
     }
killedBy: Wave 1a 工具面反查挂载（子代理 → 主控实例） 子代理未登记首调不缓存空解析，主控登记后自愈命中（独立审核发现）
statusReason: unauthenticated session is not allowed to team_inbox

[Killed] ConditionalExpression
src/plugin/host.ts:195:9
       // 被永久缓存（独立审核发现的中危边界）。
       const selfRoot = resolveTeamHome(sessionId);
       const hit =
-        resolution.membership !== null || existsSync(join(selfRoot, "team.yaml"));
+        true;
       if (hit) handlerCache.set(sessionId, h);
     }
killedBy: Wave 1a 工具面反查挂载（子代理 → 主控实例） 子代理未登记首调不缓存空解析，主控登记后自愈命中（独立审核发现）
statusReason: unauthenticated session is not allowed to team_inbox

[Killed] ConditionalExpression
src/plugin/host.ts:196:11
       const selfRoot = resolveTeamHome(sessionId);
       const hit =
         resolution.membership !== null || existsSync(join(selfRoot, "team.yaml"));
-      if (hit) handlerCache.set(sessionId, h);
+      if (true) handlerCache.set(sessionId, h);
     }
     return h;
killedBy: Wave 1a 工具面反查挂载（子代理 → 主控实例） 子代理未登记首调不缓存空解析，主控登记后自愈命中（独立审核发现）
statusReason: unauthenticated session is not allowed to team_inbox

[Survived] CallExpression
src/plugin/host.ts:196:16
       const selfRoot = resolveTeamHome(sessionId);
       const hit =
         resolution.membership !== null || existsSync(join(selfRoot, "team.yaml"));
-      if (hit) handlerCache.set(sessionId, h);
+      if (hit) ;
     }
     return h;

[Survived] StringLiteral
src/plugin/host.ts:214:17
       parameters: schema.parameters,
       output: {
         schema: {
-          type: "object",
+          type: "",
           properties: {
             ok: { type: "boolean", description: "Whether the call succeeded." },

[Survived] ObjectLiteral
src/plugin/host.ts:216:17
         schema: {
           type: "object",
           properties: {
-            ok: { type: "boolean", description: "Whether the call succeeded." },
+            ok: {},
             error: {
               type: "object",

[Survived] StringLiteral
src/plugin/host.ts:216:25
         schema: {
           type: "object",
           properties: {
-            ok: { type: "boolean", description: "Whether the call succeeded." },
+            ok: { type: "", description: "Whether the call succeeded." },
             error: {
               type: "object",

[Survived] ObjectLiteral
src/plugin/host.ts:219:27
             ok: { type: "boolean", description: "Whether the call succeeded." },
             error: {
               type: "object",
-              properties: {
-                code: { type: "string" },
-                message: { type: "string" },
-              },
+              properties: {},
               required: ["code", "message"],
               additionalProperties: false,

[Survived] ObjectLiteral
src/plugin/host.ts:220:23
             error: {
               type: "object",
               properties: {
-                code: { type: "string" },
+                code: {},
                 message: { type: "string" },
               },

[Survived] StringLiteral
src/plugin/host.ts:223:26
                 code: { type: "string" },
                 message: { type: "string" },
               },
-              required: ["code", "message"],
+              required: ["", "message"],
               additionalProperties: false,
               description: "Present on failure only.",

[Survived] StringLiteral
src/plugin/host.ts:228:22
               description: "Present on failure only.",
             },
           },
-          required: ["ok"],
+          required: [""],
           additionalProperties: true,
         },

[Killed] ObjectLiteral
src/plugin/host.ts:237:57
       },
       async execute(rawArgs: unknown, exec: ToolRunContext) {
         const args = (rawArgs ?? {}) as Record<string, unknown>;
-        const HANDLER_BY_TOOL: Record<string, string> = {
-          team_spawn: "spawn",
-          team_dispatch: "dispatch",
-          team_send: "send",
-          team_inbox: "inbox",
-          team_ack: "ack",
-          team_task_create: "taskCreate",
-          team_task_update: "taskUpdate",
-          team_task_list: "taskList",
-          team_state_get: "stateGet",
-          team_state_set: "stateSet",
-          team_reconcile: "reconcile",
-          team_handoff: "handoff",
-        };
+        const HANDLER_BY_TOOL: Record<string, string> = {};
         const handlerKey = HANDLER_BY_TOOL[toolName] ?? toolName.replace(/^team_/, "");
         const handlerMap = handlersFor(exec?.agent);
killedBy: Wave 1a 工具面反查挂载（子代理 → 主控实例） host.execute 子代理侧反查接主控实例（L51 接线验证）
statusReason: no handler for team_task_create (task_create)

[NoCoverage] Regex
src/plugin/host.ts:251:74
           team_reconcile: "reconcile",
           team_handoff: "handoff",
         };
-        const handlerKey = HANDLER_BY_TOOL[toolName] ?? toolName.replace(/^team_/, "");
+        const handlerKey = HANDLER_BY_TOOL[toolName] ?? toolName.replace(/team_/, "");
         const handlerMap = handlersFor(exec?.agent);
         const handler = (handlerMap as unknown as Record<

[NoCoverage] StringLiteral
src/plugin/host.ts:258:27
           (a: Record<string, unknown>) => Promise<unknown>
         >)[handlerKey];
         if (handler === undefined) {
-          throw new Error(`no handler for ${toolName} (${handlerKey})`);
+          throw new Error(``);
         }
         const value = await handler(args);

[Killed] ObjectLiteral
src/plugin/host.ts:261:16
           throw new Error(`no handler for ${toolName} (${handlerKey})`);
         }
         const value = await handler(args);
-        return { ok: true, ...(value as object) };
+        return {};
       },
     };
killedBy: Wave 1a 工具面反查挂载（子代理 → 主控实例） host.execute 子代理侧反查接主控实例（L51 接线验证）
statusReason: string field "task_id" is required

[Killed] StringLiteral
src/plugin/host.ts:269:5
   }
 
   define(
-    "team_spawn",
+    "",
     "Register a spawned subagent into the team registry with its durable subagent id.",
     schemas.spawn,
killedBy: Wave 1b 写面收敛矩阵（#123） host.execute 端到端：子代理写操作 forbidden、未登记会话写操作 forbidden、子代理合法流可达
statusReason: Cannot read properties of undefined (reading 'execute')

[Killed] StringLiteral
src/plugin/host.ts:293:5
     (args, agent) => handlersFor(agent).inbox(args),
   );
   define(
-    "team_ack",
+    "",
     "Acknowledge an envelope after processing it (moves it to processed).",
     schemas.ack,
killedBy: 插件装配 注册 12 个 team_* 工具且命名规范（team_init 已下线 #51；dispatch/reconcile 为 ADR 0015 原语）
statusReason: expected [ '', 'team_dispatch', …(10) ] to deeply equal [ 'team_ack', 'team_dispatch', …(10) ]

[Killed] StringLiteral
src/plugin/host.ts:299:5
     (args, agent) => handlersFor(agent).ack(args),
   );
   define(
-    "team_task_create",
+    "",
     "Create a task in the shared ledger; mutex conflicts with running tasks are rejected.",
     schemas.taskCreate,
killedBy: 插件装配 注册 12 个 team_* 工具且命名规范（team_init 已下线 #51；dispatch/reconcile 为 ADR 0015 原语）
statusReason: expected [ '', 'team_ack', …(10) ] to deeply equal [ 'team_ack', 'team_dispatch', …(10) ]

[Killed] StringLiteral
src/plugin/host.ts:305:5
     (args, agent) => handlersFor(agent).taskCreate(args),
   );
   define(
-    "team_task_update",
+    "",
     "Update a task through the legal status machine; illegal transitions are rejected.",
     schemas.taskUpdate,
killedBy: Wave 1a 工具面反查挂载（子代理 → 主控实例） host.execute 子代理侧反查接主控实例（L51 接线验证）
statusReason: Cannot read properties of undefined (reading 'execute')

[Survived] StringLiteral
src/plugin/host.ts:312:5
   );
   define(
     "team_task_list",
-    "List tasks in the shared ledger, optionally filtered by room/status.",
+    "",
     schemas.taskList,
     (args, agent) => handlersFor(agent).taskList(args),

[Killed] StringLiteral
src/plugin/host.ts:323:5
     (args, agent) => handlersFor(agent).stateGet(args),
   );
   define(
-    "team_state_set",
+    "",
     "Write your blackboard shard; status must be running|blocked|done.",
     schemas.stateSet,
killedBy: 插件装配 注册 12 个 team_* 工具且命名规范（team_init 已下线 #51；dispatch/reconcile 为 ADR 0015 原语）
statusReason: expected [ '', 'team_ack', …(10) ] to deeply equal [ 'team_ack', 'team_dispatch', …(10) ]

[Survived] StringLiteral
src/plugin/host.ts:324:5
   );
   define(
     "team_state_set",
-    "Write your blackboard shard; status must be running|blocked|done.",
+    "",
     schemas.stateSet,
     (args, agent) => handlersFor(agent).stateSet(args),

[Survived] StringLiteral
src/plugin/host.ts:336:5
   );
   define(
     "team_handoff",
-    "Hand a task to another role; tasks with dod require a per-item receipt array.",
+    "",
     schemas.handoff,
     (args, agent) => handlersFor(agent).handoff(args),
