[Killed] BlockStatement
src/plugin/session-id.ts:17:62
 
 export const SESSION_PATTERN = RUNTIME_SESSION_PATTERN;
 
-export function isValidSessionId(sessionId: string): boolean {
-  return validateSessionId(sessionId);
-}
+export function isValidSessionId(sessionId: string): boolean {}
killedBy: gate resolve 端点 无 Origin 的 POST 被拒（agent bash/curl 场景）并留审计外无副作用
statusReason: Cannot read properties of undefined (reading '0')
