[Killed] BlockStatement
src/plugin/session-index.ts:46:64
  * feature-detect node:sqlite（Node 22.5+ 引入，22.13/23.4+ 默认可用，24 稳定）。
  * 用 createRequire 同步探测（不 import 顶层，避免不支持环境模块加载失败）。
  */
-function detectDatabaseSync(): typeof DatabaseSync | undefined {
-  if (sqliteAvailable === null) {
-    try {
-      const mod = createRequire(import.meta.url)("node:sqlite") as { DatabaseSync: typeof DatabaseSync };
-      DatabaseSyncCtor = mod.DatabaseSync;
-      sqliteAvailable = typeof mod.DatabaseSync === "function";
-    } catch {
-      sqliteAvailable = false;
-    }
-  }
-  return DatabaseSyncCtor;
-}
+function detectDatabaseSync(): typeof DatabaseSync | undefined {}
 
 /** per-DSH_HOME 惰性单例表。 */
killedBy: SessionIndex 基本读写 set/get/remove/close 全链路
statusReason: expected null not to be null

[Killed] ConditionalExpression
src/plugin/session-index.ts:47:7
  * 用 createRequire 同步探测（不 import 顶层，避免不支持环境模块加载失败）。
  */
 function detectDatabaseSync(): typeof DatabaseSync | undefined {
-  if (sqliteAvailable === null) {
+  if (false) {
     try {
       const mod = createRequire(import.meta.url)("node:sqlite") as { DatabaseSync: typeof DatabaseSync };
killedBy: SessionIndex 基本读写 set/get/remove/close 全链路
statusReason: expected null not to be null

[Killed] BlockStatement
src/plugin/session-index.ts:47:33
  * 用 createRequire 同步探测（不 import 顶层，避免不支持环境模块加载失败）。
  */
 function detectDatabaseSync(): typeof DatabaseSync | undefined {
-  if (sqliteAvailable === null) {
-    try {
-      const mod = createRequire(import.meta.url)("node:sqlite") as { DatabaseSync: typeof DatabaseSync };
-      DatabaseSyncCtor = mod.DatabaseSync;
-      sqliteAvailable = typeof mod.DatabaseSync === "function";
-    } catch {
-      sqliteAvailable = false;
-    }
-  }
+  if (sqliteAvailable === null) {}
   return DatabaseSyncCtor;
 }
killedBy: SessionIndex 基本读写 set/get/remove/close 全链路
statusReason: expected null not to be null

[Killed] BlockStatement
src/plugin/session-index.ts:48:9
  */
 function detectDatabaseSync(): typeof DatabaseSync | undefined {
   if (sqliteAvailable === null) {
-    try {
-      const mod = createRequire(import.meta.url)("node:sqlite") as { DatabaseSync: typeof DatabaseSync };
-      DatabaseSyncCtor = mod.DatabaseSync;
-      sqliteAvailable = typeof mod.DatabaseSync === "function";
-    } catch {
+    try {} catch {
       sqliteAvailable = false;
     }
killedBy: SessionIndex 基本读写 set/get/remove/close 全链路
statusReason: expected null not to be null

[Survived] ConditionalExpression
src/plugin/session-index.ts:51:25
     try {
       const mod = createRequire(import.meta.url)("node:sqlite") as { DatabaseSync: typeof DatabaseSync };
       DatabaseSyncCtor = mod.DatabaseSync;
-      sqliteAvailable = typeof mod.DatabaseSync === "function";
+      sqliteAvailable = false;
     } catch {
       sqliteAvailable = false;

[Survived] EqualityOperator
src/plugin/session-index.ts:51:25
     try {
       const mod = createRequire(import.meta.url)("node:sqlite") as { DatabaseSync: typeof DatabaseSync };
       DatabaseSyncCtor = mod.DatabaseSync;
-      sqliteAvailable = typeof mod.DatabaseSync === "function";
+      sqliteAvailable = typeof mod.DatabaseSync !== "function";
     } catch {
       sqliteAvailable = false;

[NoCoverage] BlockStatement
src/plugin/session-index.ts:52:13
       const mod = createRequire(import.meta.url)("node:sqlite") as { DatabaseSync: typeof DatabaseSync };
       DatabaseSyncCtor = mod.DatabaseSync;
       sqliteAvailable = typeof mod.DatabaseSync === "function";
-    } catch {
-      sqliteAvailable = false;
-    }
+    } catch {}
   }
   return DatabaseSyncCtor;

[NoCoverage] BooleanLiteral
src/plugin/session-index.ts:53:25
       DatabaseSyncCtor = mod.DatabaseSync;
       sqliteAvailable = typeof mod.DatabaseSync === "function";
     } catch {
-      sqliteAvailable = false;
+      sqliteAvailable = true;
     }
   }

[Killed] BlockStatement
src/plugin/session-index.ts:77:55
   private readonly stmtRemove: StatementSync;
   private readonly stmtByTeam: StatementSync;
 
-  private constructor(home: string, db: DatabaseSync) {
-    this.home = home;
-    this.db = db;
-    db.exec("PRAGMA journal_mode = WAL");
-    db.exec("PRAGMA busy_timeout = 3000");
-    db.exec(
-      "CREATE TABLE IF NOT EXISTS session_index (" +
-        "session_id TEXT PRIMARY KEY, " +
-        "team_home TEXT NOT NULL, " +
-        "member TEXT NOT NULL" +
-        ")",
-    );
-    this.stmtGet = db.prepare("SELECT team_home, member FROM session_index WHERE session_id = ?");
-    this.stmtSet = db.prepare(
-      "INSERT INTO session_index (session_id, team_home, member) VALUES (?, ?, ?) " +
-        "ON CONFLICT(session_id) DO UPDATE SET team_home = excluded.team_home, member = excluded.member",
-    );
-    this.stmtRemove = db.prepare("DELETE FROM session_index WHERE session_id = ?");
-    this.stmtByTeam = db.prepare("SELECT session_id FROM session_index WHERE team_home = ?");
-  }
+  private constructor(home: string, db: DatabaseSync) {}
 
   /** 打开（完成 schema 初始化）；失败抛错由调用方捕获转为禁用态。 */
killedBy: Wave 1a 工具面反查挂载（子代理 → 主控实例） 子代理未登记首调不缓存空解析，主控登记后自愈命中（独立审核发现）
statusReason: unauthenticated session is not allowed to team_inbox

[Survived] StringLiteral
src/plugin/session-index.ts:81:13
     this.home = home;
     this.db = db;
     db.exec("PRAGMA journal_mode = WAL");
-    db.exec("PRAGMA busy_timeout = 3000");
+    db.exec("");
     db.exec(
       "CREATE TABLE IF NOT EXISTS session_index (" +

[Killed] StringLiteral
src/plugin/session-index.ts:83:7
     db.exec("PRAGMA journal_mode = WAL");
     db.exec("PRAGMA busy_timeout = 3000");
     db.exec(
-      "CREATE TABLE IF NOT EXISTS session_index (" +
+      "" +
         "session_id TEXT PRIMARY KEY, " +
         "team_home TEXT NOT NULL, " +
killedBy: SessionIndex 基本读写 set/get/remove/close 全链路
statusReason: expected null not to be null

[Killed] StringLiteral
src/plugin/session-index.ts:84:9
     db.exec("PRAGMA busy_timeout = 3000");
     db.exec(
       "CREATE TABLE IF NOT EXISTS session_index (" +
-        "session_id TEXT PRIMARY KEY, " +
+        "" +
         "team_home TEXT NOT NULL, " +
         "member TEXT NOT NULL" +
killedBy: SessionIndex 基本读写 set/get/remove/close 全链路
statusReason: expected null not to be null

[Killed] StringLiteral
src/plugin/session-index.ts:85:9
     db.exec(
       "CREATE TABLE IF NOT EXISTS session_index (" +
         "session_id TEXT PRIMARY KEY, " +
-        "team_home TEXT NOT NULL, " +
+        "" +
         "member TEXT NOT NULL" +
         ")",
killedBy: SessionIndex 基本读写 set/get/remove/close 全链路
statusReason: expected null not to be null

[Killed] StringLiteral
src/plugin/session-index.ts:89:31
         "member TEXT NOT NULL" +
         ")",
     );
-    this.stmtGet = db.prepare("SELECT team_home, member FROM session_index WHERE session_id = ?");
+    this.stmtGet = db.prepare("");
     this.stmtSet = db.prepare(
       "INSERT INTO session_index (session_id, team_home, member) VALUES (?, ?, ?) " +
killedBy: SessionIndex 基本读写 set/get/remove/close 全链路
statusReason: expected undefined to deeply equal { …(2) }

[Killed] StringLiteral
src/plugin/session-index.ts:95:34
         "ON CONFLICT(session_id) DO UPDATE SET team_home = excluded.team_home, member = excluded.member",
     );
     this.stmtRemove = db.prepare("DELETE FROM session_index WHERE session_id = ?");
-    this.stmtByTeam = db.prepare("SELECT session_id FROM session_index WHERE team_home = ?");
+    this.stmtByTeam = db.prepare("");
   }
 
killedBy: 接管换 durableId：写面对账清理残留条目（QA 必须修正项） pruneTeam 直接清理同 home 不在册条目
statusReason: expected { …(2) } to be undefined

[Killed] BlockStatement
src/plugin/session-index.ts:99:61
   }
 
   /** 打开（完成 schema 初始化）；失败抛错由调用方捕获转为禁用态。 */
-  static open(home: string, db: DatabaseSync): SessionIndex {
-    return new SessionIndex(home, db);
-  }
+  static open(home: string, db: DatabaseSync): SessionIndex {}
 
   /** 反查：sessionId（durable id）→ 归属实例与成员名；无条目返回 undefined。 */
killedBy: SessionIndex 基本读写 set/get/remove/close 全链路
statusReason: Cannot read properties of undefined (reading 'set')

[Killed] BlockStatement
src/plugin/session-index.ts:104:57
   }
 
   /** 反查：sessionId（durable id）→ 归属实例与成员名；无条目返回 undefined。 */
-  get(sessionId: string): SessionIndexEntry | undefined {
-    if (sessionId.length === 0 || sessionId.length > INDEX_KEY_MAX) return undefined;
-    try {
-      const row = this.stmtGet.get(sessionId) as { team_home?: string; member?: string } | undefined;
-      if (row === undefined || row.team_home === undefined || row.member === undefined) return undefined;
-      return { teamHome: row.team_home, member: row.member };
-    } catch {
-      return undefined; // 查询异常按未命中处理，走旧回扫自愈
-    }
-  }
+  get(sessionId: string): SessionIndexEntry | undefined {}
 
   /** 登记/更新映射（幂等 upsert）。失败静默——索引是派生物，不阻塞主写事务。 */
killedBy: SessionIndex 基本读写 set/get/remove/close 全链路
statusReason: expected undefined to deeply equal { …(2) }

[Killed] ConditionalExpression
src/plugin/session-index.ts:105:9
 
   /** 反查：sessionId（durable id）→ 归属实例与成员名；无条目返回 undefined。 */
   get(sessionId: string): SessionIndexEntry | undefined {
-    if (sessionId.length === 0 || sessionId.length > INDEX_KEY_MAX) return undefined;
+    if (true) return undefined;
     try {
       const row = this.stmtGet.get(sessionId) as { team_home?: string; member?: string } | undefined;
killedBy: SessionIndex 基本读写 set/get/remove/close 全链路
statusReason: expected undefined to deeply equal { …(2) }

[Killed] EqualityOperator
src/plugin/session-index.ts:105:9
 
   /** 反查：sessionId（durable id）→ 归属实例与成员名；无条目返回 undefined。 */
   get(sessionId: string): SessionIndexEntry | undefined {
-    if (sessionId.length === 0 || sessionId.length > INDEX_KEY_MAX) return undefined;
+    if (sessionId.length !== 0 || sessionId.length > INDEX_KEY_MAX) return undefined;
     try {
       const row = this.stmtGet.get(sessionId) as { team_home?: string; member?: string } | undefined;
killedBy: Wave 1a 工具面反查挂载（子代理 → 主控实例） 子代理未登记首调不缓存空解析，主控登记后自愈命中（独立审核发现）
statusReason: unauthenticated session is not allowed to team_inbox

[Killed] BlockStatement
src/plugin/session-index.ts:106:9
   /** 反查：sessionId（durable id）→ 归属实例与成员名；无条目返回 undefined。 */
   get(sessionId: string): SessionIndexEntry | undefined {
     if (sessionId.length === 0 || sessionId.length > INDEX_KEY_MAX) return undefined;
-    try {
-      const row = this.stmtGet.get(sessionId) as { team_home?: string; member?: string } | undefined;
-      if (row === undefined || row.team_home === undefined || row.member === undefined) return undefined;
-      return { teamHome: row.team_home, member: row.member };
-    } catch {
+    try {} catch {
       return undefined; // 查询异常按未命中处理，走旧回扫自愈
     }
killedBy: Wave 1a 工具面反查挂载（子代理 → 主控实例） 子代理未登记首调不缓存空解析，主控登记后自愈命中（独立审核发现）
statusReason: unauthenticated session is not allowed to team_inbox

[Killed] EqualityOperator
src/plugin/session-index.ts:108:11
     if (sessionId.length === 0 || sessionId.length > INDEX_KEY_MAX) return undefined;
     try {
       const row = this.stmtGet.get(sessionId) as { team_home?: string; member?: string } | undefined;
-      if (row === undefined || row.team_home === undefined || row.member === undefined) return undefined;
+      if (row !== undefined || row.team_home === undefined || row.member === undefined) return undefined;
       return { teamHome: row.team_home, member: row.member };
     } catch {
killedBy: Wave 1a 工具面反查挂载（子代理 → 主控实例） 子代理未登记首调不缓存空解析，主控登记后自愈命中（独立审核发现）
statusReason: unauthenticated session is not allowed to team_inbox

[Killed] EqualityOperator
src/plugin/session-index.ts:108:32
     if (sessionId.length === 0 || sessionId.length > INDEX_KEY_MAX) return undefined;
     try {
       const row = this.stmtGet.get(sessionId) as { team_home?: string; member?: string } | undefined;
-      if (row === undefined || row.team_home === undefined || row.member === undefined) return undefined;
+      if (row === undefined || row.team_home !== undefined || row.member === undefined) return undefined;
       return { teamHome: row.team_home, member: row.member };
     } catch {
killedBy: Wave 1a 工具面反查挂载（子代理 → 主控实例） 子代理未登记首调不缓存空解析，主控登记后自愈命中（独立审核发现）
statusReason: unauthenticated session is not allowed to team_inbox

[Killed] ObjectLiteral
src/plugin/session-index.ts:109:14
     try {
       const row = this.stmtGet.get(sessionId) as { team_home?: string; member?: string } | undefined;
       if (row === undefined || row.team_home === undefined || row.member === undefined) return undefined;
-      return { teamHome: row.team_home, member: row.member };
+      return {};
     } catch {
       return undefined; // 查询异常按未命中处理，走旧回扫自愈
killedBy: Wave 1a 工具面反查挂载（子代理 → 主控实例） 子代理侧 handlers 认领主控侧信封并落主控账本
statusReason: The "path" argument must be of type string. Received undefined

[NoCoverage] BlockStatement
src/plugin/session-index.ts:110:13
       const row = this.stmtGet.get(sessionId) as { team_home?: string; member?: string } | undefined;
       if (row === undefined || row.team_home === undefined || row.member === undefined) return undefined;
       return { teamHome: row.team_home, member: row.member };
-    } catch {
-      return undefined; // 查询异常按未命中处理，走旧回扫自愈
-    }
+    } catch {}
   }
 

[Killed] BlockStatement
src/plugin/session-index.ts:116:66
   }
 
   /** 登记/更新映射（幂等 upsert）。失败静默——索引是派生物，不阻塞主写事务。 */
-  set(sessionId: string, teamHome: string, member: string): void {
-    if (sessionId.length === 0 || sessionId.length > INDEX_KEY_MAX) return;
-    if (teamHome.length === 0 || member.length === 0) return;
-    try {
-      this.stmtSet.run(sessionId, teamHome, member);
-    } catch {
-      // best-effort：忽略（漏检由 miss 回扫自愈）
-    }
-  }
+  set(sessionId: string, teamHome: string, member: string): void {}
 
   /** 删除单条（索引命中但实例未初始化时惰性清理）。 */
killedBy: Wave 1a 工具面反查挂载（子代理 → 主控实例） 子代理未登记首调不缓存空解析，主控登记后自愈命中（独立审核发现）
statusReason: unauthenticated session is not allowed to team_inbox

[Killed] ConditionalExpression
src/plugin/session-index.ts:117:9
 
   /** 登记/更新映射（幂等 upsert）。失败静默——索引是派生物，不阻塞主写事务。 */
   set(sessionId: string, teamHome: string, member: string): void {
-    if (sessionId.length === 0 || sessionId.length > INDEX_KEY_MAX) return;
+    if (true) return;
     if (teamHome.length === 0 || member.length === 0) return;
     try {
killedBy: Wave 1a 工具面反查挂载（子代理 → 主控实例） 子代理未登记首调不缓存空解析，主控登记后自愈命中（独立审核发现）
statusReason: unauthenticated session is not allowed to team_inbox

[Killed] EqualityOperator
src/plugin/session-index.ts:117:35
 
   /** 登记/更新映射（幂等 upsert）。失败静默——索引是派生物，不阻塞主写事务。 */
   set(sessionId: string, teamHome: string, member: string): void {
-    if (sessionId.length === 0 || sessionId.length > INDEX_KEY_MAX) return;
+    if (sessionId.length === 0 || sessionId.length <= INDEX_KEY_MAX) return;
     if (teamHome.length === 0 || member.length === 0) return;
     try {
killedBy: Wave 1a 工具面反查挂载（子代理 → 主控实例） 子代理未登记首调不缓存空解析，主控登记后自愈命中（独立审核发现）
statusReason: unauthenticated session is not allowed to team_inbox

[Killed] EqualityOperator
src/plugin/session-index.ts:118:9
   /** 登记/更新映射（幂等 upsert）。失败静默——索引是派生物，不阻塞主写事务。 */
   set(sessionId: string, teamHome: string, member: string): void {
     if (sessionId.length === 0 || sessionId.length > INDEX_KEY_MAX) return;
-    if (teamHome.length === 0 || member.length === 0) return;
+    if (teamHome.length !== 0 || member.length === 0) return;
     try {
       this.stmtSet.run(sessionId, teamHome, member);
killedBy: Wave 1a 工具面反查挂载（子代理 → 主控实例） 子代理未登记首调不缓存空解析，主控登记后自愈命中（独立审核发现）
statusReason: unauthenticated session is not allowed to team_inbox

[Killed] EqualityOperator
src/plugin/session-index.ts:118:34
   /** 登记/更新映射（幂等 upsert）。失败静默——索引是派生物，不阻塞主写事务。 */
   set(sessionId: string, teamHome: string, member: string): void {
     if (sessionId.length === 0 || sessionId.length > INDEX_KEY_MAX) return;
-    if (teamHome.length === 0 || member.length === 0) return;
+    if (teamHome.length === 0 || member.length !== 0) return;
     try {
       this.stmtSet.run(sessionId, teamHome, member);
killedBy: Wave 1a 工具面反查挂载（子代理 → 主控实例） 子代理未登记首调不缓存空解析，主控登记后自愈命中（独立审核发现）
statusReason: unauthenticated session is not allowed to team_inbox

[Killed] BlockStatement
src/plugin/session-index.ts:119:9
   set(sessionId: string, teamHome: string, member: string): void {
     if (sessionId.length === 0 || sessionId.length > INDEX_KEY_MAX) return;
     if (teamHome.length === 0 || member.length === 0) return;
-    try {
-      this.stmtSet.run(sessionId, teamHome, member);
-    } catch {
+    try {} catch {
       // best-effort：忽略（漏检由 miss 回扫自愈）
     }
killedBy: Wave 1a 工具面反查挂载（子代理 → 主控实例） 子代理未登记首调不缓存空解析，主控登记后自愈命中（独立审核发现）
statusReason: unauthenticated session is not allowed to team_inbox

[Killed] CallExpression
src/plugin/session-index.ts:120:7
     if (sessionId.length === 0 || sessionId.length > INDEX_KEY_MAX) return;
     if (teamHome.length === 0 || member.length === 0) return;
     try {
-      this.stmtSet.run(sessionId, teamHome, member);
+      ;
     } catch {
       // best-effort：忽略（漏检由 miss 回扫自愈）
killedBy: Wave 1a 工具面反查挂载（子代理 → 主控实例） 子代理未登记首调不缓存空解析，主控登记后自愈命中（独立审核发现）
statusReason: unauthenticated session is not allowed to team_inbox

[Killed] BlockStatement
src/plugin/session-index.ts:127:35
   }
 
   /** 删除单条（索引命中但实例未初始化时惰性清理）。 */
-  remove(sessionId: string): void {
-    if (sessionId.length === 0 || sessionId.length > INDEX_KEY_MAX) return;
-    try {
-      this.stmtRemove.run(sessionId);
-    } catch {
-      // best-effort
-    }
-  }
+  remove(sessionId: string): void {}
 
   /**
killedBy: SessionIndex 基本读写 set/get/remove/close 全链路
statusReason: expected { …(2) } to be undefined

[Killed] EqualityOperator
src/plugin/session-index.ts:128:35
 
   /** 删除单条（索引命中但实例未初始化时惰性清理）。 */
   remove(sessionId: string): void {
-    if (sessionId.length === 0 || sessionId.length > INDEX_KEY_MAX) return;
+    if (sessionId.length === 0 || sessionId.length <= INDEX_KEY_MAX) return;
     try {
       this.stmtRemove.run(sessionId);
killedBy: SessionIndex 基本读写 set/get/remove/close 全链路
statusReason: expected { …(2) } to be undefined

[Killed] EqualityOperator
src/plugin/session-index.ts:128:9
 
   /** 删除单条（索引命中但实例未初始化时惰性清理）。 */
   remove(sessionId: string): void {
-    if (sessionId.length === 0 || sessionId.length > INDEX_KEY_MAX) return;
+    if (sessionId.length !== 0 || sessionId.length > INDEX_KEY_MAX) return;
     try {
       this.stmtRemove.run(sessionId);
killedBy: SessionIndex 基本读写 set/get/remove/close 全链路
statusReason: expected { …(2) } to be undefined

[Killed] BlockStatement
src/plugin/session-index.ts:129:9
   /** 删除单条（索引命中但实例未初始化时惰性清理）。 */
   remove(sessionId: string): void {
     if (sessionId.length === 0 || sessionId.length > INDEX_KEY_MAX) return;
-    try {
-      this.stmtRemove.run(sessionId);
-    } catch {
+    try {} catch {
       // best-effort
     }
killedBy: SessionIndex 基本读写 set/get/remove/close 全链路
statusReason: expected { …(2) } to be undefined

[Killed] CallExpression
src/plugin/session-index.ts:130:7
   remove(sessionId: string): void {
     if (sessionId.length === 0 || sessionId.length > INDEX_KEY_MAX) return;
     try {
-      this.stmtRemove.run(sessionId);
+      ;
     } catch {
       // best-effort
killedBy: SessionIndex 基本读写 set/get/remove/close 全链路
statusReason: expected { …(2) } to be undefined

[Killed] BlockStatement
src/plugin/session-index.ts:143:75
    * 全量对账（而非只删旧条目）：登记是低频写操作（每任务派发一次），读一次
    * agents.json + 按 teamHome 批量删除，量级受控。
    */
-  pruneTeam(teamHome: string, validDurableIds: ReadonlySet<string>): void {
-    if (teamHome.length === 0) return;
-    try {
-      const rows = this.stmtByTeam.all(teamHome) as Array<{ session_id: string }>;
-      for (const row of rows) {
-        if (!validDurableIds.has(row.session_id)) {
-          this.stmtRemove.run(row.session_id);
-        }
-      }
-    } catch {
-      // best-effort：对账失败静默（漏检由 miss 回扫自愈）
-    }
-  }
+  pruneTeam(teamHome: string, validDurableIds: ReadonlySet<string>): void {}
 
   close(): void {
killedBy: 接管换 durableId：写面对账清理残留条目（QA 必须修正项） pruneTeam 直接清理同 home 不在册条目
statusReason: expected { …(2) } to be undefined

[Killed] ConditionalExpression
src/plugin/session-index.ts:144:9
    * agents.json + 按 teamHome 批量删除，量级受控。
    */
   pruneTeam(teamHome: string, validDurableIds: ReadonlySet<string>): void {
-    if (teamHome.length === 0) return;
+    if (true) return;
     try {
       const rows = this.stmtByTeam.all(teamHome) as Array<{ session_id: string }>;
killedBy: 接管换 durableId：写面对账清理残留条目（QA 必须修正项） pruneTeam 直接清理同 home 不在册条目
statusReason: expected { …(2) } to be undefined

[Killed] EqualityOperator
src/plugin/session-index.ts:144:9
    * agents.json + 按 teamHome 批量删除，量级受控。
    */
   pruneTeam(teamHome: string, validDurableIds: ReadonlySet<string>): void {
-    if (teamHome.length === 0) return;
+    if (teamHome.length !== 0) return;
     try {
       const rows = this.stmtByTeam.all(teamHome) as Array<{ session_id: string }>;
killedBy: 接管换 durableId：写面对账清理残留条目（QA 必须修正项） pruneTeam 直接清理同 home 不在册条目
statusReason: expected { …(2) } to be undefined

[Killed] BlockStatement
src/plugin/session-index.ts:145:9
    */
   pruneTeam(teamHome: string, validDurableIds: ReadonlySet<string>): void {
     if (teamHome.length === 0) return;
-    try {
-      const rows = this.stmtByTeam.all(teamHome) as Array<{ session_id: string }>;
-      for (const row of rows) {
-        if (!validDurableIds.has(row.session_id)) {
-          this.stmtRemove.run(row.session_id);
-        }
-      }
-    } catch {
+    try {} catch {
       // best-effort：对账失败静默（漏检由 miss 回扫自愈）
     }
killedBy: 接管换 durableId：写面对账清理残留条目（QA 必须修正项） pruneTeam 直接清理同 home 不在册条目
statusReason: expected { …(2) } to be undefined

[Killed] BlockStatement
src/plugin/session-index.ts:147:31
     if (teamHome.length === 0) return;
     try {
       const rows = this.stmtByTeam.all(teamHome) as Array<{ session_id: string }>;
-      for (const row of rows) {
-        if (!validDurableIds.has(row.session_id)) {
-          this.stmtRemove.run(row.session_id);
-        }
-      }
+      for (const row of rows) {}
     } catch {
       // best-effort：对账失败静默（漏检由 miss 回扫自愈）
killedBy: 接管换 durableId：写面对账清理残留条目（QA 必须修正项） pruneTeam 直接清理同 home 不在册条目
statusReason: expected { …(2) } to be undefined

[Killed] ConditionalExpression
src/plugin/session-index.ts:148:13
     try {
       const rows = this.stmtByTeam.all(teamHome) as Array<{ session_id: string }>;
       for (const row of rows) {
-        if (!validDurableIds.has(row.session_id)) {
+        if (false) {
           this.stmtRemove.run(row.session_id);
         }
killedBy: 接管换 durableId：写面对账清理残留条目（QA 必须修正项） pruneTeam 直接清理同 home 不在册条目
statusReason: expected { …(2) } to be undefined

[Killed] BlockStatement
src/plugin/session-index.ts:148:51
     try {
       const rows = this.stmtByTeam.all(teamHome) as Array<{ session_id: string }>;
       for (const row of rows) {
-        if (!validDurableIds.has(row.session_id)) {
-          this.stmtRemove.run(row.session_id);
-        }
+        if (!validDurableIds.has(row.session_id)) {}
       }
     } catch {
killedBy: 接管换 durableId：写面对账清理残留条目（QA 必须修正项） pruneTeam 直接清理同 home 不在册条目
statusReason: expected { …(2) } to be undefined

[Killed] CallExpression
src/plugin/session-index.ts:149:11
       const rows = this.stmtByTeam.all(teamHome) as Array<{ session_id: string }>;
       for (const row of rows) {
         if (!validDurableIds.has(row.session_id)) {
-          this.stmtRemove.run(row.session_id);
+          ;
         }
       }
killedBy: 接管换 durableId：写面对账清理残留条目（QA 必须修正项） pruneTeam 直接清理同 home 不在册条目
statusReason: expected { …(2) } to be undefined

[Killed] BlockStatement
src/plugin/session-index.ts:157:17
     }
   }
 
-  close(): void {
-    try {
-      this.db.close();
-    } catch {
-      // 已关闭忽略
-    }
-    // 关闭即从单例表移除：同 DSH_HOME 后续再取将重新打开（测试 reset/热重载语义）。
-    instances.delete(this.home);
-  }
+  close(): void {}
 }
 
killedBy: 会话关闭与隔离 close 后可重开（新实例）；resetSessionIndex 清空单例表
statusReason: expected true to be false // Object.is equality

[Survived] BlockStatement
src/plugin/session-index.ts:158:9
   }
 
   close(): void {
-    try {
-      this.db.close();
-    } catch {
+    try {} catch {
       // 已关闭忽略
     }

[Survived] CallExpression
src/plugin/session-index.ts:159:7
 
   close(): void {
     try {
-      this.db.close();
+      ;
     } catch {
       // 已关闭忽略

[Killed] CallExpression
src/plugin/session-index.ts:164:5
       // 已关闭忽略
     }
     // 关闭即从单例表移除：同 DSH_HOME 后续再取将重新打开（测试 reset/热重载语义）。
-    instances.delete(this.home);
+    ;
   }
 }
killedBy: 会话关闭与隔离 close 后可重开（新实例）；resetSessionIndex 清空单例表
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/plugin/session-index.ts:169:30
 }
 
 /** 解析 DSH_HOME（与 team-home.resolveDshHome 同口径，避免循环依赖本地内联）。 */
-function dshHomeOf(): string {
-  return process.env.DSH_HOME ?? join(process.env.HOME ?? "", ".dsh");
-}
+function dshHomeOf(): string {}
 
 /**
killedBy: SessionIndex 基本读写 set/get/remove/close 全链路
statusReason: expected null not to be null

[Killed] LogicalOperator
src/plugin/session-index.ts:170:10
 
 /** 解析 DSH_HOME（与 team-home.resolveDshHome 同口径，避免循环依赖本地内联）。 */
 function dshHomeOf(): string {
-  return process.env.DSH_HOME ?? join(process.env.HOME ?? "", ".dsh");
+  return process.env.DSH_HOME && join(process.env.HOME ?? "", ".dsh");
 }
 
killedBy: SessionIndex 基本读写 索引文件落盘于 <DSH_HOME>/xiaozhuge/index.sqlite（ADR 0021 落点）
statusReason: expected false to be true // Object.is equality

[Survived] LogicalOperator
src/plugin/session-index.ts:170:39
 
 /** 解析 DSH_HOME（与 team-home.resolveDshHome 同口径，避免循环依赖本地内联）。 */
 function dshHomeOf(): string {
-  return process.env.DSH_HOME ?? join(process.env.HOME ?? "", ".dsh");
+  return process.env.DSH_HOME ?? join(process.env.HOME && "", ".dsh");
 }
 

[Killed] BlockStatement
src/plugin/session-index.ts:179:72
  * 测试等非目录协议形态的临时 teamHome（裸 mkdtemp）跳过登记，防止污染
  * 真实 `~/.dsh/xiaozhuge/index.sqlite` 与无意义的索引写入。
  */
-export function isTeamHomeUnderSessionsRoot(teamHome: string): boolean {
-  const sessionsRoot = join(dshHomeOf(), "xiaozhuge", "sessions");
-  const prefix = sessionsRoot.endsWith("/") ? sessionsRoot : sessionsRoot + "/";
-  return teamHome.startsWith(prefix);
-}
+export function isTeamHomeUnderSessionsRoot(teamHome: string): boolean {}
 
 /**
killedBy: Wave 1a 工具面反查挂载（子代理 → 主控实例） 子代理未登记首调不缓存空解析，主控登记后自愈命中（独立审核发现）
statusReason: unauthenticated session is not allowed to team_inbox

[Survived] StringLiteral
src/plugin/session-index.ts:180:55
  * 真实 `~/.dsh/xiaozhuge/index.sqlite` 与无意义的索引写入。
  */
 export function isTeamHomeUnderSessionsRoot(teamHome: string): boolean {
-  const sessionsRoot = join(dshHomeOf(), "xiaozhuge", "sessions");
+  const sessionsRoot = join(dshHomeOf(), "xiaozhuge", "");
   const prefix = sessionsRoot.endsWith("/") ? sessionsRoot : sessionsRoot + "/";
   return teamHome.startsWith(prefix);

[Survived] MethodExpression
src/plugin/session-index.ts:181:18
  */
 export function isTeamHomeUnderSessionsRoot(teamHome: string): boolean {
   const sessionsRoot = join(dshHomeOf(), "xiaozhuge", "sessions");
-  const prefix = sessionsRoot.endsWith("/") ? sessionsRoot : sessionsRoot + "/";
+  const prefix = sessionsRoot.startsWith("/") ? sessionsRoot : sessionsRoot + "/";
   return teamHome.startsWith(prefix);
 }

[Killed] MethodExpression
src/plugin/session-index.ts:182:10
 export function isTeamHomeUnderSessionsRoot(teamHome: string): boolean {
   const sessionsRoot = join(dshHomeOf(), "xiaozhuge", "sessions");
   const prefix = sessionsRoot.endsWith("/") ? sessionsRoot : sessionsRoot + "/";
-  return teamHome.startsWith(prefix);
+  return teamHome.endsWith(prefix);
 }
 
killedBy: Wave 1a 工具面反查挂载（子代理 → 主控实例） 子代理未登记首调不缓存空解析，主控登记后自愈命中（独立审核发现）
statusReason: unauthenticated session is not allowed to team_inbox

[Killed] BlockStatement
src/plugin/session-index.ts:189:72
  * 获取当前 DSH_HOME 的索引句柄；不可用/打开失败返回 null（反查回落旧全扫）。
  * 惰性：首用才创建；打开失败记入 disabledHomes，进程内不重试。
  */
-export function sessionIndexFor(dshHome?: string): SessionIndex | null {
-  const home = dshHome ?? dshHomeOf();
-  const cached = instances.get(home);
-  if (cached !== undefined) return cached;
-  if (disabledHomes.has(home)) return null;
-  const Ctor = detectDatabaseSync();
-  if (Ctor === undefined) {
-    disabledHomes.add(home);
-    return null;
-  }
-  try {
-    const dbPath = join(home, INDEX_REL_PATH);
-    // 打开前确保父目录存在（新 DSH_HOME 可能尚无 xiaozhuge/ 目录，否则
-    // DatabaseSync 打开会因 ENOENT 抛错被误判为"索引不可用"）。
-    mkdirSync(dirname(dbPath), { recursive: true });
-    const index = SessionIndex.open(home, new Ctor(dbPath));
-    instances.set(home, index);
-    return index;
-  } catch {
-    disabledHomes.add(home);
-    return null;
-  }
-}
+export function sessionIndexFor(dshHome?: string): SessionIndex | null {}
 
 /** 插件卸载：关闭全部实例并清理状态（供 host.ts dispose）。 */
killedBy: Wave 1a 工具面反查挂载（子代理 → 主控实例） 子代理侧 handlers 认领主控侧信封并落主控账本
statusReason: dispatch stopped after [none]: Cannot read properties of undefined (reading 'set')

[Killed] LogicalOperator
src/plugin/session-index.ts:190:16
  * 惰性：首用才创建；打开失败记入 disabledHomes，进程内不重试。
  */
 export function sessionIndexFor(dshHome?: string): SessionIndex | null {
-  const home = dshHome ?? dshHomeOf();
+  const home = dshHome && dshHomeOf();
   const cached = instances.get(home);
   if (cached !== undefined) return cached;
killedBy: SessionIndex 基本读写 set/get/remove/close 全链路
statusReason: expected null not to be null
