[Killed] ConditionalExpression
src/plugin/session-index.ts:192:7
 export function sessionIndexFor(dshHome?: string): SessionIndex | null {
   const home = dshHome ?? dshHomeOf();
   const cached = instances.get(home);
-  if (cached !== undefined) return cached;
+  if (true) return cached;
   if (disabledHomes.has(home)) return null;
   const Ctor = detectDatabaseSync();
killedBy: Wave 1a 工具面反查挂载（子代理 → 主控实例） 子代理侧 handlers 认领主控侧信封并落主控账本
statusReason: dispatch stopped after [none]: Cannot read properties of undefined (reading 'set')

[Killed] EqualityOperator
src/plugin/session-index.ts:192:7
 export function sessionIndexFor(dshHome?: string): SessionIndex | null {
   const home = dshHome ?? dshHomeOf();
   const cached = instances.get(home);
-  if (cached !== undefined) return cached;
+  if (cached === undefined) return cached;
   if (disabledHomes.has(home)) return null;
   const Ctor = detectDatabaseSync();
killedBy: SessionIndex 基本读写 set/get/remove/close 全链路
statusReason: Cannot read properties of undefined (reading 'set')

[Killed] ConditionalExpression
src/plugin/session-index.ts:193:7
   const home = dshHome ?? dshHomeOf();
   const cached = instances.get(home);
   if (cached !== undefined) return cached;
-  if (disabledHomes.has(home)) return null;
+  if (true) return null;
   const Ctor = detectDatabaseSync();
   if (Ctor === undefined) {
killedBy: SessionIndex 基本读写 set/get/remove/close 全链路
statusReason: expected null not to be null

[Survived] ConditionalExpression
src/plugin/session-index.ts:193:7
   const home = dshHome ?? dshHomeOf();
   const cached = instances.get(home);
   if (cached !== undefined) return cached;
-  if (disabledHomes.has(home)) return null;
+  if (false) return null;
   const Ctor = detectDatabaseSync();
   if (Ctor === undefined) {

[Killed] ConditionalExpression
src/plugin/session-index.ts:195:7
   if (cached !== undefined) return cached;
   if (disabledHomes.has(home)) return null;
   const Ctor = detectDatabaseSync();
-  if (Ctor === undefined) {
+  if (true) {
     disabledHomes.add(home);
     return null;
killedBy: SessionIndex 基本读写 set/get/remove/close 全链路
statusReason: expected null not to be null

[Killed] EqualityOperator
src/plugin/session-index.ts:195:7
   if (cached !== undefined) return cached;
   if (disabledHomes.has(home)) return null;
   const Ctor = detectDatabaseSync();
-  if (Ctor === undefined) {
+  if (Ctor !== undefined) {
     disabledHomes.add(home);
     return null;
killedBy: SessionIndex 基本读写 set/get/remove/close 全链路
statusReason: expected null not to be null

[NoCoverage] CallExpression
src/plugin/session-index.ts:196:5
   if (disabledHomes.has(home)) return null;
   const Ctor = detectDatabaseSync();
   if (Ctor === undefined) {
-    disabledHomes.add(home);
+    ;
     return null;
   }

[Killed] BlockStatement
src/plugin/session-index.ts:199:7
     disabledHomes.add(home);
     return null;
   }
-  try {
-    const dbPath = join(home, INDEX_REL_PATH);
-    // 打开前确保父目录存在（新 DSH_HOME 可能尚无 xiaozhuge/ 目录，否则
-    // DatabaseSync 打开会因 ENOENT 抛错被误判为"索引不可用"）。
-    mkdirSync(dirname(dbPath), { recursive: true });
-    const index = SessionIndex.open(home, new Ctor(dbPath));
-    instances.set(home, index);
-    return index;
-  } catch {
+  try {} catch {
     disabledHomes.add(home);
     return null;
killedBy: SessionIndex 基本读写 set/get/remove/close 全链路
statusReason: Cannot read properties of undefined (reading 'set')

[Killed] BooleanLiteral
src/plugin/session-index.ts:203:45
     const dbPath = join(home, INDEX_REL_PATH);
     // 打开前确保父目录存在（新 DSH_HOME 可能尚无 xiaozhuge/ 目录，否则
     // DatabaseSync 打开会因 ENOENT 抛错被误判为"索引不可用"）。
-    mkdirSync(dirname(dbPath), { recursive: true });
+    mkdirSync(dirname(dbPath), { recursive: false });
     const index = SessionIndex.open(home, new Ctor(dbPath));
     instances.set(home, index);
killedBy: SessionIndex 基本读写 set/get/remove/close 全链路
statusReason: expected null not to be null

[Survived] CallExpression
src/plugin/session-index.ts:205:5
     // DatabaseSync 打开会因 ENOENT 抛错被误判为"索引不可用"）。
     mkdirSync(dirname(dbPath), { recursive: true });
     const index = SessionIndex.open(home, new Ctor(dbPath));
-    instances.set(home, index);
+    ;
     return index;
   } catch {

[Killed] BlockStatement
src/plugin/session-index.ts:207:11
     const index = SessionIndex.open(home, new Ctor(dbPath));
     instances.set(home, index);
     return index;
-  } catch {
-    disabledHomes.add(home);
-    return null;
-  }
+  } catch {}
 }
 
killedBy: 负缓存与降级 索引损坏 → 禁用并回落旧全扫，正确性不破
statusReason: expected undefined to be null

[Survived] CallExpression
src/plugin/session-index.ts:208:5
     instances.set(home, index);
     return index;
   } catch {
-    disabledHomes.add(home);
+    ;
     return null;
   }

[Survived] BlockStatement
src/plugin/session-index.ts:214:43
 }
 
 /** 插件卸载：关闭全部实例并清理状态（供 host.ts dispose）。 */
-export function closeSessionIndex(): void {
-  for (const idx of [...instances.values()]) idx?.close();
-  instances.clear();
-  disabledHomes.clear();
-}
+export function closeSessionIndex(): void {}
 
 /** 测试隔离：同 closeSessionIndex（供 vitest afterEach 复用，语义一致）。 */

[Survived] OptionalChaining
src/plugin/session-index.ts:215:46
 
 /** 插件卸载：关闭全部实例并清理状态（供 host.ts dispose）。 */
 export function closeSessionIndex(): void {
-  for (const idx of [...instances.values()]) idx?.close();
+  for (const idx of [...instances.values()]) idx.close();
   instances.clear();
   disabledHomes.clear();

[Survived] ArrayDeclaration
src/plugin/session-index.ts:215:21
 
 /** 插件卸载：关闭全部实例并清理状态（供 host.ts dispose）。 */
 export function closeSessionIndex(): void {
-  for (const idx of [...instances.values()]) idx?.close();
+  for (const idx of []) idx?.close();
   instances.clear();
   disabledHomes.clear();

[Survived] CallExpression
src/plugin/session-index.ts:216:3
 /** 插件卸载：关闭全部实例并清理状态（供 host.ts dispose）。 */
 export function closeSessionIndex(): void {
   for (const idx of [...instances.values()]) idx?.close();
-  instances.clear();
+  ;
   disabledHomes.clear();
 }

[Survived] CallExpression
src/plugin/session-index.ts:217:3
 export function closeSessionIndex(): void {
   for (const idx of [...instances.values()]) idx?.close();
   instances.clear();
-  disabledHomes.clear();
+  ;
 }
 

[Survived] BlockStatement
src/plugin/session-index.ts:221:43
 }
 
 /** 测试隔离：同 closeSessionIndex（供 vitest afterEach 复用，语义一致）。 */
-export function resetSessionIndex(): void {
-  closeSessionIndex();
-}
+export function resetSessionIndex(): void {}
 

[Survived] CallExpression
src/plugin/session-index.ts:222:3
 
 /** 测试隔离：同 closeSessionIndex（供 vitest afterEach 复用，语义一致）。 */
 export function resetSessionIndex(): void {
-  closeSessionIndex();
+  ;
 }
 
