[Survived] BlockStatement
src/plugin/team-home.ts:62:45
 /** 模块级负缓存：sessionId → 过期时间戳。 */
 const negativeCache = new Map<string, number>();
 
-function cacheMiss(sessionId: string): void {
-  negativeCache.set(sessionId, Date.now() + NEGATIVE_CACHE_TTL_MS);
-  if (negativeCache.size > NEGATIVE_CACHE_MAX) {
-    // 有界：先清过期项，仍超限删最旧（Map 插入序首个）。
-    const now = Date.now();
-    for (const [k, exp] of negativeCache) {
-      if (exp <= now) negativeCache.delete(k);
-    }
-    const oldest = negativeCache.keys().next().value;
-    if (oldest !== undefined && negativeCache.size > NEGATIVE_CACHE_MAX) negativeCache.delete(oldest);
-  }
-}
+function cacheMiss(sessionId: string): void {}
 
 function isCachedMiss(sessionId: string): boolean {

[Survived] ArithmeticOperator
src/plugin/team-home.ts:63:32
 const negativeCache = new Map<string, number>();
 
 function cacheMiss(sessionId: string): void {
-  negativeCache.set(sessionId, Date.now() + NEGATIVE_CACHE_TTL_MS);
+  negativeCache.set(sessionId, Date.now() - NEGATIVE_CACHE_TTL_MS);
   if (negativeCache.size > NEGATIVE_CACHE_MAX) {
     // 有界：先清过期项，仍超限删最旧（Map 插入序首个）。

[Survived] ConditionalExpression
src/plugin/team-home.ts:64:7
 
 function cacheMiss(sessionId: string): void {
   negativeCache.set(sessionId, Date.now() + NEGATIVE_CACHE_TTL_MS);
-  if (negativeCache.size > NEGATIVE_CACHE_MAX) {
+  if (true) {
     // 有界：先清过期项，仍超限删最旧（Map 插入序首个）。
     const now = Date.now();

[NoCoverage] BlockStatement
src/plugin/team-home.ts:64:48
 
 function cacheMiss(sessionId: string): void {
   negativeCache.set(sessionId, Date.now() + NEGATIVE_CACHE_TTL_MS);
-  if (negativeCache.size > NEGATIVE_CACHE_MAX) {
-    // 有界：先清过期项，仍超限删最旧（Map 插入序首个）。
-    const now = Date.now();
-    for (const [k, exp] of negativeCache) {
-      if (exp <= now) negativeCache.delete(k);
-    }
-    const oldest = negativeCache.keys().next().value;
-    if (oldest !== undefined && negativeCache.size > NEGATIVE_CACHE_MAX) negativeCache.delete(oldest);
-  }
+  if (negativeCache.size > NEGATIVE_CACHE_MAX) {}
 }
 

[NoCoverage] BlockStatement
src/plugin/team-home.ts:67:43
   if (negativeCache.size > NEGATIVE_CACHE_MAX) {
     // 有界：先清过期项，仍超限删最旧（Map 插入序首个）。
     const now = Date.now();
-    for (const [k, exp] of negativeCache) {
-      if (exp <= now) negativeCache.delete(k);
-    }
+    for (const [k, exp] of negativeCache) {}
     const oldest = negativeCache.keys().next().value;
     if (oldest !== undefined && negativeCache.size > NEGATIVE_CACHE_MAX) negativeCache.delete(oldest);

[NoCoverage] EqualityOperator
src/plugin/team-home.ts:68:11
     // 有界：先清过期项，仍超限删最旧（Map 插入序首个）。
     const now = Date.now();
     for (const [k, exp] of negativeCache) {
-      if (exp <= now) negativeCache.delete(k);
+      if (exp > now) negativeCache.delete(k);
     }
     const oldest = negativeCache.keys().next().value;

[NoCoverage] ConditionalExpression
src/plugin/team-home.ts:68:11
     // 有界：先清过期项，仍超限删最旧（Map 插入序首个）。
     const now = Date.now();
     for (const [k, exp] of negativeCache) {
-      if (exp <= now) negativeCache.delete(k);
+      if (false) negativeCache.delete(k);
     }
     const oldest = negativeCache.keys().next().value;

[NoCoverage] LogicalOperator
src/plugin/team-home.ts:71:9
       if (exp <= now) negativeCache.delete(k);
     }
     const oldest = negativeCache.keys().next().value;
-    if (oldest !== undefined && negativeCache.size > NEGATIVE_CACHE_MAX) negativeCache.delete(oldest);
+    if (oldest !== undefined || negativeCache.size > NEGATIVE_CACHE_MAX) negativeCache.delete(oldest);
   }
 }

[NoCoverage] ConditionalExpression
src/plugin/team-home.ts:71:33
       if (exp <= now) negativeCache.delete(k);
     }
     const oldest = negativeCache.keys().next().value;
-    if (oldest !== undefined && negativeCache.size > NEGATIVE_CACHE_MAX) negativeCache.delete(oldest);
+    if (oldest !== undefined && true) negativeCache.delete(oldest);
   }
 }

[Survived] BlockStatement
src/plugin/team-home.ts:75:51
   }
 }
 
-function isCachedMiss(sessionId: string): boolean {
-  const exp = negativeCache.get(sessionId);
-  if (exp === undefined) return false;
-  if (exp > Date.now()) return true;
-  negativeCache.delete(sessionId);
-  return false;
-}
+function isCachedMiss(sessionId: string): boolean {}
 
 /** 全目录扫描（旧实现，作为索引 miss 的自愈兜底）。 */

[Killed] BooleanLiteral
src/plugin/team-home.ts:77:33
 
 function isCachedMiss(sessionId: string): boolean {
   const exp = negativeCache.get(sessionId);
-  if (exp === undefined) return false;
+  if (exp === undefined) return true;
   if (exp > Date.now()) return true;
   negativeCache.delete(sessionId);
killedBy: team/create 一键建团 已登记成员自建 root 被拒（Wave 1b 提权防护，HTTP 409 member-conflict）
statusReason: expected 200 to be 409 // Object.is equality

[Survived] EqualityOperator
src/plugin/team-home.ts:77:7
 
 function isCachedMiss(sessionId: string): boolean {
   const exp = negativeCache.get(sessionId);
-  if (exp === undefined) return false;
+  if (exp !== undefined) return false;
   if (exp > Date.now()) return true;
   negativeCache.delete(sessionId);

[Survived] ConditionalExpression
src/plugin/team-home.ts:78:7
 function isCachedMiss(sessionId: string): boolean {
   const exp = negativeCache.get(sessionId);
   if (exp === undefined) return false;
-  if (exp > Date.now()) return true;
+  if (true) return true;
   negativeCache.delete(sessionId);
   return false;

[Survived] ConditionalExpression
src/plugin/team-home.ts:78:7
 function isCachedMiss(sessionId: string): boolean {
   const exp = negativeCache.get(sessionId);
   if (exp === undefined) return false;
-  if (exp > Date.now()) return true;
+  if (false) return true;
   negativeCache.delete(sessionId);
   return false;

[Survived] CallExpression
src/plugin/team-home.ts:79:3
   const exp = negativeCache.get(sessionId);
   if (exp === undefined) return false;
   if (exp > Date.now()) return true;
-  negativeCache.delete(sessionId);
+  ;
   return false;
 }

[Survived] BooleanLiteral
src/plugin/team-home.ts:80:10
   if (exp === undefined) return false;
   if (exp > Date.now()) return true;
   negativeCache.delete(sessionId);
-  return false;
+  return true;
 }
 

[Survived] ArrayDeclaration
src/plugin/team-home.ts:86:27
 /** 全目录扫描（旧实现，作为索引 miss 的自愈兜底）。 */
 function scanSessions(sessionId: string, direct: string): TeamHomeResolution {
   const sessionsDir = join(resolveDshHome(), "xiaozhuge", "sessions");
-  let entries: string[] = [];
+  let entries: string[] = ["Stryker was here"];
   try {
     // 显式排序：命中顺序确定化（durable id 全局唯一时理论上无多实例冲突，

[Killed] BlockStatement
src/plugin/team-home.ts:87:7
 function scanSessions(sessionId: string, direct: string): TeamHomeResolution {
   const sessionsDir = join(resolveDshHome(), "xiaozhuge", "sessions");
   let entries: string[] = [];
-  try {
-    // 显式排序：命中顺序确定化（durable id 全局唯一时理论上无多实例冲突，
-    // 排序保证极端情况下行为可复现）。
-    entries = readdirSync(sessionsDir).sort();
-  } catch {
+  try {} catch {
     return { teamHome: direct, membership: null };
   }
killedBy: overview 经 ForView 装配的子会话反查供数（#97） 成员 durableId 打 overview → 以实例根数据应答；未知会话仍短路 isTeam=false
statusReason: expected false to be true // Object.is equality

[Survived] MethodExpression
src/plugin/team-home.ts:90:15
   try {
     // 显式排序：命中顺序确定化（durable id 全局唯一时理论上无多实例冲突，
     // 排序保证极端情况下行为可复现）。
-    entries = readdirSync(sessionsDir).sort();
+    entries = readdirSync(sessionsDir);
   } catch {
     return { teamHome: direct, membership: null };

[Survived] BlockStatement
src/plugin/team-home.ts:91:11
     // 显式排序：命中顺序确定化（durable id 全局唯一时理论上无多实例冲突，
     // 排序保证极端情况下行为可复现）。
     entries = readdirSync(sessionsDir).sort();
-  } catch {
-    return { teamHome: direct, membership: null };
-  }
+  } catch {}
   for (const entry of entries) {
     const teamHome = join(sessionsDir, entry);

[Killed] BlockStatement
src/plugin/team-home.ts:94:32
   } catch {
     return { teamHome: direct, membership: null };
   }
-  for (const entry of entries) {
-    const teamHome = join(sessionsDir, entry);
-    const agentsJson = join(teamHome, "agents.json");
-    if (!existsSync(agentsJson) || !existsSync(join(teamHome, "team.yaml"))) continue;
-    try {
-      const reg = JSON.parse(readFileSync(agentsJson, "utf8")) as {
-        members?: Record<string, { durableId?: string; member?: string }>;
-      };
-      for (const m of Object.values(reg.members ?? {})) {
-        if (m.durableId === sessionId && typeof m.member === "string") {
-          return { teamHome, membership: { root_session: entry, member: m.member } };
-        }
-      }
-    } catch {
-      // 注册表损坏：跳过该实例继续扫描
-    }
-  }
+  for (const entry of entries) {}
   return { teamHome: direct, membership: null };
 }
killedBy: overview 经 ForView 装配的子会话反查供数（#97） 成员 durableId 打 overview → 以实例根数据应答；未知会话仍短路 isTeam=false
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/plugin/team-home.ts:97:9
   for (const entry of entries) {
     const teamHome = join(sessionsDir, entry);
     const agentsJson = join(teamHome, "agents.json");
-    if (!existsSync(agentsJson) || !existsSync(join(teamHome, "team.yaml"))) continue;
+    if (existsSync(agentsJson) || !existsSync(join(teamHome, "team.yaml"))) continue;
     try {
       const reg = JSON.parse(readFileSync(agentsJson, "utf8")) as {
killedBy: overview 经 ForView 装配的子会话反查供数（#97） 成员 durableId 打 overview → 以实例根数据应答；未知会话仍短路 isTeam=false
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/plugin/team-home.ts:97:36
   for (const entry of entries) {
     const teamHome = join(sessionsDir, entry);
     const agentsJson = join(teamHome, "agents.json");
-    if (!existsSync(agentsJson) || !existsSync(join(teamHome, "team.yaml"))) continue;
+    if (!existsSync(agentsJson) || existsSync(join(teamHome, "team.yaml"))) continue;
     try {
       const reg = JSON.parse(readFileSync(agentsJson, "utf8")) as {
killedBy: resolveTeamHomeForView 子会话反查命中：durableId 匹配成员 → 返回归属实例与成员名
statusReason: expected null to deeply equal { root_session: 's-root', …(1) }

[Killed] BlockStatement
src/plugin/team-home.ts:98:9
     const teamHome = join(sessionsDir, entry);
     const agentsJson = join(teamHome, "agents.json");
     if (!existsSync(agentsJson) || !existsSync(join(teamHome, "team.yaml"))) continue;
-    try {
-      const reg = JSON.parse(readFileSync(agentsJson, "utf8")) as {
-        members?: Record<string, { durableId?: string; member?: string }>;
-      };
-      for (const m of Object.values(reg.members ?? {})) {
-        if (m.durableId === sessionId && typeof m.member === "string") {
-          return { teamHome, membership: { root_session: entry, member: m.member } };
-        }
-      }
-    } catch {
+    try {} catch {
       // 注册表损坏：跳过该实例继续扫描
     }
killedBy: team/create 一键建团 已登记成员自建 root 被拒（Wave 1b 提权防护，HTTP 409 member-conflict）
statusReason: expected 200 to be 409 // Object.is equality

[Killed] BlockStatement
src/plugin/team-home.ts:102:57
       const reg = JSON.parse(readFileSync(agentsJson, "utf8")) as {
         members?: Record<string, { durableId?: string; member?: string }>;
       };
-      for (const m of Object.values(reg.members ?? {})) {
-        if (m.durableId === sessionId && typeof m.member === "string") {
-          return { teamHome, membership: { root_session: entry, member: m.member } };
-        }
-      }
+      for (const m of Object.values(reg.members ?? {})) {}
     } catch {
       // 注册表损坏：跳过该实例继续扫描
killedBy: resolveTeamHomeForView 子会话反查命中：durableId 匹配成员 → 返回归属实例与成员名
statusReason: expected null to deeply equal { root_session: 's-root', …(1) }

[Killed] LogicalOperator
src/plugin/team-home.ts:102:37
       const reg = JSON.parse(readFileSync(agentsJson, "utf8")) as {
         members?: Record<string, { durableId?: string; member?: string }>;
       };
-      for (const m of Object.values(reg.members ?? {})) {
+      for (const m of Object.values(reg.members && {})) {
         if (m.durableId === sessionId && typeof m.member === "string") {
           return { teamHome, membership: { root_session: entry, member: m.member } };
killedBy: resolveTeamHomeForView 子会话反查命中：durableId 匹配成员 → 返回归属实例与成员名
statusReason: expected null to deeply equal { root_session: 's-root', …(1) }

[Killed] EqualityOperator
src/plugin/team-home.ts:103:42
         members?: Record<string, { durableId?: string; member?: string }>;
       };
       for (const m of Object.values(reg.members ?? {})) {
-        if (m.durableId === sessionId && typeof m.member === "string") {
+        if (m.durableId === sessionId && typeof m.member !== "string") {
           return { teamHome, membership: { root_session: entry, member: m.member } };
         }
killedBy: overview 经 ForView 装配的子会话反查供数（#97） 成员 durableId 打 overview → 以实例根数据应答；未知会话仍短路 isTeam=false
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/plugin/team-home.ts:103:13
         members?: Record<string, { durableId?: string; member?: string }>;
       };
       for (const m of Object.values(reg.members ?? {})) {
-        if (m.durableId === sessionId && typeof m.member === "string") {
+        if (m.durableId !== sessionId && typeof m.member === "string") {
           return { teamHome, membership: { root_session: entry, member: m.member } };
         }
killedBy: resolveTeamHomeForView 子会话反查命中：durableId 匹配成员 → 返回归属实例与成员名
statusReason: expected { root_session: 's-root', …(1) } to deeply equal { root_session: 's-root', …(1) }

[Killed] ConditionalExpression
src/plugin/team-home.ts:117:7
 export function resolveTeamHomeForView(sessionId: string): TeamHomeResolution {
   const direct = resolveTeamHome(sessionId);
   // ① 主会话直查（快路径）：team.yaml 在场即为团队实例根，无需索引。
-  if (existsSync(join(direct, "team.yaml"))) {
+  if (true) {
     return { teamHome: direct, membership: null };
   }
killedBy: team/create 一键建团 已登记成员自建 root 被拒（Wave 1b 提权防护，HTTP 409 member-conflict）
statusReason: expected 200 to be 409 // Object.is equality

[Killed] BlockStatement
src/plugin/team-home.ts:117:46
 export function resolveTeamHomeForView(sessionId: string): TeamHomeResolution {
   const direct = resolveTeamHome(sessionId);
   // ① 主会话直查（快路径）：team.yaml 在场即为团队实例根，无需索引。
-  if (existsSync(join(direct, "team.yaml"))) {
-    return { teamHome: direct, membership: null };
-  }
+  if (existsSync(join(direct, "team.yaml"))) {}
   // ② 索引反查：命中且实例已初始化（team.yaml 守卫防错检占位实例）。
   const idx = sessionIndexFor();
killedBy: resolveTeamHomeForView 主会话直查优先：team.yaml 在场 → membership=null
statusReason: expected { root_session: 's-root', …(1) } to be null

[Killed] EqualityOperator
src/plugin/team-home.ts:122:7
   }
   // ② 索引反查：命中且实例已初始化（team.yaml 守卫防错检占位实例）。
   const idx = sessionIndexFor();
-  if (idx !== null) {
+  if (idx === null) {
     const hit = idx.get(sessionId);
     if (hit !== undefined) {
killedBy: 读面三阶段 索引命中：agents.json 被删后仍可反查（证明走索引非全扫）
statusReason: expected null to deeply equal { …(2) }

[Killed] ConditionalExpression
src/plugin/team-home.ts:122:7
   }
   // ② 索引反查：命中且实例已初始化（team.yaml 守卫防错检占位实例）。
   const idx = sessionIndexFor();
-  if (idx !== null) {
+  if (true) {
     const hit = idx.get(sessionId);
     if (hit !== undefined) {
killedBy: 负缓存与降级 索引损坏 → 禁用并回落旧全扫，正确性不破
statusReason: Cannot read properties of null (reading 'get')

[Killed] ConditionalExpression
src/plugin/team-home.ts:124:9
   const idx = sessionIndexFor();
   if (idx !== null) {
     const hit = idx.get(sessionId);
-    if (hit !== undefined) {
+    if (false) {
       if (existsSync(join(hit.teamHome, "team.yaml"))) {
         return {
killedBy: 读面三阶段 索引命中：agents.json 被删后仍可反查（证明走索引非全扫）
statusReason: expected null to deeply equal { …(2) }

[Killed] BlockStatement
src/plugin/team-home.ts:124:28
   const idx = sessionIndexFor();
   if (idx !== null) {
     const hit = idx.get(sessionId);
-    if (hit !== undefined) {
-      if (existsSync(join(hit.teamHome, "team.yaml"))) {
-        return {
-          teamHome: hit.teamHome,
-          membership: { root_session: basename(hit.teamHome), member: hit.member },
-        };
-      }
-      // 索引命中但实例未初始化（team.yaml 已删/未建）：惰性清条目，回落扫描。
-      idx.remove(sessionId);
-    }
+    if (hit !== undefined) {}
     // 负缓存：最近全扫未命中的无效/未知 id 短窗内不重复全扫（防放大挂起）。
     if (isCachedMiss(sessionId)) return { teamHome: direct, membership: null };
killedBy: 读面三阶段 索引命中：agents.json 被删后仍可反查（证明走索引非全扫）
statusReason: expected null to deeply equal { …(2) }

[Killed] ConditionalExpression
src/plugin/team-home.ts:125:11
   if (idx !== null) {
     const hit = idx.get(sessionId);
     if (hit !== undefined) {
-      if (existsSync(join(hit.teamHome, "team.yaml"))) {
+      if (false) {
         return {
           teamHome: hit.teamHome,
killedBy: 读面三阶段 索引命中：agents.json 被删后仍可反查（证明走索引非全扫）
statusReason: expected null to deeply equal { …(2) }

[Killed] BlockStatement
src/plugin/team-home.ts:125:56
   if (idx !== null) {
     const hit = idx.get(sessionId);
     if (hit !== undefined) {
-      if (existsSync(join(hit.teamHome, "team.yaml"))) {
-        return {
-          teamHome: hit.teamHome,
-          membership: { root_session: basename(hit.teamHome), member: hit.member },
-        };
-      }
+      if (existsSync(join(hit.teamHome, "team.yaml"))) {}
       // 索引命中但实例未初始化（team.yaml 已删/未建）：惰性清条目，回落扫描。
       idx.remove(sessionId);
killedBy: 读面三阶段 索引命中：agents.json 被删后仍可反查（证明走索引非全扫）
statusReason: expected null to deeply equal { …(2) }

[Killed] CallExpression
src/plugin/team-home.ts:132:7
         };
       }
       // 索引命中但实例未初始化（team.yaml 已删/未建）：惰性清条目，回落扫描。
-      idx.remove(sessionId);
+      ;
     }
     // 负缓存：最近全扫未命中的无效/未知 id 短窗内不重复全扫（防放大挂起）。
killedBy: 读面三阶段 索引命中但实例未初始化（team.yaml 不在）→ 不命中并惰性清条目
statusReason: expected { …(2) } to be undefined

[Killed] ConditionalExpression
src/plugin/team-home.ts:135:9
       idx.remove(sessionId);
     }
     // 负缓存：最近全扫未命中的无效/未知 id 短窗内不重复全扫（防放大挂起）。
-    if (isCachedMiss(sessionId)) return { teamHome: direct, membership: null };
+    if (true) return { teamHome: direct, membership: null };
   }
   // ③ miss 回退：全目录扫描（自愈），有命中回填索引、无命中登记负缓存。
killedBy: 读面三阶段 miss 回扫回填：手工构造 agents.json（不经 handler）也可自愈入索引
statusReason: expected null to deeply equal { …(2) }

[Survived] ConditionalExpression
src/plugin/team-home.ts:135:9
       idx.remove(sessionId);
     }
     // 负缓存：最近全扫未命中的无效/未知 id 短窗内不重复全扫（防放大挂起）。
-    if (isCachedMiss(sessionId)) return { teamHome: direct, membership: null };
+    if (false) return { teamHome: direct, membership: null };
   }
   // ③ miss 回退：全目录扫描（自愈），有命中回填索引、无命中登记负缓存。

[Killed] ConditionalExpression
src/plugin/team-home.ts:139:7
   }
   // ③ miss 回退：全目录扫描（自愈），有命中回填索引、无命中登记负缓存。
   const scanned = scanSessions(sessionId, direct);
-  if (idx !== null) {
+  if (true) {
     if (scanned.membership !== null) {
       idx.set(sessionId, scanned.teamHome, scanned.membership.member);
killedBy: 负缓存与降级 索引损坏 → 禁用并回落旧全扫，正确性不破
statusReason: Cannot read properties of null (reading 'set')

[Killed] ConditionalExpression
src/plugin/team-home.ts:139:7
   }
   // ③ miss 回退：全目录扫描（自愈），有命中回填索引、无命中登记负缓存。
   const scanned = scanSessions(sessionId, direct);
-  if (idx !== null) {
+  if (false) {
     if (scanned.membership !== null) {
       idx.set(sessionId, scanned.teamHome, scanned.membership.member);
killedBy: 读面三阶段 miss 回扫回填：手工构造 agents.json（不经 handler）也可自愈入索引
statusReason: expected undefined to deeply equal { …(2) }

[Killed] ConditionalExpression
src/plugin/team-home.ts:140:9
   // ③ miss 回退：全目录扫描（自愈），有命中回填索引、无命中登记负缓存。
   const scanned = scanSessions(sessionId, direct);
   if (idx !== null) {
-    if (scanned.membership !== null) {
+    if (true) {
       idx.set(sessionId, scanned.teamHome, scanned.membership.member);
       negativeCache.delete(sessionId);
killedBy: 读面三阶段 索引命中但实例未初始化（team.yaml 不在）→ 不命中并惰性清条目
statusReason: Cannot read properties of null (reading 'member')

[Killed] BlockStatement
src/plugin/team-home.ts:140:38
   // ③ miss 回退：全目录扫描（自愈），有命中回填索引、无命中登记负缓存。
   const scanned = scanSessions(sessionId, direct);
   if (idx !== null) {
-    if (scanned.membership !== null) {
-      idx.set(sessionId, scanned.teamHome, scanned.membership.member);
-      negativeCache.delete(sessionId);
-    } else {
+    if (scanned.membership !== null) {} else {
       cacheMiss(sessionId);
     }
killedBy: 读面三阶段 miss 回扫回填：手工构造 agents.json（不经 handler）也可自愈入索引
statusReason: expected undefined to deeply equal { …(2) }

[Killed] CallExpression
src/plugin/team-home.ts:141:7
   const scanned = scanSessions(sessionId, direct);
   if (idx !== null) {
     if (scanned.membership !== null) {
-      idx.set(sessionId, scanned.teamHome, scanned.membership.member);
+      ;
       negativeCache.delete(sessionId);
     } else {
killedBy: 读面三阶段 miss 回扫回填：手工构造 agents.json（不经 handler）也可自愈入索引
statusReason: expected undefined to deeply equal { …(2) }

[Survived] CallExpression
src/plugin/team-home.ts:142:7
   if (idx !== null) {
     if (scanned.membership !== null) {
       idx.set(sessionId, scanned.teamHome, scanned.membership.member);
-      negativeCache.delete(sessionId);
+      ;
     } else {
       cacheMiss(sessionId);

[Survived] BlockStatement
src/plugin/team-home.ts:143:12
     if (scanned.membership !== null) {
       idx.set(sessionId, scanned.teamHome, scanned.membership.member);
       negativeCache.delete(sessionId);
-    } else {
-      cacheMiss(sessionId);
-    }
+    } else {}
   }
   return scanned;

[Survived] CallExpression
src/plugin/team-home.ts:144:7
       idx.set(sessionId, scanned.teamHome, scanned.membership.member);
       negativeCache.delete(sessionId);
     } else {
-      cacheMiss(sessionId);
+      ;
     }
   }

[Killed] StringLiteral
src/plugin/team-home.ts:152:46
 
 /** user 层模板根（ADR 0013）：<DSH_HOME>/xiaozhuge/templates/。 */
 export function userTemplatesRoot(): string {
-  return join(resolveDshHome(), "xiaozhuge", "templates");
+  return join(resolveDshHome(), "xiaozhuge", "");
 }
 
killedBy: team/create 一键建团 user 层模板经 source=user 实例化，返回携带 source 标记
statusReason: expected 400 to be 200 // Object.is equality
