[Survived] StringLiteral
src/plugin/team-overview.ts:28:32
 import { SESSION_PATTERN } from "./session-id.js";
 
 /** 路由路径。 */
-export const ROUTES_OVERVIEW = "/api/xiaozhuge/team/overview";
+export const ROUTES_OVERVIEW = "";
 
 /** 事件尾部读取窗口上限（字节）。 */

[Killed] BlockStatement
src/plugin/team-overview.ts:109:48
 }
 
 /** 输入文件集指纹：注册表/事件流/黑板分片任一变化即翻转（P1-3：分片纳入，与 detail 先例对齐）。 */
-function fingerprint(teamHome: string): string {
-  const l = layout(teamHome);
-  const parts = [fileStamp(l.agentsJson)];
-  if (existsSync(l.roomsDir)) {
-    for (const entry of readdirSync(l.roomsDir, { withFileTypes: true })) {
-      if (!entry.isDirectory()) continue;
-      const roomDir = join(l.roomsDir, entry.name);
-      parts.push(`events|${entry.name}=${fileStamp(join(roomDir, "events.jsonl"))}`);
-      // Q3（#164）：分片保留态参与 tone 权威，分片单独变化必须翻转缓存。
-      const stateDir = join(roomDir, "state");
-      let stateStamps: string[] = [];
-      if (existsSync(stateDir)) {
-        stateStamps = readdirSync(stateDir)
-          .sort()
-          .map((s) => `${s}=${fileStamp(join(stateDir, s))}`);
-      }
-      parts.push(`state|${entry.name}=${stateStamps.join(",")}`);
-    }
-  }
-  return parts.join("|");
-}
+function fingerprint(teamHome: string): string {}
 
 async function reduceCached(teamHome: string): Promise<CacheEntry> {
killedBy: GET /api/xiaozhuge/team/overview 团队实例投影：成员表 + 房间计数 + 尾部事件摘要（payload 不出投影面）
statusReason: expected 500 to be 200 // Object.is equality

[Killed] BlockStatement
src/plugin/team-overview.ts:112:31
 function fingerprint(teamHome: string): string {
   const l = layout(teamHome);
   const parts = [fileStamp(l.agentsJson)];
-  if (existsSync(l.roomsDir)) {
-    for (const entry of readdirSync(l.roomsDir, { withFileTypes: true })) {
-      if (!entry.isDirectory()) continue;
-      const roomDir = join(l.roomsDir, entry.name);
-      parts.push(`events|${entry.name}=${fileStamp(join(roomDir, "events.jsonl"))}`);
-      // Q3（#164）：分片保留态参与 tone 权威，分片单独变化必须翻转缓存。
-      const stateDir = join(roomDir, "state");
-      let stateStamps: string[] = [];
-      if (existsSync(stateDir)) {
-        stateStamps = readdirSync(stateDir)
-          .sort()
-          .map((s) => `${s}=${fileStamp(join(stateDir, s))}`);
-      }
-      parts.push(`state|${entry.name}=${stateStamps.join(",")}`);
-    }
-  }
+  if (existsSync(l.roomsDir)) {}
   return parts.join("|");
 }
killedBy: GET /api/xiaozhuge/team/overview stat 快路径 + ETag/304 + single-flight：输入未变时重复轮询返回一致投影与 304
statusReason: expected 'blackboard/set' to be 'task/create' // Object.is equality

[Killed] BlockStatement
src/plugin/team-overview.ts:113:75
   const l = layout(teamHome);
   const parts = [fileStamp(l.agentsJson)];
   if (existsSync(l.roomsDir)) {
-    for (const entry of readdirSync(l.roomsDir, { withFileTypes: true })) {
-      if (!entry.isDirectory()) continue;
-      const roomDir = join(l.roomsDir, entry.name);
-      parts.push(`events|${entry.name}=${fileStamp(join(roomDir, "events.jsonl"))}`);
-      // Q3（#164）：分片保留态参与 tone 权威，分片单独变化必须翻转缓存。
-      const stateDir = join(roomDir, "state");
-      let stateStamps: string[] = [];
-      if (existsSync(stateDir)) {
-        stateStamps = readdirSync(stateDir)
-          .sort()
-          .map((s) => `${s}=${fileStamp(join(stateDir, s))}`);
-      }
-      parts.push(`state|${entry.name}=${stateStamps.join(",")}`);
-    }
+    for (const entry of readdirSync(l.roomsDir, { withFileTypes: true })) {}
   }
   return parts.join("|");
killedBy: GET /api/xiaozhuge/team/overview stat 快路径 + ETag/304 + single-flight：输入未变时重复轮询返回一致投影与 304
statusReason: expected 'blackboard/set' to be 'task/create' // Object.is equality

[Killed] StringLiteral
src/plugin/team-overview.ts:116:66
     for (const entry of readdirSync(l.roomsDir, { withFileTypes: true })) {
       if (!entry.isDirectory()) continue;
       const roomDir = join(l.roomsDir, entry.name);
-      parts.push(`events|${entry.name}=${fileStamp(join(roomDir, "events.jsonl"))}`);
+      parts.push(`events|${entry.name}=${fileStamp(join(roomDir, ""))}`);
       // Q3（#164）：分片保留态参与 tone 权威，分片单独变化必须翻转缓存。
       const stateDir = join(roomDir, "state");
killedBy: GET /api/xiaozhuge/team/overview stat 快路径 + ETag/304 + single-flight：输入未变时重复轮询返回一致投影与 304
statusReason: expected 'blackboard/set' to be 'task/create' // Object.is equality

[Survived] ConditionalExpression
src/plugin/team-overview.ts:120:11
       // Q3（#164）：分片保留态参与 tone 权威，分片单独变化必须翻转缓存。
       const stateDir = join(roomDir, "state");
       let stateStamps: string[] = [];
-      if (existsSync(stateDir)) {
+      if (false) {
         stateStamps = readdirSync(stateDir)
           .sort()

[Survived] BlockStatement
src/plugin/team-overview.ts:120:33
       // Q3（#164）：分片保留态参与 tone 权威，分片单独变化必须翻转缓存。
       const stateDir = join(roomDir, "state");
       let stateStamps: string[] = [];
-      if (existsSync(stateDir)) {
-        stateStamps = readdirSync(stateDir)
-          .sort()
-          .map((s) => `${s}=${fileStamp(join(stateDir, s))}`);
-      }
+      if (existsSync(stateDir)) {}
       parts.push(`state|${entry.name}=${stateStamps.join(",")}`);
     }

[Survived] MethodExpression
src/plugin/team-overview.ts:121:23
       const stateDir = join(roomDir, "state");
       let stateStamps: string[] = [];
       if (existsSync(stateDir)) {
-        stateStamps = readdirSync(stateDir)
-          .sort()
+        stateStamps = readdirSync(stateDir)
           .map((s) => `${s}=${fileStamp(join(stateDir, s))}`);
       }

[Survived] ArrowFunction
src/plugin/team-overview.ts:123:16
       if (existsSync(stateDir)) {
         stateStamps = readdirSync(stateDir)
           .sort()
-          .map((s) => `${s}=${fileStamp(join(stateDir, s))}`);
+          .map(() => undefined);
       }
       parts.push(`state|${entry.name}=${stateStamps.join(",")}`);

[Survived] StringLiteral
src/plugin/team-overview.ts:123:23
       if (existsSync(stateDir)) {
         stateStamps = readdirSync(stateDir)
           .sort()
-          .map((s) => `${s}=${fileStamp(join(stateDir, s))}`);
+          .map((s) => ``);
       }
       parts.push(`state|${entry.name}=${stateStamps.join(",")}`);

[Survived] StringLiteral
src/plugin/team-overview.ts:125:18
           .sort()
           .map((s) => `${s}=${fileStamp(join(stateDir, s))}`);
       }
-      parts.push(`state|${entry.name}=${stateStamps.join(",")}`);
+      parts.push(``);
     }
   }

[Survived] StringLiteral
src/plugin/team-overview.ts:128:21
       parts.push(`state|${entry.name}=${stateStamps.join(",")}`);
     }
   }
-  return parts.join("|");
+  return parts.join("");
 }
 

[Killed] EqualityOperator
src/plugin/team-overview.ts:134:31
 async function reduceCached(teamHome: string): Promise<CacheEntry> {
   const fp = fingerprint(teamHome);
   const cached = overviewCache.get(teamHome);
-  if (cached !== undefined && cached.etag === fp) return cached;
+  if (cached !== undefined && cached.etag !== fp) return cached;
   const body = await buildOverview(teamHome);
   const fresh: CacheEntry = { etag: fp, body };
killedBy: GET /api/xiaozhuge/team/overview stat 快路径 + ETag/304 + single-flight：输入未变时重复轮询返回一致投影与 304
statusReason: expected 'blackboard/set' to be 'task/create' // Object.is equality

[Killed] EqualityOperator
src/plugin/team-overview.ts:134:7
 async function reduceCached(teamHome: string): Promise<CacheEntry> {
   const fp = fingerprint(teamHome);
   const cached = overviewCache.get(teamHome);
-  if (cached !== undefined && cached.etag === fp) return cached;
+  if (cached === undefined && cached.etag === fp) return cached;
   const body = await buildOverview(teamHome);
   const fresh: CacheEntry = { etag: fp, body };
killedBy: GET /api/xiaozhuge/team/overview 团队实例投影：成员表 + 房间计数 + 尾部事件摘要（payload 不出投影面）
statusReason: expected 500 to be 200 // Object.is equality

[NoCoverage] BlockStatement
src/plugin/team-overview.ts:137:42
   if (cached !== undefined && cached.etag === fp) return cached;
   const body = await buildOverview(teamHome);
   const fresh: CacheEntry = { etag: fp, body };
-  if (overviewCache.size >= CACHE_LIMIT) {
-    const oldest = overviewCache.keys().next().value;
-    if (oldest !== undefined) overviewCache.delete(oldest);
-  }
+  if (overviewCache.size >= CACHE_LIMIT) {}
   overviewCache.set(teamHome, fresh);
   return fresh;

[Survived] EqualityOperator
src/plugin/team-overview.ts:137:7
   if (cached !== undefined && cached.etag === fp) return cached;
   const body = await buildOverview(teamHome);
   const fresh: CacheEntry = { etag: fp, body };
-  if (overviewCache.size >= CACHE_LIMIT) {
+  if (overviewCache.size > CACHE_LIMIT) {
     const oldest = overviewCache.keys().next().value;
     if (oldest !== undefined) overviewCache.delete(oldest);

[NoCoverage] ConditionalExpression
src/plugin/team-overview.ts:139:9
   const fresh: CacheEntry = { etag: fp, body };
   if (overviewCache.size >= CACHE_LIMIT) {
     const oldest = overviewCache.keys().next().value;
-    if (oldest !== undefined) overviewCache.delete(oldest);
+    if (false) overviewCache.delete(oldest);
   }
   overviewCache.set(teamHome, fresh);

[Survived] ObjectLiteral
src/plugin/team-overview.ts:161:29
     path: ROUTES_OVERVIEW,
     handler: async (req: IncomingMessage, res: ServerResponse) => {
       if (req.method !== "GET") {
-        writeJson(res, 405, { error: "method not allowed" });
+        writeJson(res, 405, {});
         return;
       }

[Killed] ConditionalExpression
src/plugin/team-overview.ts:166:11
       }
       const url = new URL(req.url ?? "/", "http://localhost");
       const sessionId = url.searchParams.get("session");
-      if (!sessionId || !SESSION_PATTERN.test(sessionId)) {
+      if (true) {
         writeJson(res, 400, { error: "invalid session parameter" });
         return;
killedBy: GET /api/xiaozhuge/team/overview 实例根未初始化（team.yaml 不在场）→ is_team 短路 false
statusReason: expected 400 to be 200 // Object.is equality

[Killed] EqualityOperator
src/plugin/team-overview.ts:179:13
       try {
         const { etag, body } = await reduceOnce(teamHome);
         const clientEtag = req.headers["if-none-match"];
-        if (clientEtag === etag) {
+        if (clientEtag !== etag) {
           res.writeHead(304, { etag });
           res.end();
killedBy: GET /api/xiaozhuge/team/overview 团队实例投影：成员表 + 房间计数 + 尾部事件摘要（payload 不出投影面）
statusReason: expected 304 to be 200 // Object.is equality

[Survived] StringLiteral
src/plugin/team-overview.ts:184:46
           res.end();
           return;
         }
-        res.writeHead(200, { "content-type": "application/json; charset=utf-8", etag });
+        res.writeHead(200, { "content-type": "", etag });
         res.end(JSON.stringify(body));
       } catch (error) {
