[Timeout] StringLiteral
src/plugin/tool-manifest.ts:19:18
 
 /** 本插件注册的 team_* 工具自述（名称 → 一句话用途；与 host.ts 注册面一致）。 */
 export const TEAM_TOOL_MANIFEST: ReadonlyArray<readonly [string, string]> = [
-  ["team_spawn", "Register member durable ID in registry"],
+  ["team_spawn", ""],
   ["team_dispatch", "Atomic dispatch primitive: register, assign, and deliver envelope"],
   ["team_send", "Direct mailbox delivery with reachability annotation"],

[Killed] ArrayDeclaration
src/plugin/tool-manifest.ts:20:3
 /** 本插件注册的 team_* 工具自述（名称 → 一句话用途；与 host.ts 注册面一致）。 */
 export const TEAM_TOOL_MANIFEST: ReadonlyArray<readonly [string, string]> = [
   ["team_spawn", "Register member durable ID in registry"],
-  ["team_dispatch", "Atomic dispatch primitive: register, assign, and deliver envelope"],
+  [],
   ["team_send", "Direct mailbox delivery with reachability annotation"],
   ["team_inbox", "Read unread envelopes or claim specific envelope"],
killedBy: tool manifest 保留段 清单与运行时实际注册的 team_* 工具名互锁（防漂移）
statusReason: expected [ 'team_ack', 'team_handoff', …(10) ] to deeply equal [ 'team_ack', 'team_dispatch', …(10) ]

[Killed] StringLiteral
src/plugin/tool-manifest.ts:20:4
 /** 本插件注册的 team_* 工具自述（名称 → 一句话用途；与 host.ts 注册面一致）。 */
 export const TEAM_TOOL_MANIFEST: ReadonlyArray<readonly [string, string]> = [
   ["team_spawn", "Register member durable ID in registry"],
-  ["team_dispatch", "Atomic dispatch primitive: register, assign, and deliver envelope"],
+  ["", "Atomic dispatch primitive: register, assign, and deliver envelope"],
   ["team_send", "Direct mailbox delivery with reachability annotation"],
   ["team_inbox", "Read unread envelopes or claim specific envelope"],
killedBy: tool manifest 保留段 清单与运行时实际注册的 team_* 工具名互锁（防漂移）
statusReason: expected [ '', 'team_ack', …(10) ] to deeply equal [ 'team_ack', 'team_dispatch', …(10) ]

[Killed] StringLiteral
src/plugin/tool-manifest.ts:21:4
 export const TEAM_TOOL_MANIFEST: ReadonlyArray<readonly [string, string]> = [
   ["team_spawn", "Register member durable ID in registry"],
   ["team_dispatch", "Atomic dispatch primitive: register, assign, and deliver envelope"],
-  ["team_send", "Direct mailbox delivery with reachability annotation"],
+  ["", "Direct mailbox delivery with reachability annotation"],
   ["team_inbox", "Read unread envelopes or claim specific envelope"],
   ["team_ack", "Acknowledge and archive processed envelope"],
killedBy: tool manifest 保留段 清单与运行时实际注册的 team_* 工具名互锁（防漂移）
statusReason: expected [ '', 'team_ack', …(10) ] to deeply equal [ 'team_ack', 'team_dispatch', …(10) ]

[Timeout] StringLiteral
src/plugin/tool-manifest.ts:21:17
 export const TEAM_TOOL_MANIFEST: ReadonlyArray<readonly [string, string]> = [
   ["team_spawn", "Register member durable ID in registry"],
   ["team_dispatch", "Atomic dispatch primitive: register, assign, and deliver envelope"],
-  ["team_send", "Direct mailbox delivery with reachability annotation"],
+  ["team_send", ""],
   ["team_inbox", "Read unread envelopes or claim specific envelope"],
   ["team_ack", "Acknowledge and archive processed envelope"],

[Timeout] ArrayDeclaration
src/plugin/tool-manifest.ts:23:3
   ["team_dispatch", "Atomic dispatch primitive: register, assign, and deliver envelope"],
   ["team_send", "Direct mailbox delivery with reachability annotation"],
   ["team_inbox", "Read unread envelopes or claim specific envelope"],
-  ["team_ack", "Acknowledge and archive processed envelope"],
+  [],
   ["team_task_create", "Create task in shared ledger with mutex check"],
   ["team_task_update", "Transition task status machine or reassign"],

[Timeout] StringLiteral
src/plugin/tool-manifest.ts:26:4
   ["team_ack", "Acknowledge and archive processed envelope"],
   ["team_task_create", "Create task in shared ledger with mutex check"],
   ["team_task_update", "Transition task status machine or reassign"],
-  ["team_task_list", "Query task ledger snapshot"],
+  ["", "Query task ledger snapshot"],
   ["team_state_get", "Read blackboard shards for a room"],
   ["team_state_set", "Write blackboard shard (running|blocked|done)"],

[Timeout] StringLiteral
src/plugin/tool-manifest.ts:27:22
   ["team_task_create", "Create task in shared ledger with mutex check"],
   ["team_task_update", "Transition task status machine or reassign"],
   ["team_task_list", "Query task ledger snapshot"],
-  ["team_state_get", "Read blackboard shards for a room"],
+  ["team_state_get", ""],
   ["team_state_set", "Write blackboard shard (running|blocked|done)"],
   ["team_reconcile", "Unified reconciliation view: members, tasks, cursors, mutexes"],

[Timeout] StringLiteral
src/plugin/tool-manifest.ts:27:4
   ["team_task_create", "Create task in shared ledger with mutex check"],
   ["team_task_update", "Transition task status machine or reassign"],
   ["team_task_list", "Query task ledger snapshot"],
-  ["team_state_get", "Read blackboard shards for a room"],
+  ["", "Read blackboard shards for a room"],
   ["team_state_set", "Write blackboard shard (running|blocked|done)"],
   ["team_reconcile", "Unified reconciliation view: members, tasks, cursors, mutexes"],

[Timeout] StringLiteral
src/plugin/tool-manifest.ts:28:22
   ["team_task_update", "Transition task status machine or reassign"],
   ["team_task_list", "Query task ledger snapshot"],
   ["team_state_get", "Read blackboard shards for a room"],
-  ["team_state_set", "Write blackboard shard (running|blocked|done)"],
+  ["team_state_set", ""],
   ["team_reconcile", "Unified reconciliation view: members, tasks, cursors, mutexes"],
   ["team_handoff", "Explicit task handoff with DoD receipt verification"],

[Timeout] ArrayDeclaration
src/plugin/tool-manifest.ts:28:3
   ["team_task_update", "Transition task status machine or reassign"],
   ["team_task_list", "Query task ledger snapshot"],
   ["team_state_get", "Read blackboard shards for a room"],
-  ["team_state_set", "Write blackboard shard (running|blocked|done)"],
+  [],
   ["team_reconcile", "Unified reconciliation view: members, tasks, cursors, mutexes"],
   ["team_handoff", "Explicit task handoff with DoD receipt verification"],

[Timeout] StringLiteral
src/plugin/tool-manifest.ts:29:22
   ["team_task_list", "Query task ledger snapshot"],
   ["team_state_get", "Read blackboard shards for a room"],
   ["team_state_set", "Write blackboard shard (running|blocked|done)"],
-  ["team_reconcile", "Unified reconciliation view: members, tasks, cursors, mutexes"],
+  ["team_reconcile", ""],
   ["team_handoff", "Explicit task handoff with DoD receipt verification"],
 ];

[Timeout] StringLiteral
src/plugin/tool-manifest.ts:29:4
   ["team_task_list", "Query task ledger snapshot"],
   ["team_state_get", "Read blackboard shards for a room"],
   ["team_state_set", "Write blackboard shard (running|blocked|done)"],
-  ["team_reconcile", "Unified reconciliation view: members, tasks, cursors, mutexes"],
+  ["", "Unified reconciliation view: members, tasks, cursors, mutexes"],
   ["team_handoff", "Explicit task handoff with DoD receipt verification"],
 ];

[Survived] StringLiteral
src/plugin/tool-manifest.ts:30:20
   ["team_state_get", "Read blackboard shards for a room"],
   ["team_state_set", "Write blackboard shard (running|blocked|done)"],
   ["team_reconcile", "Unified reconciliation view: members, tasks, cursors, mutexes"],
-  ["team_handoff", "Explicit task handoff with DoD receipt verification"],
+  ["team_handoff", ""],
 ];
 

[Killed] BlockStatement
src/plugin/tool-manifest.ts:34:44
 ];
 
 /** 生成完整保留段文本（不含前导分隔符，调用方拼接）。 */
-export function toolManifestText(): string {
-  const lines: string[] = [
-    "The following framework tool manifest is generated for navigation guidance only.",
-    "Tool availability is determined strictly by runtime registration for the current turn.",
-    "This list is informational; never infer that an unlisted tool does not exist.",
-    "",
-    "Framework-registered team_* tools:",
-    ...TEAM_TOOL_MANIFEST.map(([name, desc]) => `- ${name}: ${desc}`),
-    "",
-    "Blindspot disclaimer: Host capabilities (goal management, subagent spawn/wake, MCP, shell, fs) are outside this manifest; verify their presence via system prompt and current runtime tools.",
-    "Always run team_reconcile first for startup reconciliation: returns member cross-view, task snapshot, and event cursors in a single call.",
-  ];
-  return lines.join("\n");
-}
+export function toolManifestText(): string {}
 
 /** tier0_prompt 组装后追加保留段（幂等：重复追加拒绝，防双份清单漂移）。 */
killedBy: tool manifest 保留段 保留段含导航声明、盲区声明与逐项清单（ADR 0023 英文重构）
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] StringLiteral
src/plugin/tool-manifest.ts:36:5
 /** 生成完整保留段文本（不含前导分隔符，调用方拼接）。 */
 export function toolManifestText(): string {
   const lines: string[] = [
-    "The following framework tool manifest is generated for navigation guidance only.",
+    "",
     "Tool availability is determined strictly by runtime registration for the current turn.",
     "This list is informational; never infer that an unlisted tool does not exist.",
killedBy: tool manifest 保留段 保留段含导航声明、盲区声明与逐项清单（ADR 0023 英文重构）
statusReason: expected '\nTool availability is determined str…' to contain 'navigation guidance only'

[Survived] StringLiteral
src/plugin/tool-manifest.ts:37:5
 export function toolManifestText(): string {
   const lines: string[] = [
     "The following framework tool manifest is generated for navigation guidance only.",
-    "Tool availability is determined strictly by runtime registration for the current turn.",
+    "",
     "This list is informational; never infer that an unlisted tool does not exist.",
     "",

[Killed] StringLiteral
src/plugin/tool-manifest.ts:38:5
   const lines: string[] = [
     "The following framework tool manifest is generated for navigation guidance only.",
     "Tool availability is determined strictly by runtime registration for the current turn.",
-    "This list is informational; never infer that an unlisted tool does not exist.",
+    "",
     "",
     "Framework-registered team_* tools:",
killedBy: tool manifest 保留段 保留段含导航声明、盲区声明与逐项清单（ADR 0023 英文重构）
statusReason: expected 'The following framework tool manifest…' to contain 'never infer that an unlisted tool doe…'

[Survived] StringLiteral
src/plugin/tool-manifest.ts:40:5
     "Tool availability is determined strictly by runtime registration for the current turn.",
     "This list is informational; never infer that an unlisted tool does not exist.",
     "",
-    "Framework-registered team_* tools:",
+    "",
     ...TEAM_TOOL_MANIFEST.map(([name, desc]) => `- ${name}: ${desc}`),
     "",

[Killed] ArrowFunction
src/plugin/tool-manifest.ts:41:31
     "This list is informational; never infer that an unlisted tool does not exist.",
     "",
     "Framework-registered team_* tools:",
-    ...TEAM_TOOL_MANIFEST.map(([name, desc]) => `- ${name}: ${desc}`),
+    ...TEAM_TOOL_MANIFEST.map(() => undefined),
     "",
     "Blindspot disclaimer: Host capabilities (goal management, subagent spawn/wake, MCP, shell, fs) are outside this manifest; verify their presence via system prompt and current runtime tools.",
killedBy: tool manifest 保留段 保留段含导航声明、盲区声明与逐项清单（ADR 0023 英文重构）
statusReason: expected 'The following framework tool manifest…' to contain '- team_spawn: Register member durable…'

[Killed] StringLiteral
src/plugin/tool-manifest.ts:43:5
     "Framework-registered team_* tools:",
     ...TEAM_TOOL_MANIFEST.map(([name, desc]) => `- ${name}: ${desc}`),
     "",
-    "Blindspot disclaimer: Host capabilities (goal management, subagent spawn/wake, MCP, shell, fs) are outside this manifest; verify their presence via system prompt and current runtime tools.",
+    "",
     "Always run team_reconcile first for startup reconciliation: returns member cross-view, task snapshot, and event cursors in a single call.",
   ];
killedBy: tool manifest 保留段 保留段含导航声明、盲区声明与逐项清单（ADR 0023 英文重构）
statusReason: expected 'The following framework tool manifest…' to contain 'Blindspot disclaimer'
