[Killed] ObjectLiteral
src/runtime/template/template-loader.ts:147:10
   playbookDigest?: string,
   workspace?: string,
 ): Record<string, unknown> {
-  return {
-    name: loaded.template.name,
-    version: loaded.template.version,
-    source: loaded.source,
-    digest: loaded.digest,
-    // Tier-0 规程摘要（#42）：仅审计字段；旧快照无此字段按缺省容忍（只增不改）。
-    playbook_digest: playbookDigest ?? null,
-    // 工作区持久化（ADR 0015）：audit 子命令的扫描根来源；旧快照无此字段为 null。
-    workspace: workspace ?? null,
-    // 通讯模式与 explicit 白名单（#138）：运行时可达性判定的载体；旧快照无
-    // 此字段按缺省容忍（只增不改）——读取侧以 `comm_mode ?? "auto"` 归一。
-    comm_mode: loaded.template.comm_mode ?? "auto",
-    comm: Array.isArray(loaded.template.comm) ? loaded.template.comm : [],
-    tiers: loaded.template.tiers,
-    roles: Object.values(loaded.roles).map((r) => ({
-      id: r.id,
-      prompt_inlined: loaded.prompts[String(r.prompt)] ?? null,
-      briefing: r.briefing ?? null,
-      dod: r.dod ?? [],
-      max_hops: r.max_hops ?? 3,
-      as_judge: r.as_judge === true,
-    })),
-    instantiated_at: Date.now(),
-  };
+  return {};
 }
 
killedBy: team_reconcile overview 一次调用返回快照摘要、成员对照、状态分布、事件游标与 goal 占位
statusReason: expected null to be 'builtin' // Object.is equality

[Survived] ConditionalExpression
src/runtime/template/template-loader.ts:167:17
       briefing: r.briefing ?? null,
       dod: r.dod ?? [],
       max_hops: r.max_hops ?? 3,
-      as_judge: r.as_judge === true,
+      as_judge: true,
     })),
     instantiated_at: Date.now(),

[Killed] StringLiteral
src/runtime/template/template-loader.ts:175:41
 
 /** 便捷：包内置只读模板目录（builtin 来源）。 */
 export function builtinScenarioDir(packageRoot: string): string {
-  return join(packageRoot, "templates", "oss-maintenance");
+  return join(packageRoot, "templates", "");
 }
 
killedBy: 加载器拒绝语义 内置场景目录解析指向 templates/oss-maintenance
statusReason: expected '/pkg/root/templates' to be '/pkg/root/templates/oss-maintenance' // Object.is equality

[Killed] StringLiteral
src/runtime/template/template-loader.ts:192:37
 export function loadTier0Playbook(packageRoot: string): Tier0Playbook {
   const path = join(packageRoot, PLAYBOOKS_DIR, TIER0_PLAYBOOK_FILE);
   const text = readFileSync(path, "utf8");
-  return { text, digest: createHash("sha256").update(text).digest("hex").slice(0, 16) };
+  return { text, digest: createHash("").update(text).digest("hex").slice(0, 16) };
 }
 
killedBy: team_reconcile overview 一次调用返回快照摘要、成员对照、状态分布、事件游标与 goal 占位
statusReason: Digest method not supported

[Killed] StringLiteral
src/runtime/template/template-loader.ts:205:28
 
 /** 包内模板根目录（builtin 场景白名单根，#51 入口承载场景选择）。 */
 export function builtinTemplatesRoot(packageRoot: string): string {
-  return join(packageRoot, "templates");
+  return join(packageRoot, "");
 }
 
killedBy: team_dispatch 正常链路 spawn→assign→send 三步全成，注册表/账本/信箱/事件流逐项核对
statusReason: unknown-scenario: no template "oss-maintenance"

[Killed] Regex
src/runtime/template/template-loader.ts:211:33
 /** 缺省场景名（入口/工具未指定时）。 */
 export const DEFAULT_SCENARIO = "oss-maintenance";
 /** 场景名安全形态：防路径拼接；目录存在性另行校验。 */
-export const SCENARIO_PATTERN = /^[a-z0-9-]+$/;
+export const SCENARIO_PATTERN = /^[^a-z0-9-]+$/;
 
 /**
killedBy: team_dispatch 正常链路 spawn→assign→send 三步全成，注册表/账本/信箱/事件流逐项核对
statusReason: unknown-scenario: invalid scenario name "oss-maintenance"

[Survived] Regex
src/runtime/template/template-loader.ts:211:33
 /** 缺省场景名（入口/工具未指定时）。 */
 export const DEFAULT_SCENARIO = "oss-maintenance";
 /** 场景名安全形态：防路径拼接；目录存在性另行校验。 */
-export const SCENARIO_PATTERN = /^[a-z0-9-]+$/;
+export const SCENARIO_PATTERN = /[a-z0-9-]+$/;
 
 /**

[Killed] StringLiteral
src/runtime/template/template-loader.ts:246:21
   requestedSource?: TemplateSource,
 ): { dir: string; source: TemplateSource } {
   if (!SCENARIO_PATTERN.test(scenario)) {
-    throw new Error(`unknown-scenario: invalid scenario name "${scenario}"`);
+    throw new Error(``);
   }
   const matches: Array<{ dir: string; source: TemplateSource }> = [];
killedBy: 三级来源解析（ADR 0013） 场景名白名单三级统一执行：非法名即拒（含穿越形态）
statusReason: ../escape: expected [Function] to throw error matching /unknown-scenario/ but got ''

[Killed] ConditionalExpression
src/runtime/template/template-loader.ts:250:9
   }
   const matches: Array<{ dir: string; source: TemplateSource }> = [];
   for (const root of roots) {
-    if (requestedSource !== undefined && root.source !== requestedSource) continue;
+    if (true) continue;
     if (existsSync(join(root.dir, scenario, TEAM_FILE))) {
       matches.push({ dir: join(root.dir, scenario), source: root.source });
killedBy: team/create 一键建团 默认场景：init 持久化 + tier0_prompt 组装 + 快照落盘
statusReason: expected 400 to be 200 // Object.is equality

[Killed] ConditionalExpression
src/runtime/template/template-loader.ts:250:9
   }
   const matches: Array<{ dir: string; source: TemplateSource }> = [];
   for (const root of roots) {
-    if (requestedSource !== undefined && root.source !== requestedSource) continue;
+    if (true && root.source !== requestedSource) continue;
     if (existsSync(join(root.dir, scenario, TEAM_FILE))) {
       matches.push({ dir: join(root.dir, scenario), source: root.source });
killedBy: team/create 一键建团 默认场景：init 持久化 + tier0_prompt 组装 + 快照落盘
statusReason: expected 400 to be 200 // Object.is equality

[Killed] EqualityOperator
src/runtime/template/template-loader.ts:256:9
     }
   }
   if (requestedSource !== undefined) {
-    if (matches.length === 0) {
+    if (matches.length !== 0) {
       throw new Error(`unknown-scenario: no ${requestedSource} template "${scenario}"`);
     }
killedBy: 三级来源解析（ADR 0013） 指定 source 消歧：命中该层；该层缺失 → unknown-scenario
statusReason: unknown-scenario: no user template "dup"

[Killed] ConditionalExpression
src/runtime/template/template-loader.ts:261:7
     }
     return matches[0]!;
   }
-  if (matches.length === 0) {
+  if (false) {
     throw new Error(`unknown-scenario: no template "${scenario}"`);
   }
killedBy: 三级来源解析（ADR 0013） 不存在的场景 → unknown-scenario
statusReason: expected [Function] to throw an error

[Killed] StringLiteral
src/runtime/template/template-loader.ts:266:21
   }
   if (matches.length > 1) {
     const sources = matches.map((m) => m.source).join(",");
-    throw new Error(`ambiguous-scenario: "${scenario}" exists in multiple sources (${sources})`);
+    throw new Error(``);
   }
   return matches[0]!;
killedBy: 三级来源解析（ADR 0013） 同名未指定 source → ambiguous-scenario（绝不静默择一）
statusReason: expected [Function] to throw error matching /ambiguous-scenario: "dup"/ but got ''

[Killed] ArrayDeclaration
src/runtime/template/template-loader.ts:307:24
 
 /** 枚举包内全部合法场景名（有 team.yaml 的一级子目录，实时扫描无缓存）。 */
 export function listBuiltinScenarios(packageRoot: string): string[] {
-  return listScenarios([{ source: "builtin", dir: builtinTemplatesRoot(packageRoot) }]).map(
+  return listScenarios([]).map(
     (e) => e.name,
   );
killedBy: 向后兼容性（resolveBuiltinScenarioDir / listBuiltinScenarios） listBuiltinScenarios 仍可枚举 builtin 场景名
statusReason: expected [] to include 'oss-maintenance'

[Killed] ObjectLiteral
src/runtime/template/template-loader.ts:307:25
 
 /** 枚举包内全部合法场景名（有 team.yaml 的一级子目录，实时扫描无缓存）。 */
 export function listBuiltinScenarios(packageRoot: string): string[] {
-  return listScenarios([{ source: "builtin", dir: builtinTemplatesRoot(packageRoot) }]).map(
+  return listScenarios([{}]).map(
     (e) => e.name,
   );
killedBy: 向后兼容性（resolveBuiltinScenarioDir / listBuiltinScenarios） listBuiltinScenarios 仍可枚举 builtin 场景名
statusReason: expected [] to include 'oss-maintenance'
