[Killed] LogicalOperator
src/runtime/view/detail.ts:225:16
     rounds: t.rounds,
     // P0-2（PR-D，#169）：maxRounds 旧数据落盘 0 视为未设限 → 归一为 null
     //（0/负/null/undefined 一律不展示上限，与 ledger.update maxRounds>0 判据一致）。
-    maxRounds: t.maxRounds !== null && t.maxRounds !== undefined && t.maxRounds > 0 ? t.maxRounds : null,
+    maxRounds: t.maxRounds !== null && t.maxRounds !== undefined || t.maxRounds > 0 ? t.maxRounds : null,
     touched: [...t.touched],
     rev: t.rev,
killedBy: T2 保守投影：缺省字段 → null maxRounds=0 视为未设上限 → 归一为 null（PR-D #169：旧数据 0 落盘，读侧归一）
statusReason: expected { id: 'task-1', title: '样例任务', …(10) } to match object { assignee: 'qa', …(2) }
(9 matching properties omitted from actual)

[Killed] ConditionalExpression
src/runtime/view/detail.ts:225:16
     rounds: t.rounds,
     // P0-2（PR-D，#169）：maxRounds 旧数据落盘 0 视为未设限 → 归一为 null
     //（0/负/null/undefined 一律不展示上限，与 ledger.update maxRounds>0 判据一致）。
-    maxRounds: t.maxRounds !== null && t.maxRounds !== undefined && t.maxRounds > 0 ? t.maxRounds : null,
+    maxRounds: false ? t.maxRounds : null,
     touched: [...t.touched],
     rev: t.rev,
killedBy: T2 保守投影：缺省字段 → null maxRounds>0 如实投影（设限任务保留上限）
statusReason: expected null to be 3 // Object.is equality

[Killed] ArithmeticOperator
src/runtime/view/detail.ts:236:10
 
 /** updatedAt desc 排序，同值以 id asc 稳定 tiebreak（uuid 纯 ASCII，字典序确定）。 */
 function byUpdatedAtDesc(a: TaskLedgerView, b: TaskLedgerView): number {
-  return b.updatedAt - a.updatedAt || (a.id < b.id ? -1 : a.id > b.id ? 1 : 0);
+  return b.updatedAt + a.updatedAt || (a.id < b.id ? -1 : a.id > b.id ? 1 : 0);
 }
 
killedBy: T3 任务排序确定性 按 updatedAt desc；同值按 id asc 稳定 tiebreak
statusReason: expected [ 'task-b', 'task-a', 'task-z' ] to deeply equal [ 'task-z', 'task-a', 'task-b' ]

[Killed] ArrayDeclaration
src/runtime/view/detail.ts:246:18
 function sortAndCapEnvelopes(
   mailboxes: readonly MailboxHeadView[],
 ): MailboxHeadView[] {
-  const sorted = [...mailboxes].sort(
+  const sorted = [].sort(
     (a, b) => b.createdAt - a.createdAt || (a.id < b.id ? -1 : a.id > b.id ? 1 : 0),
   );
killedBy: GET /api/xiaozhuge/team/detail T14: happy path——全字段形状 + stale/awaiting 划分正确
statusReason: expected [] to deeply equal [ …(2) ]

[Killed] UnaryOperator
src/runtime/view/detail.ts:247:59
   mailboxes: readonly MailboxHeadView[],
 ): MailboxHeadView[] {
   const sorted = [...mailboxes].sort(
-    (a, b) => b.createdAt - a.createdAt || (a.id < b.id ? -1 : a.id > b.id ? 1 : 0),
+    (a, b) => b.createdAt - a.createdAt || (a.id < b.id ? +1 : a.id > b.id ? 1 : 0),
   );
   const seen = new Map<string, number>();
killedBy: GET /api/xiaozhuge/team/detail T14: happy path——全字段形状 + stale/awaiting 划分正确
statusReason: expected [ …(2) ] to deeply equal [ …(2) ]

[Killed] ObjectLiteral
src/runtime/view/detail.ts:254:40
   for (const head of sorted) {
     // 显式重建对象而非透传引用：即使未来入参意外携带 body 等多余字段，
     // 输出形状也始终锁定八键白名单（防御性拷贝纪律的最后防线）。
-    const projected: MailboxHeadView = {
-      id: head.id,
-      to: head.to,
-      from: head.from,
-      type: head.type,
-      state: head.state,
-      createdAt: head.createdAt,
-      summary: head.summary ?? null,
-    };
+    const projected: MailboxHeadView = {};
     const bucket = `${head.to}\u0000${head.state}`;
     const count = seen.get(bucket) ?? 0;
killedBy: GET /api/xiaozhuge/team/detail T14: happy path——全字段形状 + stale/awaiting 划分正确
statusReason: expected [ {}, {} ] to deeply equal [ …(2) ]

[Killed] ConditionalExpression
src/runtime/view/detail.ts:265:9
     };
     const bucket = `${head.to}\u0000${head.state}`;
     const count = seen.get(bucket) ?? 0;
-    if (count >= MAILBOX_PER_STATE_LIMIT) continue;
+    if (false) continue;
     seen.set(bucket, count + 1);
     kept.push(projected);
killedBy: T7 信封排序与公平截断 每成员每 state 截至最新 5 条
statusReason: expected [ 'e7', 'e6', 'e5', 'e4', 'e3', …(3) ] to deeply equal [ 'e7', 'e6', 'e5', 'e4', 'e3' ]

[Killed] ConditionalExpression
src/runtime/view/detail.ts:274:7
 
 /** 从分片 ext 提取 current_activity（非空字符串才认可；机械取值零生成；其余 ext 键一律不透传）。 */
 function currentActivityFromExt(ext: unknown): string | null {
-  if (ext !== null && typeof ext === "object") {
+  if (true) {
     const v = (ext as { current_activity?: unknown }).current_activity;
     if (typeof v === "string" && v.length > 0) return v;
killedBy: T8 分片 ext 白名单 ext 缺失 / current_activity 非字符串 / 空串 / ext 为原始值 → currentActivity 均为 null
statusReason: Cannot read properties of undefined (reading 'current_activity')

[Killed] ConditionalExpression
src/runtime/view/detail.ts:274:7
 
 /** 从分片 ext 提取 current_activity（非空字符串才认可；机械取值零生成；其余 ext 键一律不透传）。 */
 function currentActivityFromExt(ext: unknown): string | null {
-  if (ext !== null && typeof ext === "object") {
+  if (false) {
     const v = (ext as { current_activity?: unknown }).current_activity;
     if (typeof v === "string" && v.length > 0) return v;
killedBy: T8 分片 ext 白名单 current_activity 单键提取；其余 ext 键不泄漏（负向断言）
statusReason: expected { room: 'root', role: 'coder', …(3) } to deeply equal { room: 'root', role: 'coder', …(3) }

[Killed] EqualityOperator
src/runtime/view/detail.ts:276:34
 function currentActivityFromExt(ext: unknown): string | null {
   if (ext !== null && typeof ext === "object") {
     const v = (ext as { current_activity?: unknown }).current_activity;
-    if (typeof v === "string" && v.length > 0) return v;
+    if (typeof v === "string" && v.length >= 0) return v;
   }
   return null;
killedBy: T8 分片 ext 白名单 ext 缺失 / current_activity 非字符串 / 空串 / ext 为原始值 → currentActivity 均为 null
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/runtime/view/detail.ts:306:9
   // 黑板 blocked 免责索引：任一房间的任一 blocked 分片即豁免（跨房间平铺命中）。
   const blockedRoles = new Set<string>();
   for (const shard of shards) {
-    if (shard.status === "blocked") blockedRoles.add(shard.role);
+    if (false) blockedRoles.add(shard.role);
   }
   const members = Object.values(registry.members);
killedBy: T10 stale 判定矩阵（对齐 ADR 0016；镜像 handlers reconcile） d. 任一房间存在 blocked 分片 → 入 awaitingInput 免责档且不同时在 staleMembers
statusReason: expected [] to deeply equal [ { member: 'qa', …(1) } ]

[Killed] MethodExpression
src/runtime/view/detail.ts:309:22
     if (shard.status === "blocked") blockedRoles.add(shard.role);
   }
   const members = Object.values(registry.members);
-  const candidates = members.filter(
-    (m) => m.tier !== 0 && m.status === "running" && Number.isFinite(m.lastSeen),
-  );
+  const candidates = members;
   const annotate = (m: MemberRecord): StaleAnnotation => ({
     member: m.member,
killedBy: T10 stale 判定矩阵（对齐 ADR 0016；镜像 handlers reconcile） b. spawned/stopped/dead 一律不入名册（dead 由 lost 着色表达防双计）
statusReason: expected [ { member: 'm-dead', …(1) }, …(2) ] to deeply equal []

[Killed] LogicalOperator
src/runtime/view/detail.ts:310:12
   }
   const members = Object.values(registry.members);
   const candidates = members.filter(
-    (m) => m.tier !== 0 && m.status === "running" && Number.isFinite(m.lastSeen),
+    (m) => m.tier !== 0 && m.status === "running" || Number.isFinite(m.lastSeen),
   );
   const annotate = (m: MemberRecord): StaleAnnotation => ({
killedBy: T10 stale 判定矩阵（对齐 ADR 0016；镜像 handlers reconcile） b. spawned/stopped/dead 一律不入名册（dead 由 lost 着色表达防双计）
statusReason: expected [ { member: 'm-dead', …(1) }, …(2) ] to deeply equal []

[Killed] EqualityOperator
src/runtime/view/detail.ts:310:12
   }
   const members = Object.values(registry.members);
   const candidates = members.filter(
-    (m) => m.tier !== 0 && m.status === "running" && Number.isFinite(m.lastSeen),
+    (m) => m.tier === 0 && m.status === "running" && Number.isFinite(m.lastSeen),
   );
   const annotate = (m: MemberRecord): StaleAnnotation => ({
killedBy: T10 stale 判定矩阵（对齐 ADR 0016；镜像 handlers reconcile） a. running 超阈入 staleMembers；恰达阈值不算（严格大于 ±1ms 边界）
statusReason: expected [] to deeply equal [ { member: 'coder', …(1) } ]

[Killed] ArrowFunction
src/runtime/view/detail.ts:312:20
   const candidates = members.filter(
     (m) => m.tier !== 0 && m.status === "running" && Number.isFinite(m.lastSeen),
   );
-  const annotate = (m: MemberRecord): StaleAnnotation => ({
-    member: m.member,
-    lastSeenAgeMs: nowMs - m.lastSeen,
-  });
+  const annotate = () => undefined;
   const byNameAsc = (a: { member: string }, b: { member: string }): number =>
     a.member.localeCompare(b.member);
killedBy: T10 stale 判定矩阵（对齐 ADR 0016；镜像 handlers reconcile） a. running 超阈入 staleMembers；恰达阈值不算（严格大于 ±1ms 边界）
statusReason: expected [ undefined ] to deeply equal [ { member: 'coder', …(1) } ]

[Killed] ArithmeticOperator
src/runtime/view/detail.ts:314:20
   );
   const annotate = (m: MemberRecord): StaleAnnotation => ({
     member: m.member,
-    lastSeenAgeMs: nowMs - m.lastSeen,
+    lastSeenAgeMs: nowMs + m.lastSeen,
   });
   const byNameAsc = (a: { member: string }, b: { member: string }): number =>
killedBy: T10 stale 判定矩阵（对齐 ADR 0016；镜像 handlers reconcile） a. running 超阈入 staleMembers；恰达阈值不算（严格大于 ±1ms 边界）
statusReason: expected [ { member: 'coder', …(1) } ] to deeply equal [ { member: 'coder', …(1) } ]

[Killed] ArrowFunction
src/runtime/view/detail.ts:316:21
     member: m.member,
     lastSeenAgeMs: nowMs - m.lastSeen,
   });
-  const byNameAsc = (a: { member: string }, b: { member: string }): number =>
-    a.member.localeCompare(b.member);
+  const byNameAsc = () => undefined;
   const overThreshold = (m: MemberRecord): boolean => nowMs - m.lastSeen > STALE_THRESHOLD_MS;
   const tier0Master = members.find((m) => m.tier === 0);
killedBy: T10 stale 判定矩阵（对齐 ADR 0016；镜像 handlers reconcile） f. 名册按 member localeCompare 升序输出
statusReason: expected [ 'zz-mem', 'aa-mem', 'mm-mem' ] to deeply equal [ 'aa-mem', 'mm-mem', 'zz-mem' ]

[Killed] ConditionalExpression
src/runtime/view/detail.ts:318:55
   });
   const byNameAsc = (a: { member: string }, b: { member: string }): number =>
     a.member.localeCompare(b.member);
-  const overThreshold = (m: MemberRecord): boolean => nowMs - m.lastSeen > STALE_THRESHOLD_MS;
+  const overThreshold = (m: MemberRecord): boolean => false;
   const tier0Master = members.find((m) => m.tier === 0);
   return {
killedBy: T10 stale 判定矩阵（对齐 ADR 0016；镜像 handlers reconcile） a. running 超阈入 staleMembers；恰达阈值不算（严格大于 ±1ms 边界）
statusReason: expected [] to deeply equal [ { member: 'coder', …(1) } ]

[Killed] ArrowFunction
src/runtime/view/detail.ts:318:25
   });
   const byNameAsc = (a: { member: string }, b: { member: string }): number =>
     a.member.localeCompare(b.member);
-  const overThreshold = (m: MemberRecord): boolean => nowMs - m.lastSeen > STALE_THRESHOLD_MS;
+  const overThreshold = () => undefined;
   const tier0Master = members.find((m) => m.tier === 0);
   return {
killedBy: T10 stale 判定矩阵（对齐 ADR 0016；镜像 handlers reconcile） a. running 超阈入 staleMembers；恰达阈值不算（严格大于 ±1ms 边界）
statusReason: expected [] to deeply equal [ { member: 'coder', …(1) } ]

[Killed] ConditionalExpression
src/runtime/view/detail.ts:319:43
   const byNameAsc = (a: { member: string }, b: { member: string }): number =>
     a.member.localeCompare(b.member);
   const overThreshold = (m: MemberRecord): boolean => nowMs - m.lastSeen > STALE_THRESHOLD_MS;
-  const tier0Master = members.find((m) => m.tier === 0);
+  const tier0Master = members.find((m) => true);
   return {
     masterIdle:
killedBy: T10 stale 判定矩阵（对齐 ADR 0016；镜像 handlers reconcile） c. tier0 超阈 → masterIdle=true 且不入 staleMembers；tier0 lastSeen 非有限 → masterIdle=false
statusReason: expected true to be false // Object.is equality

[Killed] ArrowFunction
src/runtime/view/detail.ts:319:36
   const byNameAsc = (a: { member: string }, b: { member: string }): number =>
     a.member.localeCompare(b.member);
   const overThreshold = (m: MemberRecord): boolean => nowMs - m.lastSeen > STALE_THRESHOLD_MS;
-  const tier0Master = members.find((m) => m.tier === 0);
+  const tier0Master = members.find(() => undefined);
   return {
     masterIdle:
killedBy: T10 stale 判定矩阵（对齐 ADR 0016；镜像 handlers reconcile） c. tier0 超阈 → masterIdle=true 且不入 staleMembers；tier0 lastSeen 非有限 → masterIdle=false
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
src/runtime/view/detail.ts:320:10
     a.member.localeCompare(b.member);
   const overThreshold = (m: MemberRecord): boolean => nowMs - m.lastSeen > STALE_THRESHOLD_MS;
   const tier0Master = members.find((m) => m.tier === 0);
-  return {
-    masterIdle:
-      tier0Master !== undefined &&
-      Number.isFinite(tier0Master.lastSeen) &&
-      nowMs - tier0Master.lastSeen > STALE_THRESHOLD_MS,
-    staleMembers: candidates
-      .filter((m) => overThreshold(m) && !blockedRoles.has(m.member))
-      .map(annotate)
-      .sort(byNameAsc),
-    awaitingInput: candidates
-      .filter((m) => overThreshold(m) && blockedRoles.has(m.member))
-      .map(annotate)
-      .sort(byNameAsc),
-  };
+  return {};
 }
 
killedBy: T1 reduceDetail：空输入全形 空账本/信箱/分片/事件 → taskCounts 五键全 0、各区空数组，形状完全确定
statusReason: expected { isTeam: false, tasks: [], …(8) } to deeply equal { isTeam: false, tasks: [], …(8) }

[Killed] ConditionalExpression
src/runtime/view/detail.ts:322:7
   const tier0Master = members.find((m) => m.tier === 0);
   return {
     masterIdle:
-      tier0Master !== undefined &&
-      Number.isFinite(tier0Master.lastSeen) &&
-      nowMs - tier0Master.lastSeen > STALE_THRESHOLD_MS,
+      false,
     staleMembers: candidates
       .filter((m) => overThreshold(m) && !blockedRoles.has(m.member))
killedBy: T10 stale 判定矩阵（对齐 ADR 0016；镜像 handlers reconcile） c. tier0 超阈 → masterIdle=true 且不入 staleMembers；tier0 lastSeen 非有限 → masterIdle=false
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/runtime/view/detail.ts:322:7
   const tier0Master = members.find((m) => m.tier === 0);
   return {
     masterIdle:
-      tier0Master !== undefined &&
-      Number.isFinite(tier0Master.lastSeen) &&
-      nowMs - tier0Master.lastSeen > STALE_THRESHOLD_MS,
+      tier0Master !== undefined && Number.isFinite(tier0Master.lastSeen) || nowMs - tier0Master.lastSeen > STALE_THRESHOLD_MS,
     staleMembers: candidates
       .filter((m) => overThreshold(m) && !blockedRoles.has(m.member))
killedBy: T1 reduceDetail：空输入全形 空账本/信箱/分片/事件 → taskCounts 五键全 0、各区空数组，形状完全确定
statusReason: Cannot read properties of undefined (reading 'lastSeen')

[Killed] EqualityOperator
src/runtime/view/detail.ts:324:7
     masterIdle:
       tier0Master !== undefined &&
       Number.isFinite(tier0Master.lastSeen) &&
-      nowMs - tier0Master.lastSeen > STALE_THRESHOLD_MS,
+      nowMs - tier0Master.lastSeen <= STALE_THRESHOLD_MS,
     staleMembers: candidates
       .filter((m) => overThreshold(m) && !blockedRoles.has(m.member))
killedBy: T10 stale 判定矩阵（对齐 ADR 0016；镜像 handlers reconcile） c. tier0 超阈 → masterIdle=true 且不入 staleMembers；tier0 lastSeen 非有限 → masterIdle=false
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/runtime/view/detail.ts:324:7
     masterIdle:
       tier0Master !== undefined &&
       Number.isFinite(tier0Master.lastSeen) &&
-      nowMs - tier0Master.lastSeen > STALE_THRESHOLD_MS,
+      true,
     staleMembers: candidates
       .filter((m) => overThreshold(m) && !blockedRoles.has(m.member))
killedBy: GET /api/xiaozhuge/team/detail T14: happy path——全字段形状 + stale/awaiting 划分正确
statusReason: expected true to be false // Object.is equality

[Killed] MethodExpression
src/runtime/view/detail.ts:325:19
       tier0Master !== undefined &&
       Number.isFinite(tier0Master.lastSeen) &&
       nowMs - tier0Master.lastSeen > STALE_THRESHOLD_MS,
-    staleMembers: candidates
-      .filter((m) => overThreshold(m) && !blockedRoles.has(m.member))
-      .map(annotate)
-      .sort(byNameAsc),
+    staleMembers: candidates.filter(m => overThreshold(m) && !blockedRoles.has(m.member)).map(annotate),
     awaitingInput: candidates
       .filter((m) => overThreshold(m) && blockedRoles.has(m.member))
killedBy: T10 stale 判定矩阵（对齐 ADR 0016；镜像 handlers reconcile） f. 名册按 member localeCompare 升序输出
statusReason: expected [ 'zz-mem', 'aa-mem', 'mm-mem' ] to deeply equal [ 'aa-mem', 'mm-mem', 'zz-mem' ]

[Killed] MethodExpression
src/runtime/view/detail.ts:325:19
       tier0Master !== undefined &&
       Number.isFinite(tier0Master.lastSeen) &&
       nowMs - tier0Master.lastSeen > STALE_THRESHOLD_MS,
-    staleMembers: candidates
-      .filter((m) => overThreshold(m) && !blockedRoles.has(m.member))
+    staleMembers: candidates
       .map(annotate)
       .sort(byNameAsc),
killedBy: T10 stale 判定矩阵（对齐 ADR 0016；镜像 handlers reconcile） a. running 超阈入 staleMembers；恰达阈值不算（严格大于 ±1ms 边界）
statusReason: expected [ { member: 'coder', …(1) } ] to deeply equal []

[Killed] ConditionalExpression
src/runtime/view/detail.ts:326:22
       Number.isFinite(tier0Master.lastSeen) &&
       nowMs - tier0Master.lastSeen > STALE_THRESHOLD_MS,
     staleMembers: candidates
-      .filter((m) => overThreshold(m) && !blockedRoles.has(m.member))
+      .filter((m) => true)
       .map(annotate)
       .sort(byNameAsc),
killedBy: T10 stale 判定矩阵（对齐 ADR 0016；镜像 handlers reconcile） a. running 超阈入 staleMembers；恰达阈值不算（严格大于 ±1ms 边界）
statusReason: expected [ { member: 'coder', …(1) } ] to deeply equal []

[Killed] ArrowFunction
src/runtime/view/detail.ts:326:15
       Number.isFinite(tier0Master.lastSeen) &&
       nowMs - tier0Master.lastSeen > STALE_THRESHOLD_MS,
     staleMembers: candidates
-      .filter((m) => overThreshold(m) && !blockedRoles.has(m.member))
+      .filter(() => undefined)
       .map(annotate)
       .sort(byNameAsc),
killedBy: T10 stale 判定矩阵（对齐 ADR 0016；镜像 handlers reconcile） a. running 超阈入 staleMembers；恰达阈值不算（严格大于 ±1ms 边界）
statusReason: expected [] to deeply equal [ { member: 'coder', …(1) } ]

[Killed] MethodExpression
src/runtime/view/detail.ts:329:20
       .filter((m) => overThreshold(m) && !blockedRoles.has(m.member))
       .map(annotate)
       .sort(byNameAsc),
-    awaitingInput: candidates
-      .filter((m) => overThreshold(m) && blockedRoles.has(m.member))
+    awaitingInput: candidates
       .map(annotate)
       .sort(byNameAsc),
killedBy: T10 stale 判定矩阵（对齐 ADR 0016；镜像 handlers reconcile） a. running 超阈入 staleMembers；恰达阈值不算（严格大于 ±1ms 边界）
statusReason: expected [ { member: 'coder', …(1) } ] to deeply equal []

[Survived] MethodExpression
src/runtime/view/detail.ts:329:20
       .filter((m) => overThreshold(m) && !blockedRoles.has(m.member))
       .map(annotate)
       .sort(byNameAsc),
-    awaitingInput: candidates
-      .filter((m) => overThreshold(m) && blockedRoles.has(m.member))
-      .map(annotate)
-      .sort(byNameAsc),
+    awaitingInput: candidates.filter(m => overThreshold(m) && blockedRoles.has(m.member)).map(annotate),
   };
 }

[Killed] ConditionalExpression
src/runtime/view/detail.ts:330:22
       .map(annotate)
       .sort(byNameAsc),
     awaitingInput: candidates
-      .filter((m) => overThreshold(m) && blockedRoles.has(m.member))
+      .filter((m) => true)
       .map(annotate)
       .sort(byNameAsc),
killedBy: T10 stale 判定矩阵（对齐 ADR 0016；镜像 handlers reconcile） a. running 超阈入 staleMembers；恰达阈值不算（严格大于 ±1ms 边界）
statusReason: expected [ { member: 'coder', …(1) } ] to deeply equal []

[Killed] ConditionalExpression
src/runtime/view/detail.ts:330:22
       .map(annotate)
       .sort(byNameAsc),
     awaitingInput: candidates
-      .filter((m) => overThreshold(m) && blockedRoles.has(m.member))
+      .filter((m) => false)
       .map(annotate)
       .sort(byNameAsc),
killedBy: T10 stale 判定矩阵（对齐 ADR 0016；镜像 handlers reconcile） d. 任一房间存在 blocked 分片 → 入 awaitingInput 免责档且不同时在 staleMembers
statusReason: expected [] to deeply equal [ { member: 'qa', …(1) } ]

[Killed] ConditionalExpression
src/runtime/view/detail.ts:343:7
  */
 function summaryOf(type: string, payload: unknown): string | null {
   const p = payload as Record<string, unknown> | null;
-  if (p === null || typeof p !== "object") return null;
+  if (true) return null;
   const str = (v: unknown): string | null => (typeof v === "string" && v.length > 0 ? v : null);
   switch (type) {
killedBy: Q2 事件投影：白名单摘要 task/update / handoff / mailbox/deliver / member/status / spawn 机械摘录
statusReason: expected [ Array(5) ] to match object [ Array(5) ]
(10 matching properties omitted from actual)

[Killed] ArrowFunction
src/runtime/view/detail.ts:344:15
 function summaryOf(type: string, payload: unknown): string | null {
   const p = payload as Record<string, unknown> | null;
   if (p === null || typeof p !== "object") return null;
-  const str = (v: unknown): string | null => (typeof v === "string" && v.length > 0 ? v : null);
+  const str = () => undefined;
   switch (type) {
     case "task/update": {
killedBy: Q2 事件投影：白名单摘要 task/update / handoff / mailbox/deliver / member/status / spawn 机械摘录
statusReason: expected [ Array(5) ] to match object [ Array(5) ]
(10 matching properties omitted from actual)

[Killed] EqualityOperator
src/runtime/view/detail.ts:349:11
     case "task/update": {
       const id = str(p.task_id);
       const status = str(p.status);
-      if (id === null || status === null) return null;
+      if (id !== null || status === null) return null;
       // P0-1（#169 复核）：title 是 PR-C 增强项而非必需项——历史事件无 title
       // 字段时退化旧格式，避免「新增字段导致历史摘要整体 null 回退」。
killedBy: Q2 事件投影：白名单摘要 task/update / handoff / mailbox/deliver / member/status / spawn 机械摘录
statusReason: expected [ Array(5) ] to match object [ Array(5) ]
(2 matching properties omitted from actual)

[Killed] ConditionalExpression
src/runtime/view/detail.ts:353:14
       // P0-1（#169 复核）：title 是 PR-C 增强项而非必需项——历史事件无 title
       // 字段时退化旧格式，避免「新增字段导致历史摘要整体 null 回退」。
       const title = str(p.title);
-      return title !== null ? `task ${id}（${title}）→ ${status}` : `task ${id} → ${status}`;
+      return true ? `task ${id}（${title}）→ ${status}` : `task ${id} → ${status}`;
     }
     case "task/create": {
killedBy: Q2 事件投影：白名单摘要 task/update / handoff / mailbox/deliver / member/status / spawn 机械摘录
statusReason: expected [ Array(5) ] to match object [ Array(5) ]
(2 matching properties omitted from actual)

[Killed] LogicalOperator
src/runtime/view/detail.ts:363:14
     case "handoff": {
       const id = str(p.task_id);
       const to = str(p.to_role);
-      return id !== null && to !== null ? `handoff ${id} → ${to}` : null;
+      return id !== null || to !== null ? `handoff ${id} → ${to}` : null;
     }
     case "mailbox/deliver": {
killedBy: Q2 事件投影：白名单摘要 payload 字段缺省/类型不符 → 该分支摘要置 null（防拼 undefined 文案）
statusReason: expected 'handoff null → w' to be null

[Killed] EqualityOperator
src/runtime/view/detail.ts:382:14
     case "team/spawn": {
       const member = str(p.member);
       const role = str(p.role);
-      return member !== null && role !== null ? `spawn ${member} (${role})` : null;
+      return member === null && role !== null ? `spawn ${member} (${role})` : null;
     }
     default:
killedBy: Q2 事件投影：白名单摘要 task/update / handoff / mailbox/deliver / member/status / spawn 机械摘录
statusReason: expected [ Array(5) ] to match object [ Array(5) ]
(2 matching properties omitted from actual)

[Killed] ConditionalExpression
src/runtime/view/detail.ts:398:7
   const p = payload as Record<string, unknown> | null;
   if (p === null || typeof p !== "object") return null;
   const raw = p.receipt;
-  if (!Array.isArray(raw) || raw.length === 0) return null;
+  if (false) return null;
   const out: string[] = [];
   for (const line of raw) {
killedBy: Q2 事件投影：白名单摘要 payload 字段缺省/类型不符 → 该分支摘要置 null（防拼 undefined 文案）
statusReason: raw is not iterable

[Killed] ConditionalExpression
src/runtime/view/detail.ts:398:7
   const p = payload as Record<string, unknown> | null;
   if (p === null || typeof p !== "object") return null;
   const raw = p.receipt;
-  if (!Array.isArray(raw) || raw.length === 0) return null;
+  if (true) return null;
   const out: string[] = [];
   for (const line of raw) {
killedBy: Q2 事件投影：白名单摘要 task/update / handoff / mailbox/deliver / member/status / spawn 机械摘录
statusReason: expected [ Array(5) ] to match object [ Array(5) ]
(2 matching properties omitted from actual)

[Killed] ArrayDeclaration
src/runtime/view/detail.ts:399:25
   if (p === null || typeof p !== "object") return null;
   const raw = p.receipt;
   if (!Array.isArray(raw) || raw.length === 0) return null;
-  const out: string[] = [];
+  const out: string[] = ["Stryker was here"];
   for (const line of raw) {
     if (typeof line !== "string") return null;
killedBy: Q2 事件投影：白名单摘要 task/update / handoff / mailbox/deliver / member/status / spawn 机械摘录
statusReason: expected [ Array(5) ] to match object [ Array(5) ]
(2 matching properties omitted from actual)

[Killed] ConditionalExpression
src/runtime/view/detail.ts:402:9
   const out: string[] = [];
   for (const line of raw) {
     if (typeof line !== "string") return null;
-    if (!/^\s*(pass|fail)\s*[:：]/i.test(line)) return null;
+    if (false) return null;
     out.push(line.slice(0, RECEIPT_LINE_MAX));
     if (out.length >= RECEIPT_SUMMARY_LIMIT) break;
killedBy: Q2 事件投影：回执读侧守卫（#162 评审 P0-3） 仅 pass:/fail: 开头行进入 receiptSummary；存在违规行 → 整条置 null（宁缺勿滥）
statusReason: expected [ 'pass: ok', 'garbage line' ] to be null

[Killed] ArrayDeclaration
src/runtime/view/detail.ts:431:34
  * 同 room 最新在前；跨房间按房间名稳定分组）。事件为空/坏行跳过同 readEventsTail。
  */
 export function projectRecentEvents(rooms: readonly RoomEvent[]): RecentEventView[] {
-  const out: RecentEventView[] = [];
+  const out: RecentEventView[] = ["Stryker was here"];
   for (const { room, events } of rooms) {
     for (const e of events) out.push(projectRecentEvent(room, e));
killedBy: GET /api/xiaozhuge/team/detail T13: team.yaml 不在场 → 200 全空形短路（isTeam:false），不读任何数据文件
statusReason: expected { isTeam: false, tasks: [], …(8) } to deeply equal { isTeam: false, tasks: [], …(8) }

[Killed] ArithmeticOperator
src/runtime/view/detail.ts:436:47
     for (const e of events) out.push(projectRecentEvent(room, e));
   }
   return out.sort(
-    (a, b) => a.room.localeCompare(b.room) || b.seq - a.seq,
+    (a, b) => a.room.localeCompare(b.room) || b.seq + a.seq,
   );
 }
killedBy: Q2 事件投影：白名单摘要 task/update / handoff / mailbox/deliver / member/status / spawn 机械摘录
statusReason: expected [ Array(5) ] to match object [ Array(5) ]
(8 matching properties omitted from actual)

[Survived] ConditionalExpression
src/runtime/view/detail.ts:456:21
       updatedAt: shard.updatedAt,
       currentActivity: currentActivityFromExt(shard.ext),
     }))
-    .sort((a, b) => a.room.localeCompare(b.room) || a.role.localeCompare(b.role));
+    .sort((a, b) => true);
   const annotations = staleAnnotations(
     input.registry,

[Killed] ConditionalExpression
src/runtime/view/detail.ts:463:13
     input.nowMs,
   );
   return {
-    isTeam: Object.keys(input.registry.members).length > 0,
+    isTeam: true,
     tasks,
     corruptTaskFiles: [...input.corruptTaskFiles],
killedBy: GET /api/xiaozhuge/team/detail T13: team.yaml 不在场 → 200 全空形短路（isTeam:false），不读任何数据文件
statusReason: expected { isTeam: true, tasks: [], …(8) } to deeply equal { isTeam: false, tasks: [], …(8) }
