[Survived] StringLiteral
src/runtime/template/template-loader.ts:22:28
 /** 模板场景目录内的固定文件名（v2.2 定稿 §7.1）。 */
 export const TEAM_FILE = "team.yaml";
 export const ROLES_DIR = "roles";
-export const PROMPTS_DIR = "prompts";
+export const PROMPTS_DIR = "";
 
 /**

[Killed] StringLiteral
src/runtime/template/template-loader.ts:32:3
 export const PLAYBOOKS_DIR = "playbooks";
 export const TIER0_PLAYBOOK_FILE = "tier0-playbook.md";
 export const TIER0_PLAYBOOK_SEPARATOR =
-  "\n\n===== tier0 playbook / scenario prompt boundary =====\n\n";
+  "";
 
 export interface LoadedTemplate {
killedBy: team/create 一键建团 默认场景：init 持久化 + tier0_prompt 组装 + 快照落盘
statusReason: expected '# Tier-0 Master Orchestration Playboo…' to contain 'tier0 playbook / scenario prompt boun…'

[Killed] BooleanLiteral
src/runtime/template/template-loader.ts:60:7
   source: TemplateSource,
 ): Promise<LoadedTemplate> {
   const teamPath = join(scenarioDir, TEAM_FILE);
-  if (!existsSync(teamPath)) {
+  if (existsSync(teamPath)) {
     throw new Error(`template missing ${TEAM_FILE} in ${scenarioDir}`);
   }
killedBy: Wave 1a 工具面反查挂载（子代理 → 主控实例） 子代理侧 handlers 认领主控侧信封并落主控账本
statusReason: template missing team.yaml in /home/runner/work/xiaozhuge/xiaozhuge/.stryker-tmp/sandbox-bUSLsp/templates/oss-maintenance

[Killed] BlockStatement
src/runtime/template/template-loader.ts:60:30
   source: TemplateSource,
 ): Promise<LoadedTemplate> {
   const teamPath = join(scenarioDir, TEAM_FILE);
-  if (!existsSync(teamPath)) {
-    throw new Error(`template missing ${TEAM_FILE} in ${scenarioDir}`);
-  }
+  if (!existsSync(teamPath)) {}
   const teamRaw = await readFile(teamPath, "utf8");
   let template: Record<string, unknown> & { name: string; version: number; source?: TemplateSource };
killedBy: 加载器拒绝语义 缺 team.yaml 即抛错
statusReason: expected [Function] to throw error matching /missing team.yaml/ but got 'ENOENT: no such file or directory, op…'

[Killed] StringLiteral
src/runtime/template/template-loader.ts:61:21
 ): Promise<LoadedTemplate> {
   const teamPath = join(scenarioDir, TEAM_FILE);
   if (!existsSync(teamPath)) {
-    throw new Error(`template missing ${TEAM_FILE} in ${scenarioDir}`);
+    throw new Error(``);
   }
   const teamRaw = await readFile(teamPath, "utf8");
killedBy: 加载器拒绝语义 缺 team.yaml 即抛错
statusReason: expected [Function] to throw error matching /missing team.yaml/ but got ''

[Killed] StringLiteral
src/runtime/template/template-loader.ts:63:44
   if (!existsSync(teamPath)) {
     throw new Error(`template missing ${TEAM_FILE} in ${scenarioDir}`);
   }
-  const teamRaw = await readFile(teamPath, "utf8");
+  const teamRaw = await readFile(teamPath, "");
   let template: Record<string, unknown> & { name: string; version: number; source?: TemplateSource };
   try {
killedBy: 写面 hook：成员登记 → 索引维护 spawn tier>0 登记后反查命中；membership 携带成员名
statusReason: template /home/runner/work/xiaozhuge/xiaozhuge/.stryker-tmp/sandbox-bUSLsp/templates/oss-maintenance/team.yaml is not valid YAML: source is not a string

[Killed] BlockStatement
src/runtime/template/template-loader.ts:65:7
   }
   const teamRaw = await readFile(teamPath, "utf8");
   let template: Record<string, unknown> & { name: string; version: number; source?: TemplateSource };
-  try {
-    const parsed = parseYaml(teamRaw) as unknown;
-    if (typeof parsed !== "object" || parsed === null || Array.isArray(parsed)) {
-      throw new Error("document must be a mapping");
-    }
-    template = parsed as typeof template;
-  } catch (error) {
+  try {} catch (error) {
     throw new Error(`template ${teamPath} is not valid YAML: ${(error as Error).message}`);
   }
killedBy: team/create 一键建团 默认场景：init 持久化 + tier0_prompt 组装 + 快照落盘
statusReason: expected 409 to be 200 // Object.is equality

[Killed] BlockStatement
src/runtime/template/template-loader.ts:67:81
   let template: Record<string, unknown> & { name: string; version: number; source?: TemplateSource };
   try {
     const parsed = parseYaml(teamRaw) as unknown;
-    if (typeof parsed !== "object" || parsed === null || Array.isArray(parsed)) {
-      throw new Error("document must be a mapping");
-    }
+    if (typeof parsed !== "object" || parsed === null || Array.isArray(parsed)) {}
     template = parsed as typeof template;
   } catch (error) {
killedBy: 加载器拒绝语义 顶层非映射（纯标量/数组）即拒
statusReason: expected [Function] to throw error matching /not valid YAML/ but got 'unmapped validation message: Invalid …'

[Killed] ConditionalExpression
src/runtime/template/template-loader.ts:67:9
   let template: Record<string, unknown> & { name: string; version: number; source?: TemplateSource };
   try {
     const parsed = parseYaml(teamRaw) as unknown;
-    if (typeof parsed !== "object" || parsed === null || Array.isArray(parsed)) {
+    if (false) {
       throw new Error("document must be a mapping");
     }
killedBy: 加载器拒绝语义 顶层非映射（纯标量/数组）即拒
statusReason: expected [Function] to throw error matching /not valid YAML/ but got 'unmapped validation message: Invalid …'

[Killed] BlockStatement
src/runtime/template/template-loader.ts:71:19
       throw new Error("document must be a mapping");
     }
     template = parsed as typeof template;
-  } catch (error) {
-    throw new Error(`template ${teamPath} is not valid YAML: ${(error as Error).message}`);
-  }
+  } catch (error) {}
 
   // 强制注入来源标记（覆盖模板自带值——来源由加载位置决定，不由文件内容决定）。
killedBy: 加载器拒绝语义 非 YAML 内容（tab 缩进等硬禁区）即抛错并说明解析边界
statusReason: expected [Function] to throw error matching /not valid YAML/ but got 'Cannot set properties of undefined (s…'

[Killed] CallExpression
src/runtime/template/template-loader.ts:72:5
     }
     template = parsed as typeof template;
   } catch (error) {
-    throw new Error(`template ${teamPath} is not valid YAML: ${(error as Error).message}`);
+    ;
   }
 
killedBy: 加载器拒绝语义 非 YAML 内容（tab 缩进等硬禁区）即抛错并说明解析边界
statusReason: expected [Function] to throw error matching /not valid YAML/ but got 'Cannot set properties of undefined (s…'

[Killed] BlockStatement
src/runtime/template/template-loader.ts:81:29
   const rolesDir = join(scenarioDir, ROLES_DIR);
   const specs: Array<Record<string, unknown>> = [];
   const roles: Record<string, Record<string, unknown>> = {};
-  if (existsSync(rolesDir)) {
-    for (const entry of (await readFile2(rolesDir)).sort()) {
-      if (!entry.endsWith(".role.yaml")) continue;
-      const spec = parseYaml(await readFile(join(rolesDir, entry), "utf8")) as Record<string, unknown>;
-      specs.push(spec);
-      roles[String(spec.id)] = spec;
-    }
-  }
+  if (existsSync(rolesDir)) {}
 
   // 校验：模板 + 角色集合（一次收集全部错误后统一抛出）。
killedBy: 包内置 oss-maintenance 模板 加载并通过模板 + RoleSet 双校验，来源标记为 builtin
statusReason: template validation failed:
- [judge-count] roles.roles: exactly one as_judge role required, found 0

[Killed] ConditionalExpression
src/runtime/template/template-loader.ts:81:7
   const rolesDir = join(scenarioDir, ROLES_DIR);
   const specs: Array<Record<string, unknown>> = [];
   const roles: Record<string, Record<string, unknown>> = {};
-  if (existsSync(rolesDir)) {
+  if (true) {
     for (const entry of (await readFile2(rolesDir)).sort()) {
       if (!entry.endsWith(".role.yaml")) continue;
killedBy: 加载器拒绝语义 校验不通过的模板列出全部错误
statusReason: expected [Function] to throw error matching /template validation failed/ but got 'ENOENT: no such file or directory, sc…'

[Killed] BlockStatement
src/runtime/template/template-loader.ts:82:61
   const specs: Array<Record<string, unknown>> = [];
   const roles: Record<string, Record<string, unknown>> = {};
   if (existsSync(rolesDir)) {
-    for (const entry of (await readFile2(rolesDir)).sort()) {
-      if (!entry.endsWith(".role.yaml")) continue;
-      const spec = parseYaml(await readFile(join(rolesDir, entry), "utf8")) as Record<string, unknown>;
-      specs.push(spec);
-      roles[String(spec.id)] = spec;
-    }
+    for (const entry of (await readFile2(rolesDir)).sort()) {}
   }
 
killedBy: 包内置 oss-maintenance 模板 加载并通过模板 + RoleSet 双校验，来源标记为 builtin
statusReason: template validation failed:
- [judge-count] roles.roles: exactly one as_judge role required, found 0

[Survived] MethodExpression
src/runtime/template/template-loader.ts:82:25
   const specs: Array<Record<string, unknown>> = [];
   const roles: Record<string, Record<string, unknown>> = {};
   if (existsSync(rolesDir)) {
-    for (const entry of (await readFile2(rolesDir)).sort()) {
+    for (const entry of await readFile2(rolesDir)) {
       if (!entry.endsWith(".role.yaml")) continue;
       const spec = parseYaml(await readFile(join(rolesDir, entry), "utf8")) as Record<string, unknown>;

[Killed] BooleanLiteral
src/runtime/template/template-loader.ts:83:11
   const roles: Record<string, Record<string, unknown>> = {};
   if (existsSync(rolesDir)) {
     for (const entry of (await readFile2(rolesDir)).sort()) {
-      if (!entry.endsWith(".role.yaml")) continue;
+      if (entry.endsWith(".role.yaml")) continue;
       const spec = parseYaml(await readFile(join(rolesDir, entry), "utf8")) as Record<string, unknown>;
       specs.push(spec);
killedBy: 包内置 oss-maintenance 模板 加载并通过模板 + RoleSet 双校验，来源标记为 builtin
statusReason: template validation failed:
- [judge-count] roles.roles: exactly one as_judge role required, found 0

[Killed] ConditionalExpression
src/runtime/template/template-loader.ts:83:11
   const roles: Record<string, Record<string, unknown>> = {};
   if (existsSync(rolesDir)) {
     for (const entry of (await readFile2(rolesDir)).sort()) {
-      if (!entry.endsWith(".role.yaml")) continue;
+      if (true) continue;
       const spec = parseYaml(await readFile(join(rolesDir, entry), "utf8")) as Record<string, unknown>;
       specs.push(spec);
killedBy: 包内置 oss-maintenance 模板 加载并通过模板 + RoleSet 双校验，来源标记为 builtin
statusReason: template validation failed:
- [judge-count] roles.roles: exactly one as_judge role required, found 0

[Killed] CallExpression
src/runtime/template/template-loader.ts:85:7
     for (const entry of (await readFile2(rolesDir)).sort()) {
       if (!entry.endsWith(".role.yaml")) continue;
       const spec = parseYaml(await readFile(join(rolesDir, entry), "utf8")) as Record<string, unknown>;
-      specs.push(spec);
+      ;
       roles[String(spec.id)] = spec;
     }
killedBy: team_reconcile overview 一次调用返回快照摘要、成员对照、状态分布、事件游标与 goal 占位
statusReason: template validation failed:
- [judge-count] roles.roles: exactly one as_judge role required, found 0

[Killed] ArrowFunction
src/runtime/template/template-loader.ts:94:29
   const tplResult = validateTeamTemplate(template);
   const setResult = validateRoleSet(specs);
   const allErrors = [
-    ...tplResult.errors.map((e) => ({ ...e, path: `team.${e.path}` })),
+    ...tplResult.errors.map(() => undefined),
     ...setResult.errors.map((e) => ({ ...e, path: `roles.${e.path}` })),
   ];
killedBy: 加载器拒绝语义 校验不通过的模板列出全部错误
statusReason: expected [Function] to throw error matching /template validation failed/ but got 'Cannot read properties of undefined (…'

[Survived] StringLiteral
src/runtime/template/template-loader.ts:94:51
   const tplResult = validateTeamTemplate(template);
   const setResult = validateRoleSet(specs);
   const allErrors = [
-    ...tplResult.errors.map((e) => ({ ...e, path: `team.${e.path}` })),
+    ...tplResult.errors.map((e) => ({ ...e, path: `` })),
     ...setResult.errors.map((e) => ({ ...e, path: `roles.${e.path}` })),
   ];

[Killed] ArrowFunction
src/runtime/template/template-loader.ts:95:29
   const setResult = validateRoleSet(specs);
   const allErrors = [
     ...tplResult.errors.map((e) => ({ ...e, path: `team.${e.path}` })),
-    ...setResult.errors.map((e) => ({ ...e, path: `roles.${e.path}` })),
+    ...setResult.errors.map(() => undefined),
   ];
   if (allErrors.length > 0) {
killedBy: 加载器拒绝语义 校验不通过的模板列出全部错误
statusReason: expected [Function] to throw error matching /template validation failed/ but got 'Cannot read properties of undefined (…'

[Survived] ObjectLiteral
src/runtime/template/template-loader.ts:95:37
   const setResult = validateRoleSet(specs);
   const allErrors = [
     ...tplResult.errors.map((e) => ({ ...e, path: `team.${e.path}` })),
-    ...setResult.errors.map((e) => ({ ...e, path: `roles.${e.path}` })),
+    ...setResult.errors.map((e) => ({})),
   ];
   if (allErrors.length > 0) {

[Killed] ConditionalExpression
src/runtime/template/template-loader.ts:97:7
     ...tplResult.errors.map((e) => ({ ...e, path: `team.${e.path}` })),
     ...setResult.errors.map((e) => ({ ...e, path: `roles.${e.path}` })),
   ];
-  if (allErrors.length > 0) {
+  if (false) {
     throw new Error(
       `template validation failed:\n${allErrors.map((e) => `- [${e.code}] ${e.path}: ${e.message}`).join("\n")}`,
killedBy: 加载器拒绝语义 校验不通过的模板列出全部错误
statusReason: promise resolved "{ template: { name: '', …(4) }, …(4) }" instead of rejecting

[Killed] ConditionalExpression
src/runtime/template/template-loader.ts:97:7
     ...tplResult.errors.map((e) => ({ ...e, path: `team.${e.path}` })),
     ...setResult.errors.map((e) => ({ ...e, path: `roles.${e.path}` })),
   ];
-  if (allErrors.length > 0) {
+  if (true) {
     throw new Error(
       `template validation failed:\n${allErrors.map((e) => `- [${e.code}] ${e.path}: ${e.message}`).join("\n")}`,
killedBy: team_reconcile overview 一次调用返回快照摘要、成员对照、状态分布、事件游标与 goal 占位
statusReason: template validation failed:

[Survived] ArrowFunction
src/runtime/template/template-loader.ts:99:53
   ];
   if (allErrors.length > 0) {
     throw new Error(
-      `template validation failed:\n${allErrors.map((e) => `- [${e.code}] ${e.path}: ${e.message}`).join("\n")}`,
+      `template validation failed:\n${allErrors.map(() => undefined).join("\n")}`,
     );
   }

[Survived] StringLiteral
src/runtime/template/template-loader.ts:99:60
   ];
   if (allErrors.length > 0) {
     throw new Error(
-      `template validation failed:\n${allErrors.map((e) => `- [${e.code}] ${e.path}: ${e.message}`).join("\n")}`,
+      `template validation failed:\n${allErrors.map((e) => ``).join("\n")}`,
     );
   }

[Killed] BlockStatement
src/runtime/template/template-loader.ts:109:76
   const scenarioReal = realpathSync(scenarioDir);
   const prompts: Record<string, string> = {};
   const referenced = new Set<string>();
-  for (const tier of (template.tiers as Array<{ prompt?: string }>) ?? []) {
-    if (typeof tier.prompt === "string") referenced.add(tier.prompt);
-  }
+  for (const tier of (template.tiers as Array<{ prompt?: string }>) ?? []) {}
   for (const spec of specs) {
     const p = (spec as { prompt?: unknown }).prompt;
killedBy: team/create 一键建团 默认场景：init 持久化 + tier0_prompt 组装 + 快照落盘
statusReason: expected '# Tier-0 Master Orchestration Playboo…' to contain 'Master Scenario Orchestration (oss-ma…'

[Killed] LogicalOperator
src/runtime/template/template-loader.ts:109:22
   const scenarioReal = realpathSync(scenarioDir);
   const prompts: Record<string, string> = {};
   const referenced = new Set<string>();
-  for (const tier of (template.tiers as Array<{ prompt?: string }>) ?? []) {
+  for (const tier of template.tiers as Array<{
+  prompt?: string;
+}> && []) {
     if (typeof tier.prompt === "string") referenced.add(tier.prompt);
   }
killedBy: 包内置 oss-maintenance 模板 加载并通过模板 + RoleSet 双校验，来源标记为 builtin
statusReason: expected [ './prompts/cleaner.md', …(4) ] to include './prompts/master.md'

[Killed] ConditionalExpression
src/runtime/template/template-loader.ts:110:9
   const prompts: Record<string, string> = {};
   const referenced = new Set<string>();
   for (const tier of (template.tiers as Array<{ prompt?: string }>) ?? []) {
-    if (typeof tier.prompt === "string") referenced.add(tier.prompt);
+    if (false) referenced.add(tier.prompt);
   }
   for (const spec of specs) {
killedBy: team/create 一键建团 默认场景：init 持久化 + tier0_prompt 组装 + 快照落盘
statusReason: expected '# Tier-0 Master Orchestration Playboo…' to contain 'Master Scenario Orchestration (oss-ma…'

[Killed] CallExpression
src/runtime/template/template-loader.ts:110:42
   const prompts: Record<string, string> = {};
   const referenced = new Set<string>();
   for (const tier of (template.tiers as Array<{ prompt?: string }>) ?? []) {
-    if (typeof tier.prompt === "string") referenced.add(tier.prompt);
+    if (typeof tier.prompt === "string") ;
   }
   for (const spec of specs) {
killedBy: team/create 一键建团 默认场景：init 持久化 + tier0_prompt 组装 + 快照落盘
statusReason: expected '# Tier-0 Master Orchestration Playboo…' to contain 'Master Scenario Orchestration (oss-ma…'

[Killed] BlockStatement
src/runtime/template/template-loader.ts:112:29
   for (const tier of (template.tiers as Array<{ prompt?: string }>) ?? []) {
     if (typeof tier.prompt === "string") referenced.add(tier.prompt);
   }
-  for (const spec of specs) {
-    const p = (spec as { prompt?: unknown }).prompt;
-    if (typeof p === "string") referenced.add(p);
-  }
+  for (const spec of specs) {}
   for (const rel of referenced) {
     const promptPath = join(scenarioDir, rel);
killedBy: 包内置 oss-maintenance 模板 实例化快照：携带来源标记、digest 与内联 prompt
statusReason: expected null to be truthy

[Killed] CallExpression
src/runtime/template/template-loader.ts:114:32
   }
   for (const spec of specs) {
     const p = (spec as { prompt?: unknown }).prompt;
-    if (typeof p === "string") referenced.add(p);
+    if (typeof p === "string") ;
   }
   for (const rel of referenced) {
killedBy: 包内置 oss-maintenance 模板 实例化快照：携带来源标记、digest 与内联 prompt
statusReason: expected null to be truthy

[Killed] ConditionalExpression
src/runtime/template/template-loader.ts:114:9
   }
   for (const spec of specs) {
     const p = (spec as { prompt?: unknown }).prompt;
-    if (typeof p === "string") referenced.add(p);
+    if (false) referenced.add(p);
   }
   for (const rel of referenced) {
killedBy: 包内置 oss-maintenance 模板 实例化快照：携带来源标记、digest 与内联 prompt
statusReason: expected null to be truthy

[Killed] BlockStatement
src/runtime/template/template-loader.ts:116:33
     const p = (spec as { prompt?: unknown }).prompt;
     if (typeof p === "string") referenced.add(p);
   }
-  for (const rel of referenced) {
-    const promptPath = join(scenarioDir, rel);
-    if (!existsSync(promptPath)) {
-      throw new Error(`referenced prompt missing: ${rel}`);
-    }
-    const promptReal = realpathSync(promptPath);
-    if (promptReal !== scenarioReal && !promptReal.startsWith(scenarioReal + sep)) {
-      throw new Error(`prompt path escapes scenario directory: ${rel}`);
-    }
-    prompts[rel] = await readFile(promptPath, "utf8");
-  }
+  for (const rel of referenced) {}
 
   return {
killedBy: 包内置 oss-maintenance 模板 加载并通过模板 + RoleSet 双校验，来源标记为 builtin
statusReason: expected [] to include './prompts/master.md'

[Killed] ConditionalExpression
src/runtime/template/template-loader.ts:118:9
   }
   for (const rel of referenced) {
     const promptPath = join(scenarioDir, rel);
-    if (!existsSync(promptPath)) {
+    if (false) {
       throw new Error(`referenced prompt missing: ${rel}`);
     }
killedBy: 加载器拒绝语义 引用的 prompt 文件缺失即拒
statusReason: expected [Function] to throw error matching /referenced prompt missing/ but got 'ENOENT: no such file or directory, ls…'

[Killed] ConditionalExpression
src/runtime/template/template-loader.ts:118:9
   }
   for (const rel of referenced) {
     const promptPath = join(scenarioDir, rel);
-    if (!existsSync(promptPath)) {
+    if (true) {
       throw new Error(`referenced prompt missing: ${rel}`);
     }
killedBy: 包内置 oss-maintenance 模板 加载并通过模板 + RoleSet 双校验，来源标记为 builtin
statusReason: referenced prompt missing: ./prompts/master.md

[Killed] ConditionalExpression
src/runtime/template/template-loader.ts:122:9
       throw new Error(`referenced prompt missing: ${rel}`);
     }
     const promptReal = realpathSync(promptPath);
-    if (promptReal !== scenarioReal && !promptReal.startsWith(scenarioReal + sep)) {
+    if (true) {
       throw new Error(`prompt path escapes scenario directory: ${rel}`);
     }
killedBy: 包内置 oss-maintenance 模板 加载并通过模板 + RoleSet 双校验，来源标记为 builtin
statusReason: prompt path escapes scenario directory: ./prompts/master.md

[Killed] BooleanLiteral
src/runtime/template/template-loader.ts:122:40
       throw new Error(`referenced prompt missing: ${rel}`);
     }
     const promptReal = realpathSync(promptPath);
-    if (promptReal !== scenarioReal && !promptReal.startsWith(scenarioReal + sep)) {
+    if (promptReal !== scenarioReal && promptReal.startsWith(scenarioReal + sep)) {
       throw new Error(`prompt path escapes scenario directory: ${rel}`);
     }
killedBy: 包内置 oss-maintenance 模板 加载并通过模板 + RoleSet 双校验，来源标记为 builtin
statusReason: prompt path escapes scenario directory: ./prompts/master.md

[Killed] StringLiteral
src/runtime/template/template-loader.ts:123:23
     }
     const promptReal = realpathSync(promptPath);
     if (promptReal !== scenarioReal && !promptReal.startsWith(scenarioReal + sep)) {
-      throw new Error(`prompt path escapes scenario directory: ${rel}`);
+      throw new Error(``);
     }
     prompts[rel] = await readFile(promptPath, "utf8");
killedBy: 三级来源解析（ADR 0013） prompt 相对路径穿越场景目录即拒（realpath 收敛）
statusReason: expected [Function] to throw error matching /reference.*escape|prompt path escapes/ but got ''

[Killed] MethodExpression
src/runtime/template/template-loader.ts:133:13
     roles,
     prompts,
     source,
-    digest: createHash("sha256").update(JSON.stringify({ template, roles })).digest("hex").slice(0, 16),
+    digest: createHash("sha256").update(JSON.stringify({
+  template,
+  roles
+})).digest("hex"),
   };
 }
killedBy: 包内置 oss-maintenance 模板 加载并通过模板 + RoleSet 双校验，来源标记为 builtin
statusReason: expected 'cc9a33e2007a1f5dd163e193ecb6523df3069…' to match /^[0-9a-f]{16}$/

[Killed] StringLiteral
src/runtime/template/template-loader.ts:133:85
     roles,
     prompts,
     source,
-    digest: createHash("sha256").update(JSON.stringify({ template, roles })).digest("hex").slice(0, 16),
+    digest: createHash("sha256").update(JSON.stringify({ template, roles })).digest("").slice(0, 16),
   };
 }
killedBy: 包内置 oss-maintenance 模板 加载并通过模板 + RoleSet 双校验，来源标记为 builtin
statusReason: .toMatch() expects to receive a string, but got object

[Killed] BlockStatement
src/runtime/template/template-loader.ts:137:58
   };
 }
 
-async function readFile2(dir: string): Promise<string[]> {
-  return readdir(dir);
-}
+async function readFile2(dir: string): Promise<string[]> {}
 
 /** 实例化快照：模板 + 角色 + 来源标记 + digest + 工作区（写入 TEAM_HOME/team.yaml 的对象）。 */
killedBy: team_reconcile overview 一次调用返回快照摘要、成员对照、状态分布、事件游标与 goal 占位
statusReason: Cannot read properties of undefined (reading 'sort')

[Killed] LogicalOperator
src/runtime/template/template-loader.ts:155:22
     source: loaded.source,
     digest: loaded.digest,
     // Tier-0 规程摘要（#42）：仅审计字段；旧快照无此字段按缺省容忍（只增不改）。
-    playbook_digest: playbookDigest ?? null,
+    playbook_digest: playbookDigest && null,
     // 工作区持久化（ADR 0015）：audit 子命令的扫描根来源；旧快照无此字段为 null。
     workspace: workspace ?? null,
killedBy: team/create 一键建团 默认场景：init 持久化 + tier0_prompt 组装 + 快照落盘
statusReason: expected null to be '1451139dc8456f2e' // Object.is equality

[Killed] LogicalOperator
src/runtime/template/template-loader.ts:157:16
     // Tier-0 规程摘要（#42）：仅审计字段；旧快照无此字段按缺省容忍（只增不改）。
     playbook_digest: playbookDigest ?? null,
     // 工作区持久化（ADR 0015）：audit 子命令的扫描根来源；旧快照无此字段为 null。
-    workspace: workspace ?? null,
+    workspace: workspace && null,
     // 系统提示词（ADR 0023）：供 host systemPrompt 注入读取；旧快照无此字段为 null。
     system_prompt: systemPrompt ?? null,
killedBy: team_reconcile scope=audit 双向 diff：未登记文件命中、登记在案不误报、过期登记入 stale
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/runtime/template/template-loader.ts:159:20
     // 工作区持久化（ADR 0015）：audit 子命令的扫描根来源；旧快照无此字段为 null。
     workspace: workspace ?? null,
     // 系统提示词（ADR 0023）：供 host systemPrompt 注入读取；旧快照无此字段为 null。
-    system_prompt: systemPrompt ?? null,
+    system_prompt: systemPrompt && null,
     // brief 工件化标志（#212 P0-1）：init 时框架已落盘 brief → true；
     // 存量快照无此字段 → null → protocol_health 的 brief 检测输出
killedBy: team/create 一键建团 默认场景：init 持久化 + tier0_prompt 组装 + 快照落盘
statusReason: expected null to be '# Tier-0 Master Orchestration Playboo…' // Object.is equality

[Killed] ConditionalExpression
src/runtime/template/template-loader.ts:163:30
     // brief 工件化标志（#212 P0-1）：init 时框架已落盘 brief → true；
     // 存量快照无此字段 → null → protocol_health 的 brief 检测输出
     // not-applicable（防升级后存量实例全量误报）。旧快照按缺省容忍（只增不改）。
-    brief_framework_written: briefFrameworkWritten === true ? true : null,
+    brief_framework_written: false ? true : null,
     // 黑板产出义务角色清单（#212 P0-2，模板声明、机器可读）：blackboard_silent
     // 检测的前置条件——空/缺失 = 检测 not-applicable（ADR 0015 确定性/判断性
killedBy: P0-1 init brief 工件化 team.yaml 快照带 brief_framework_written=true（存量实例无字段 → not-applicable）
statusReason: expected null to be true // Object.is equality

[Killed] EqualityOperator
src/runtime/template/template-loader.ts:163:30
     // brief 工件化标志（#212 P0-1）：init 时框架已落盘 brief → true；
     // 存量快照无此字段 → null → protocol_health 的 brief 检测输出
     // not-applicable（防升级后存量实例全量误报）。旧快照按缺省容忍（只增不改）。
-    brief_framework_written: briefFrameworkWritten === true ? true : null,
+    brief_framework_written: briefFrameworkWritten !== true ? true : null,
     // 黑板产出义务角色清单（#212 P0-2，模板声明、机器可读）：blackboard_silent
     // 检测的前置条件——空/缺失 = 检测 not-applicable（ADR 0015 确定性/判断性
killedBy: P0-1 init brief 工件化 team.yaml 快照带 brief_framework_written=true（存量实例无字段 → not-applicable）
statusReason: expected null to be true // Object.is equality

[Survived] LogicalOperator
src/runtime/template/template-loader.ts:175:16
       : [],
     // 通讯模式与 explicit 白名单（#138）：运行时可达性判定的载体；旧快照无
     // 此字段按缺省容忍（只增不改）——读取侧以 `comm_mode ?? "auto"` 归一。
-    comm_mode: loaded.template.comm_mode ?? "auto",
+    comm_mode: loaded.template.comm_mode && "auto",
     comm: Array.isArray(loaded.template.comm) ? loaded.template.comm : [],
     tiers: loaded.template.tiers,

[Survived] ArrayDeclaration
src/runtime/template/template-loader.ts:176:72
     // 通讯模式与 explicit 白名单（#138）：运行时可达性判定的载体；旧快照无
     // 此字段按缺省容忍（只增不改）——读取侧以 `comm_mode ?? "auto"` 归一。
     comm_mode: loaded.template.comm_mode ?? "auto",
-    comm: Array.isArray(loaded.template.comm) ? loaded.template.comm : [],
+    comm: Array.isArray(loaded.template.comm) ? loaded.template.comm : ["Stryker was here"],
     tiers: loaded.template.tiers,
     roles: Object.values(loaded.roles).map((r) => ({

[Killed] ArrowFunction
src/runtime/template/template-loader.ts:178:44
     comm_mode: loaded.template.comm_mode ?? "auto",
     comm: Array.isArray(loaded.template.comm) ? loaded.template.comm : [],
     tiers: loaded.template.tiers,
-    roles: Object.values(loaded.roles).map((r) => ({
-      id: r.id,
-      prompt_inlined: loaded.prompts[String(r.prompt)] ?? null,
-      briefing: r.briefing ?? null,
-      dod: r.dod ?? [],
-      max_hops: r.max_hops ?? 3,
-      as_judge: r.as_judge === true,
-    })),
+    roles: Object.values(loaded.roles).map(() => undefined),
     instantiated_at: Date.now(),
   };
killedBy: 包内置 oss-maintenance 模板 实例化快照：携带来源标记、digest 与内联 prompt
statusReason: Cannot read properties of undefined (reading 'prompt_inlined')

[Killed] LogicalOperator
src/runtime/template/template-loader.ts:180:23
     tiers: loaded.template.tiers,
     roles: Object.values(loaded.roles).map((r) => ({
       id: r.id,
-      prompt_inlined: loaded.prompts[String(r.prompt)] ?? null,
+      prompt_inlined: loaded.prompts[String(r.prompt)] && null,
       briefing: r.briefing ?? null,
       dod: r.dod ?? [],
killedBy: 包内置 oss-maintenance 模板 实例化快照：携带来源标记、digest 与内联 prompt
statusReason: expected null to be truthy

[Survived] LogicalOperator
src/runtime/template/template-loader.ts:181:17
     roles: Object.values(loaded.roles).map((r) => ({
       id: r.id,
       prompt_inlined: loaded.prompts[String(r.prompt)] ?? null,
-      briefing: r.briefing ?? null,
+      briefing: r.briefing && null,
       dod: r.dod ?? [],
       max_hops: r.max_hops ?? 3,

[Survived] LogicalOperator
src/runtime/template/template-loader.ts:182:12
       id: r.id,
       prompt_inlined: loaded.prompts[String(r.prompt)] ?? null,
       briefing: r.briefing ?? null,
-      dod: r.dod ?? [],
+      dod: r.dod && [],
       max_hops: r.max_hops ?? 3,
       as_judge: r.as_judge === true,

[Survived] LogicalOperator
src/runtime/template/template-loader.ts:183:17
       prompt_inlined: loaded.prompts[String(r.prompt)] ?? null,
       briefing: r.briefing ?? null,
       dod: r.dod ?? [],
-      max_hops: r.max_hops ?? 3,
+      max_hops: r.max_hops && 3,
       as_judge: r.as_judge === true,
     })),

[Survived] ConditionalExpression
src/runtime/template/template-loader.ts:184:17
       briefing: r.briefing ?? null,
       dod: r.dod ?? [],
       max_hops: r.max_hops ?? 3,
-      as_judge: r.as_judge === true,
+      as_judge: false,
     })),
     instantiated_at: Date.now(),

[Survived] BooleanLiteral
src/runtime/template/template-loader.ts:184:32
       briefing: r.briefing ?? null,
       dod: r.dod ?? [],
       max_hops: r.max_hops ?? 3,
-      as_judge: r.as_judge === true,
+      as_judge: r.as_judge === false,
     })),
     instantiated_at: Date.now(),

[Killed] BlockStatement
src/runtime/template/template-loader.ts:191:65
 }
 
 /** 便捷：包内置只读模板目录（builtin 来源）。 */
-export function builtinScenarioDir(packageRoot: string): string {
-  return join(packageRoot, "templates", "oss-maintenance");
-}
+export function builtinScenarioDir(packageRoot: string): string {}
 
 /** Tier-0 规程加载结果：全文 + 内容摘要（sha256 前 16 位，仅审计字段）。 */
killedBy: 加载器拒绝语义 内置场景目录解析指向 templates/oss-maintenance
statusReason: expected undefined to be '/pkg/root/templates/oss-maintenance' // Object.is equality
