[Killed] BlockStatement
src/runtime/template/template-loader.ts:206:71
  * 同步读取：文件随包分发、体量小，且缺失即发布物损坏——直接抛错，
  * 不参与 ADR 0002 三级来源与错误码契约（非用户输入引发）。
  */
-export function loadTier0Playbook(packageRoot: string): Tier0Playbook {
-  const path = join(packageRoot, PLAYBOOKS_DIR, TIER0_PLAYBOOK_FILE);
-  const text = readFileSync(path, "utf8");
-  return { text, digest: createHash("sha256").update(text).digest("hex").slice(0, 16) };
-}
+export function loadTier0Playbook(packageRoot: string): Tier0Playbook {}
 
 /**
killedBy: team_reconcile overview 一次调用返回快照摘要、成员对照、状态分布、事件游标与 goal 占位
statusReason: Cannot read properties of undefined (reading 'text')

[Killed] StringLiteral
src/runtime/template/template-loader.ts:208:35
  */
 export function loadTier0Playbook(packageRoot: string): Tier0Playbook {
   const path = join(packageRoot, PLAYBOOKS_DIR, TIER0_PLAYBOOK_FILE);
-  const text = readFileSync(path, "utf8");
+  const text = readFileSync(path, "");
   return { text, digest: createHash("sha256").update(text).digest("hex").slice(0, 16) };
 }
killedBy: tier0_prompt 组装稳定性 规程 digest 与 playbook 文件内容一一对应（跨实例共享前缀的前提）
statusReason: expected Buffer[ 35, 32, 84, 105, 101, …(8966) ] to be Buffer[ 35, 32, 84, 105, 101, …(8966) ] // Object.is equality

If it should pass with deep equality, replace "toBe" with "toStrictEqual"

Expected: Buffer[ 35, 32, 84, 105, 101, …(8966) ]
Received: serializes to the same string

[Killed] MethodExpression
src/runtime/template/template-loader.ts:209:26
 export function loadTier0Playbook(packageRoot: string): Tier0Playbook {
   const path = join(packageRoot, PLAYBOOKS_DIR, TIER0_PLAYBOOK_FILE);
   const text = readFileSync(path, "utf8");
-  return { text, digest: createHash("sha256").update(text).digest("hex").slice(0, 16) };
+  return { text, digest: createHash("sha256").update(text).digest("hex") };
 }
 
killedBy: team/create 一键建团 默认场景：init 持久化 + tier0_prompt 组装 + 快照落盘
statusReason: expected '1451139dc8456f2e21daf87f6f01062d07d2a…' to match /^[0-9a-f]{16}$/

[Killed] BlockStatement
src/runtime/template/template-loader.ts:216:94
  * tier0_prompt 组装（#42 显式协议）：规程全文 + 固定分隔符 + 场景 tiers[0].prompt。
  * 对任意场景成立——单层模板（如 research-report）实例化后同样获得规程全文。
  */
-export function assembleTier0Prompt(playbook: Tier0Playbook, scenarioPrompt: string): string {
-  return playbook.text + TIER0_PLAYBOOK_SEPARATOR + scenarioPrompt;
-}
+export function assembleTier0Prompt(playbook: Tier0Playbook, scenarioPrompt: string): string {}
 
 export interface ActivationPromptParams {
killedBy: team/create 一键建团 默认场景：init 持久化 + tier0_prompt 组装 + 快照落盘
statusReason: expected 409 to be 200 // Object.is equality

[Killed] ArithmeticOperator
src/runtime/template/template-loader.ts:217:10
  * 对任意场景成立——单层模板（如 research-report）实例化后同样获得规程全文。
  */
 export function assembleTier0Prompt(playbook: Tier0Playbook, scenarioPrompt: string): string {
-  return playbook.text + TIER0_PLAYBOOK_SEPARATOR + scenarioPrompt;
+  return playbook.text - TIER0_PLAYBOOK_SEPARATOR + scenarioPrompt;
 }
 
killedBy: tier0_prompt 组装稳定性 同输入两次调用字节级一致，且静态规程整体前置
statusReason: expected false to be true // Object.is equality

[Killed] ArithmeticOperator
src/runtime/template/template-loader.ts:217:10
  * 对任意场景成立——单层模板（如 research-report）实例化后同样获得规程全文。
  */
 export function assembleTier0Prompt(playbook: Tier0Playbook, scenarioPrompt: string): string {
-  return playbook.text + TIER0_PLAYBOOK_SEPARATOR + scenarioPrompt;
+  return playbook.text + TIER0_PLAYBOOK_SEPARATOR - scenarioPrompt;
 }
 
killedBy: team/create 一键建团 默认场景：init 持久化 + tier0_prompt 组装 + 快照落盘
statusReason: expected 409 to be 200 // Object.is equality

[Killed] StringLiteral
src/runtime/template/template-loader.ts:242:39
 export const BRIEF_REL_PATH = "rooms/root/brief/user-request.md";
 
 /** brief 落盘水印标记：检测器以此区分 framework_written / master_written（#212）。 */
-export const BRIEF_FRAMEWORK_MARKER = "framework-written";
+export const BRIEF_FRAMEWORK_MARKER = "";
 
 /**
killedBy: P0-1 init brief 工件化 master 补写（无水印）不被同会话重入覆盖
statusReason: expected '<!-- : verbatim user objective artifa…' to be 'master rewrote: takeover reconstructi…' // Object.is equality

[Killed] ArithmeticOperator
src/runtime/template/template-loader.ts:248:32
  * brief 原子写大小上限（字节）：超长 user_prompt 截断 + 标注，
  * 防撑爆成员读回上下文（#212 评审 3.2）。
  */
-export const BRIEF_MAX_BYTES = 64 * 1024;
+export const BRIEF_MAX_BYTES = 64 / 1024;
 
 /**
killedBy: P0-1 init brief 工件化 user_prompt 非空：brief 在场且水印外与 user_prompt 逐字节一致
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/runtime/template/template-loader.ts:254:66
  * 构造 brief 锚点文件内容（#212 P0-1）：水印头 + verbatim 原文直通。
  * 空输入写占位（与 activation 兜底占位同源）；超限截断并标注。
  */
-export function briefMarkdown(userPrompt: string | null): string {
-  const raw = (userPrompt ?? "").trim();
-  const truncated = Buffer.byteLength(raw, "utf8") > BRIEF_MAX_BYTES;
-  const body =
-    raw.length === 0
-      ? USER_OBJECTIVE_PLACEHOLDER
-      : truncated
-        ? `${Buffer.from(raw, "utf8").subarray(0, BRIEF_MAX_BYTES).toString("utf8")}\n\n[truncated: exceeded ${BRIEF_MAX_BYTES} bytes limit]`
-        : raw;
-  return [
-    `<!-- ${BRIEF_FRAMEWORK_MARKER}: verbatim user objective artifact; master MUST NOT rewrite -->`,
-    "",
-    "# User Objective (verbatim)",
-    "",
-    body,
-    "",
-  ].join("\n");
-}
+export function briefMarkdown(userPrompt: string | null): string {}
 
 /**
killedBy: P0-1 init brief 工件化 user_prompt 非空：brief 在场且水印外与 user_prompt 逐字节一致
statusReason: expected '' to contain 'framework-written'

[Killed] LogicalOperator
src/runtime/template/template-loader.ts:255:16
  * 空输入写占位（与 activation 兜底占位同源）；超限截断并标注。
  */
 export function briefMarkdown(userPrompt: string | null): string {
-  const raw = (userPrompt ?? "").trim();
+  const raw = (userPrompt && "").trim();
   const truncated = Buffer.byteLength(raw, "utf8") > BRIEF_MAX_BYTES;
   const body =
killedBy: P0-1 init brief 工件化 user_prompt 非空：brief 在场且水印外与 user_prompt 逐字节一致
statusReason: expected false to be true // Object.is equality

[Survived] MethodExpression
src/runtime/template/template-loader.ts:255:15
  * 空输入写占位（与 activation 兜底占位同源）；超限截断并标注。
  */
 export function briefMarkdown(userPrompt: string | null): string {
-  const raw = (userPrompt ?? "").trim();
+  const raw = userPrompt ?? "";
   const truncated = Buffer.byteLength(raw, "utf8") > BRIEF_MAX_BYTES;
   const body =

[Killed] EqualityOperator
src/runtime/template/template-loader.ts:256:21
  */
 export function briefMarkdown(userPrompt: string | null): string {
   const raw = (userPrompt ?? "").trim();
-  const truncated = Buffer.byteLength(raw, "utf8") > BRIEF_MAX_BYTES;
+  const truncated = Buffer.byteLength(raw, "utf8") <= BRIEF_MAX_BYTES;
   const body =
     raw.length === 0
killedBy: P0-1 init brief 工件化 user_prompt 非空：brief 在场且水印外与 user_prompt 逐字节一致
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/runtime/template/template-loader.ts:256:21
  */
 export function briefMarkdown(userPrompt: string | null): string {
   const raw = (userPrompt ?? "").trim();
-  const truncated = Buffer.byteLength(raw, "utf8") > BRIEF_MAX_BYTES;
+  const truncated = true;
   const body =
     raw.length === 0
killedBy: P0-1 init brief 工件化 user_prompt 非空：brief 在场且水印外与 user_prompt 逐字节一致
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/runtime/template/template-loader.ts:258:5
   const raw = (userPrompt ?? "").trim();
   const truncated = Buffer.byteLength(raw, "utf8") > BRIEF_MAX_BYTES;
   const body =
-    raw.length === 0
+    false
       ? USER_OBJECTIVE_PLACEHOLDER
       : truncated
killedBy: P0-1 init brief 工件化 空输入写占位（与 activation 兜底占位同源）
statusReason: expected '<!-- framework-written: verbatim user…' to contain '(No initial user objective provided. …'

[Killed] EqualityOperator
src/runtime/template/template-loader.ts:258:5
   const raw = (userPrompt ?? "").trim();
   const truncated = Buffer.byteLength(raw, "utf8") > BRIEF_MAX_BYTES;
   const body =
-    raw.length === 0
+    raw.length !== 0
       ? USER_OBJECTIVE_PLACEHOLDER
       : truncated
killedBy: P0-1 init brief 工件化 user_prompt 非空：brief 在场且水印外与 user_prompt 逐字节一致
statusReason: expected false to be true // Object.is equality

[NoCoverage] StringLiteral
src/runtime/template/template-loader.ts:261:11
     raw.length === 0
       ? USER_OBJECTIVE_PLACEHOLDER
       : truncated
-        ? `${Buffer.from(raw, "utf8").subarray(0, BRIEF_MAX_BYTES).toString("utf8")}\n\n[truncated: exceeded ${BRIEF_MAX_BYTES} bytes limit]`
+        ? ``
         : raw;
   return [

[Killed] LogicalOperator
src/runtime/template/template-loader.ts:278:24
  * 包含用户原始目标（保持原文直通）、实例元数据与首轮行动指令。
  */
 export function buildActivationPrompt(params: ActivationPromptParams): string {
-  const userRequest = (params.userPrompt ?? "").trim();
+  const userRequest = (params.userPrompt && "").trim();
   const objectiveSection =
     userRequest.length > 0
killedBy: team/create 一键建团 默认场景：init 持久化 + tier0_prompt 组装 + 快照落盘
statusReason: expected 409 to be 200 // Object.is equality

[Survived] MethodExpression
src/runtime/template/template-loader.ts:278:23
  * 包含用户原始目标（保持原文直通）、实例元数据与首轮行动指令。
  */
 export function buildActivationPrompt(params: ActivationPromptParams): string {
-  const userRequest = (params.userPrompt ?? "").trim();
+  const userRequest = params.userPrompt ?? "";
   const objectiveSection =
     userRequest.length > 0

[Survived] EqualityOperator
src/runtime/template/template-loader.ts:280:5
 export function buildActivationPrompt(params: ActivationPromptParams): string {
   const userRequest = (params.userPrompt ?? "").trim();
   const objectiveSection =
-    userRequest.length > 0
+    userRequest.length <= 0
       ? `## User Objective\n${userRequest}`
       : `## User Objective\n${USER_OBJECTIVE_PLACEHOLDER}`;

[Survived] ConditionalExpression
src/runtime/template/template-loader.ts:280:5
 export function buildActivationPrompt(params: ActivationPromptParams): string {
   const userRequest = (params.userPrompt ?? "").trim();
   const objectiveSection =
-    userRequest.length > 0
+    false
       ? `## User Objective\n${userRequest}`
       : `## User Objective\n${USER_OBJECTIVE_PLACEHOLDER}`;

[NoCoverage] ArrayDeclaration
src/runtime/template/template-loader.ts:287:31
   const metaItems = [
     `- **Scenario**: ${params.scenario}`,
     ...(params.workspace ? [`- **Workspace**: ${params.workspace}`] : []),
-    ...(params.instanceNote ? [`- **Note**: ${params.instanceNote}`] : []),
+    ...(params.instanceNote ? [] : []),
   ];
 

[Killed] BlockStatement
src/runtime/template/template-loader.ts:307:67
 }
 
 /** 包内模板根目录（builtin 场景白名单根，#51 入口承载场景选择）。 */
-export function builtinTemplatesRoot(packageRoot: string): string {
-  return join(packageRoot, "templates");
-}
+export function builtinTemplatesRoot(packageRoot: string): string {}
 
 /** 缺省场景名（入口/工具未指定时）。 */
killedBy: team_dispatch 正常链路 spawn→assign→send 三步全成，注册表/账本/信箱/事件流逐项核对
statusReason: The "path" argument must be of type string. Received undefined

[Survived] Regex
src/runtime/template/template-loader.ts:314:33
 /** 缺省场景名（入口/工具未指定时）。 */
 export const DEFAULT_SCENARIO = "oss-maintenance";
 /** 场景名安全形态：防路径拼接；目录存在性另行校验。 */
-export const SCENARIO_PATTERN = /^[a-z0-9-]+$/;
+export const SCENARIO_PATTERN = /^[a-z0-9-]+/;
 
 /**

[Killed] ObjectLiteral
src/runtime/template/template-loader.ts:332:54
 }
 
 /** 三级固定枚举顺序：builtin → user → project（同源内再按名称字典序）。 */
-const SOURCE_ORDER: Record<TemplateSource, number> = { builtin: 0, user: 1, project: 2 };
+const SOURCE_ORDER: Record<TemplateSource, number> = {};
 
 /**
killedBy: 三级来源解析（ADR 0013） 枚举：三级实时扫描、同名多行并存、builtin→user→project 固定序
statusReason: expected [ 'user:alpha', …(5) ] to deeply equal [ 'builtin:oss-maintenance', …(5) ]

[Killed] BooleanLiteral
src/runtime/template/template-loader.ts:348:7
   scenario: string,
   requestedSource?: TemplateSource,
 ): { dir: string; source: TemplateSource } {
-  if (!SCENARIO_PATTERN.test(scenario)) {
+  if (SCENARIO_PATTERN.test(scenario)) {
     throw new Error(`unknown-scenario: invalid scenario name "${scenario}"`);
   }
killedBy: team_reconcile overview 一次调用返回快照摘要、成员对照、状态分布、事件游标与 goal 占位
statusReason: unknown-scenario: invalid scenario name "oss-maintenance"

[Killed] ConditionalExpression
src/runtime/template/template-loader.ts:348:7
   scenario: string,
   requestedSource?: TemplateSource,
 ): { dir: string; source: TemplateSource } {
-  if (!SCENARIO_PATTERN.test(scenario)) {
+  if (true) {
     throw new Error(`unknown-scenario: invalid scenario name "${scenario}"`);
   }
killedBy: team_reconcile overview 一次调用返回快照摘要、成员对照、状态分布、事件游标与 goal 占位
statusReason: unknown-scenario: invalid scenario name "oss-maintenance"

[Killed] BlockStatement
src/runtime/template/template-loader.ts:352:29
     throw new Error(`unknown-scenario: invalid scenario name "${scenario}"`);
   }
   const matches: Array<{ dir: string; source: TemplateSource }> = [];
-  for (const root of roots) {
-    if (requestedSource !== undefined && root.source !== requestedSource) continue;
-    if (existsSync(join(root.dir, scenario, TEAM_FILE))) {
-      matches.push({ dir: join(root.dir, scenario), source: root.source });
-    }
-  }
+  for (const root of roots) {}
   if (requestedSource !== undefined) {
     if (matches.length === 0) {
killedBy: team_reconcile overview 一次调用返回快照摘要、成员对照、状态分布、事件游标与 goal 占位
statusReason: unknown-scenario: no template "oss-maintenance"

[Killed] ConditionalExpression
src/runtime/template/template-loader.ts:353:42
   }
   const matches: Array<{ dir: string; source: TemplateSource }> = [];
   for (const root of roots) {
-    if (requestedSource !== undefined && root.source !== requestedSource) continue;
+    if (requestedSource !== undefined && true) continue;
     if (existsSync(join(root.dir, scenario, TEAM_FILE))) {
       matches.push({ dir: join(root.dir, scenario), source: root.source });
killedBy: 三级来源解析（ADR 0013） 指定 source 消歧：命中该层；该层缺失 → unknown-scenario
statusReason: unknown-scenario: no user template "dup"

[Killed] EqualityOperator
src/runtime/template/template-loader.ts:353:9
   }
   const matches: Array<{ dir: string; source: TemplateSource }> = [];
   for (const root of roots) {
-    if (requestedSource !== undefined && root.source !== requestedSource) continue;
+    if (requestedSource === undefined && root.source !== requestedSource) continue;
     if (existsSync(join(root.dir, scenario, TEAM_FILE))) {
       matches.push({ dir: join(root.dir, scenario), source: root.source });
killedBy: team_reconcile overview 一次调用返回快照摘要、成员对照、状态分布、事件游标与 goal 占位
statusReason: unknown-scenario: no template "oss-maintenance"

[Killed] BlockStatement
src/runtime/template/template-loader.ts:354:58
   const matches: Array<{ dir: string; source: TemplateSource }> = [];
   for (const root of roots) {
     if (requestedSource !== undefined && root.source !== requestedSource) continue;
-    if (existsSync(join(root.dir, scenario, TEAM_FILE))) {
-      matches.push({ dir: join(root.dir, scenario), source: root.source });
-    }
+    if (existsSync(join(root.dir, scenario, TEAM_FILE))) {}
   }
   if (requestedSource !== undefined) {
killedBy: 三级来源解析（ADR 0013） 唯一场景：resolveScenarioDir 直接命中，标记正确来源
statusReason: unknown-scenario: no template "alpha"

[Killed] ConditionalExpression
src/runtime/template/template-loader.ts:354:9
   const matches: Array<{ dir: string; source: TemplateSource }> = [];
   for (const root of roots) {
     if (requestedSource !== undefined && root.source !== requestedSource) continue;
-    if (existsSync(join(root.dir, scenario, TEAM_FILE))) {
+    if (false) {
       matches.push({ dir: join(root.dir, scenario), source: root.source });
     }
killedBy: team/create 一键建团 默认场景：init 持久化 + tier0_prompt 组装 + 快照落盘
statusReason: expected 400 to be 200 // Object.is equality

[Killed] ObjectLiteral
src/runtime/template/template-loader.ts:355:20
   for (const root of roots) {
     if (requestedSource !== undefined && root.source !== requestedSource) continue;
     if (existsSync(join(root.dir, scenario, TEAM_FILE))) {
-      matches.push({ dir: join(root.dir, scenario), source: root.source });
+      matches.push({});
     }
   }
killedBy: team_reconcile overview 一次调用返回快照摘要、成员对照、状态分布、事件游标与 goal 占位
statusReason: The "path" argument must be of type string. Received undefined

[Killed] EqualityOperator
src/runtime/template/template-loader.ts:358:7
       matches.push({ dir: join(root.dir, scenario), source: root.source });
     }
   }
-  if (requestedSource !== undefined) {
+  if (requestedSource === undefined) {
     if (matches.length === 0) {
       throw new Error(`unknown-scenario: no ${requestedSource} template "${scenario}"`);
killedBy: team/create 一键建团 同名场景（user+project）未指定 source → ambiguous-scenario（HTTP 400）
statusReason: expected 200 to be 400 // Object.is equality

[Killed] ConditionalExpression
src/runtime/template/template-loader.ts:358:7
       matches.push({ dir: join(root.dir, scenario), source: root.source });
     }
   }
-  if (requestedSource !== undefined) {
+  if (true) {
     if (matches.length === 0) {
       throw new Error(`unknown-scenario: no ${requestedSource} template "${scenario}"`);
killedBy: 三级来源解析（ADR 0013） 同名未指定 source → ambiguous-scenario（绝不静默择一）
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/runtime/template/template-loader.ts:359:9
     }
   }
   if (requestedSource !== undefined) {
-    if (matches.length === 0) {
+    if (true) {
       throw new Error(`unknown-scenario: no ${requestedSource} template "${scenario}"`);
     }
killedBy: 三级来源解析（ADR 0013） 指定 source 消歧：命中该层；该层缺失 → unknown-scenario
statusReason: unknown-scenario: no user template "dup"

[Killed] BlockStatement
src/runtime/template/template-loader.ts:359:31
     }
   }
   if (requestedSource !== undefined) {
-    if (matches.length === 0) {
-      throw new Error(`unknown-scenario: no ${requestedSource} template "${scenario}"`);
-    }
+    if (matches.length === 0) {}
     return matches[0]!;
   }
killedBy: 三级来源解析（ADR 0013） 指定 source 消歧：命中该层；该层缺失 → unknown-scenario
statusReason: expected [Function] to throw an error

[Killed] StringLiteral
src/runtime/template/template-loader.ts:360:23
   }
   if (requestedSource !== undefined) {
     if (matches.length === 0) {
-      throw new Error(`unknown-scenario: no ${requestedSource} template "${scenario}"`);
+      throw new Error(``);
     }
     return matches[0]!;
killedBy: 三级来源解析（ADR 0013） 指定 source 消歧：命中该层；该层缺失 → unknown-scenario
statusReason: expected [Function] to throw error matching /unknown-scenario/ but got ''

[Killed] EqualityOperator
src/runtime/template/template-loader.ts:364:7
     }
     return matches[0]!;
   }
-  if (matches.length === 0) {
+  if (matches.length !== 0) {
     throw new Error(`unknown-scenario: no template "${scenario}"`);
   }
killedBy: 三级来源解析（ADR 0013） 唯一场景：resolveScenarioDir 直接命中，标记正确来源
statusReason: unknown-scenario: no template "alpha"

[Killed] BlockStatement
src/runtime/template/template-loader.ts:364:29
     }
     return matches[0]!;
   }
-  if (matches.length === 0) {
-    throw new Error(`unknown-scenario: no template "${scenario}"`);
-  }
+  if (matches.length === 0) {}
   if (matches.length > 1) {
     const sources = matches.map((m) => m.source).join(",");
killedBy: 三级来源解析（ADR 0013） 不存在的场景 → unknown-scenario
statusReason: expected [Function] to throw an error

[Killed] StringLiteral
src/runtime/template/template-loader.ts:365:21
     return matches[0]!;
   }
   if (matches.length === 0) {
-    throw new Error(`unknown-scenario: no template "${scenario}"`);
+    throw new Error(``);
   }
   if (matches.length > 1) {
killedBy: 三级来源解析（ADR 0013） 不存在的场景 → unknown-scenario
statusReason: expected [Function] to throw error matching /unknown-scenario/ but got ''

[Killed] EqualityOperator
src/runtime/template/template-loader.ts:367:7
   if (matches.length === 0) {
     throw new Error(`unknown-scenario: no template "${scenario}"`);
   }
-  if (matches.length > 1) {
+  if (matches.length >= 1) {
     const sources = matches.map((m) => m.source).join(",");
     throw new Error(`ambiguous-scenario: "${scenario}" exists in multiple sources (${sources})`);
killedBy: 三级来源解析（ADR 0013） 唯一场景：resolveScenarioDir 直接命中，标记正确来源
statusReason: ambiguous-scenario: "alpha" exists in multiple sources (user)

[Killed] EqualityOperator
src/runtime/template/template-loader.ts:367:7
   if (matches.length === 0) {
     throw new Error(`unknown-scenario: no template "${scenario}"`);
   }
-  if (matches.length > 1) {
+  if (matches.length <= 1) {
     const sources = matches.map((m) => m.source).join(",");
     throw new Error(`ambiguous-scenario: "${scenario}" exists in multiple sources (${sources})`);
killedBy: 三级来源解析（ADR 0013） 唯一场景：resolveScenarioDir 直接命中，标记正确来源
statusReason: ambiguous-scenario: "alpha" exists in multiple sources (user)

[Survived] ArrowFunction
src/runtime/template/template-loader.ts:368:33
     throw new Error(`unknown-scenario: no template "${scenario}"`);
   }
   if (matches.length > 1) {
-    const sources = matches.map((m) => m.source).join(",");
+    const sources = matches.map(() => undefined).join(",");
     throw new Error(`ambiguous-scenario: "${scenario}" exists in multiple sources (${sources})`);
   }

[Survived] StringLiteral
src/runtime/template/template-loader.ts:368:55
     throw new Error(`unknown-scenario: no template "${scenario}"`);
   }
   if (matches.length > 1) {
-    const sources = matches.map((m) => m.source).join(",");
+    const sources = matches.map((m) => m.source).join("");
     throw new Error(`ambiguous-scenario: "${scenario}" exists in multiple sources (${sources})`);
   }

[Killed] BlockStatement
src/runtime/template/template-loader.ts:378:71
  * 枚举三级场景（ADR 0013）：全部实时扫描、无缓存；同名场景多行并存，
  * 各带 source 供 UI 角标；排序 = 三级固定序 + 同源名称字典序。
  */
-export function listScenarios(roots: ScenarioRoot[]): ScenarioEntry[] {
-  const entries: ScenarioEntry[] = [];
-  for (const root of roots) {
-    if (!existsSync(root.dir)) continue;
-    for (const entry of readdirSync(root.dir)) {
-      if (!SCENARIO_PATTERN.test(entry)) continue;
-      if (!existsSync(join(root.dir, entry, TEAM_FILE))) continue;
-      entries.push({ name: entry, source: root.source });
-    }
-  }
-  return entries.sort(
-    (a, b) =>
-      (SOURCE_ORDER[a.source] ?? 99) - (SOURCE_ORDER[b.source] ?? 99) ||
-      a.name.localeCompare(b.name),
-  );
-}
+export function listScenarios(roots: ScenarioRoot[]): ScenarioEntry[] {}
 
 /**
killedBy: 三级来源解析（ADR 0013） 枚举：三级实时扫描、同名多行并存、builtin→user→project 固定序
statusReason: Cannot read properties of undefined (reading 'filter')

[Killed] BlockStatement
src/runtime/template/template-loader.ts:380:29
  */
 export function listScenarios(roots: ScenarioRoot[]): ScenarioEntry[] {
   const entries: ScenarioEntry[] = [];
-  for (const root of roots) {
-    if (!existsSync(root.dir)) continue;
-    for (const entry of readdirSync(root.dir)) {
-      if (!SCENARIO_PATTERN.test(entry)) continue;
-      if (!existsSync(join(root.dir, entry, TEAM_FILE))) continue;
-      entries.push({ name: entry, source: root.source });
-    }
-  }
+  for (const root of roots) {}
   return entries.sort(
     (a, b) =>
killedBy: 三级来源解析（ADR 0013） 枚举：三级实时扫描、同名多行并存、builtin→user→project 固定序
statusReason: expected [] to deeply equal [ 'builtin', 'user', 'project' ]

[Killed] BooleanLiteral
src/runtime/template/template-loader.ts:381:9
 export function listScenarios(roots: ScenarioRoot[]): ScenarioEntry[] {
   const entries: ScenarioEntry[] = [];
   for (const root of roots) {
-    if (!existsSync(root.dir)) continue;
+    if (existsSync(root.dir)) continue;
     for (const entry of readdirSync(root.dir)) {
       if (!SCENARIO_PATTERN.test(entry)) continue;
killedBy: 场景枚举 列出全部 builtin 场景（oss-maintenance + research-report）带 source 标记
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ConditionalExpression
src/runtime/template/template-loader.ts:381:9
 export function listScenarios(roots: ScenarioRoot[]): ScenarioEntry[] {
   const entries: ScenarioEntry[] = [];
   for (const root of roots) {
-    if (!existsSync(root.dir)) continue;
+    if (false) continue;
     for (const entry of readdirSync(root.dir)) {
       if (!SCENARIO_PATTERN.test(entry)) continue;
killedBy: 场景枚举 列出全部 builtin 场景（oss-maintenance + research-report）带 source 标记
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/runtime/template/template-loader.ts:382:48
   const entries: ScenarioEntry[] = [];
   for (const root of roots) {
     if (!existsSync(root.dir)) continue;
-    for (const entry of readdirSync(root.dir)) {
-      if (!SCENARIO_PATTERN.test(entry)) continue;
-      if (!existsSync(join(root.dir, entry, TEAM_FILE))) continue;
-      entries.push({ name: entry, source: root.source });
-    }
+    for (const entry of readdirSync(root.dir)) {}
   }
   return entries.sort(
killedBy: 三级来源解析（ADR 0013） 枚举：三级实时扫描、同名多行并存、builtin→user→project 固定序
statusReason: expected [] to deeply equal [ 'builtin', 'user', 'project' ]

[Killed] ConditionalExpression
src/runtime/template/template-loader.ts:383:11
   for (const root of roots) {
     if (!existsSync(root.dir)) continue;
     for (const entry of readdirSync(root.dir)) {
-      if (!SCENARIO_PATTERN.test(entry)) continue;
+      if (true) continue;
       if (!existsSync(join(root.dir, entry, TEAM_FILE))) continue;
       entries.push({ name: entry, source: root.source });
killedBy: 场景枚举 列出全部 builtin 场景（oss-maintenance + research-report）带 source 标记
statusReason: expected [] to deeply equal [ …(2) ]

[Killed] BooleanLiteral
src/runtime/template/template-loader.ts:383:11
   for (const root of roots) {
     if (!existsSync(root.dir)) continue;
     for (const entry of readdirSync(root.dir)) {
-      if (!SCENARIO_PATTERN.test(entry)) continue;
+      if (SCENARIO_PATTERN.test(entry)) continue;
       if (!existsSync(join(root.dir, entry, TEAM_FILE))) continue;
       entries.push({ name: entry, source: root.source });
killedBy: 场景枚举 列出全部 builtin 场景（oss-maintenance + research-report）带 source 标记
statusReason: expected [] to deeply equal [ …(2) ]

[Killed] ConditionalExpression
src/runtime/template/template-loader.ts:384:11
     if (!existsSync(root.dir)) continue;
     for (const entry of readdirSync(root.dir)) {
       if (!SCENARIO_PATTERN.test(entry)) continue;
-      if (!existsSync(join(root.dir, entry, TEAM_FILE))) continue;
+      if (true) continue;
       entries.push({ name: entry, source: root.source });
     }
killedBy: 场景枚举 列出全部 builtin 场景（oss-maintenance + research-report）带 source 标记
statusReason: expected [] to deeply equal [ …(2) ]

[Killed] ConditionalExpression
src/runtime/template/template-loader.ts:384:11
     if (!existsSync(root.dir)) continue;
     for (const entry of readdirSync(root.dir)) {
       if (!SCENARIO_PATTERN.test(entry)) continue;
-      if (!existsSync(join(root.dir, entry, TEAM_FILE))) continue;
+      if (false) continue;
       entries.push({ name: entry, source: root.source });
     }
killedBy: 三级来源解析（ADR 0013） 枚举：三级实时扫描、同名多行并存、builtin→user→project 固定序
statusReason: expected [ 'builtin:oss-maintenance', …(6) ] to deeply equal [ 'builtin:oss-maintenance', …(5) ]

[Survived] MethodExpression
src/runtime/template/template-loader.ts:388:10
       entries.push({ name: entry, source: root.source });
     }
   }
-  return entries.sort(
-    (a, b) =>
-      (SOURCE_ORDER[a.source] ?? 99) - (SOURCE_ORDER[b.source] ?? 99) ||
-      a.name.localeCompare(b.name),
-  );
+  return entries;
 }
 

[Survived] ArrowFunction
src/runtime/template/template-loader.ts:389:5
     }
   }
   return entries.sort(
-    (a, b) =>
-      (SOURCE_ORDER[a.source] ?? 99) - (SOURCE_ORDER[b.source] ?? 99) ||
-      a.name.localeCompare(b.name),
+    () => undefined,
   );
 }

[Killed] LogicalOperator
src/runtime/template/template-loader.ts:390:7
   }
   return entries.sort(
     (a, b) =>
-      (SOURCE_ORDER[a.source] ?? 99) - (SOURCE_ORDER[b.source] ?? 99) ||
-      a.name.localeCompare(b.name),
+      (SOURCE_ORDER[a.source] ?? 99) - (SOURCE_ORDER[b.source] ?? 99) && a.name.localeCompare(b.name),
   );
 }
killedBy: 三级来源解析（ADR 0013） 枚举：三级实时扫描、同名多行并存、builtin→user→project 固定序
statusReason: expected [ 'user:alpha', …(5) ] to deeply equal [ 'builtin:oss-maintenance', …(5) ]

[Killed] LogicalOperator
src/runtime/template/template-loader.ts:390:41
   }
   return entries.sort(
     (a, b) =>
-      (SOURCE_ORDER[a.source] ?? 99) - (SOURCE_ORDER[b.source] ?? 99) ||
+      (SOURCE_ORDER[a.source] ?? 99) - (SOURCE_ORDER[b.source] && 99) ||
       a.name.localeCompare(b.name),
   );
killedBy: 三级来源解析（ADR 0013） 枚举：三级实时扫描、同名多行并存、builtin→user→project 固定序
statusReason: expected [ 'builtin', 'project', 'user' ] to deeply equal [ 'builtin', 'user', 'project' ]

[Killed] BlockStatement
src/runtime/template/template-loader.ts:401:90
  * （handler 层翻译为同名错误码）。
  * @deprecated 迁移至 {@link resolveScenarioDir}（三级入口）；保留兼容性封装。
  */
-export function resolveBuiltinScenarioDir(packageRoot: string, scenario: string): string {
-  return resolveScenarioDir(
-    [{ source: "builtin", dir: builtinTemplatesRoot(packageRoot) }],
-    scenario,
-  ).dir;
-}
+export function resolveBuiltinScenarioDir(packageRoot: string, scenario: string): string {}
 
 /** 枚举包内全部合法场景名（有 team.yaml 的一级子目录，实时扫描无缓存）。 */
killedBy: 向后兼容性（resolveBuiltinScenarioDir / listBuiltinScenarios） resolveBuiltinScenarioDir 仍可解析 builtin 场景
statusReason: expected undefined to be '/home/tangyi/dev/learn/dsh-plugin/git…' // Object.is equality
