[Killed] BlockStatement
src/runtime/template/template.ts:261:18
   const tiers = t.tiers as LooseRecord[] | undefined;
   tiers?.forEach((tier, i) => {
     const id = tier?.id;
-    if (str(id)) {
-      if (tierIds.has(id)) {
-        errors.push({
-          code: "tier-duplicate",
-          path: `tiers[${i}].id`,
-          message: `duplicate tier id: ${id}`,
-        });
-      } else {
-        tierIds.add(id);
-      }
-    }
+    if (str(id)) {}
   });
 
killedBy: team_reconcile overview 一次调用返回快照摘要、成员对照、状态分布、事件游标与 goal 占位
statusReason: template validation failed:
- [gate-at-unknown] team.gates[0].at: gate at references unknown tier: master

[Killed] ConditionalExpression
src/runtime/template/template.ts:262:11
   tiers?.forEach((tier, i) => {
     const id = tier?.id;
     if (str(id)) {
-      if (tierIds.has(id)) {
+      if (false) {
         errors.push({
           code: "tier-duplicate",
killedBy: Team Template 校验 tier 重复 id / gate at 引用不存在 tier
statusReason: expected [ 'gate-at-unknown' ] to include 'tier-duplicate'

[Killed] ConditionalExpression
src/runtime/template/template.ts:262:11
   tiers?.forEach((tier, i) => {
     const id = tier?.id;
     if (str(id)) {
-      if (tierIds.has(id)) {
+      if (true) {
         errors.push({
           code: "tier-duplicate",
killedBy: team_reconcile overview 一次调用返回快照摘要、成员对照、状态分布、事件游标与 goal 占位
statusReason: template validation failed:
- [tier-duplicate] team.tiers[0].id: duplicate tier id: master
- [tier-duplicate] team.tiers[1].id: duplicate tier id: issue-master
- [gate-at-unknown] team.gates[0].at: gate at references unknown tier: master

[Survived] StringLiteral
src/runtime/template/template.ts:265:17
       if (tierIds.has(id)) {
         errors.push({
           code: "tier-duplicate",
-          path: `tiers[${i}].id`,
+          path: ``,
           message: `duplicate tier id: ${id}`,
         });

[Survived] StringLiteral
src/runtime/template/template.ts:266:20
         errors.push({
           code: "tier-duplicate",
           path: `tiers[${i}].id`,
-          message: `duplicate tier id: ${id}`,
+          message: ``,
         });
       } else {

[Killed] BlockStatement
src/runtime/template/template.ts:268:14
           path: `tiers[${i}].id`,
           message: `duplicate tier id: ${id}`,
         });
-      } else {
-        tierIds.add(id);
-      }
+      } else {}
     }
   });
killedBy: team_reconcile overview 一次调用返回快照摘要、成员对照、状态分布、事件游标与 goal 占位
statusReason: template validation failed:
- [gate-at-unknown] team.gates[0].at: gate at references unknown tier: master

[Killed] CallExpression
src/runtime/template/template.ts:269:9
           message: `duplicate tier id: ${id}`,
         });
       } else {
-        tierIds.add(id);
+        ;
       }
     }
killedBy: team_reconcile overview 一次调用返回快照摘要、成员对照、状态分布、事件游标与 goal 占位
statusReason: template validation failed:
- [gate-at-unknown] team.gates[0].at: gate at references unknown tier: master

[Killed] ConditionalExpression
src/runtime/template/template.ts:277:7
   // roles：引用与覆盖形态，引用唯一
   const seen = new Set<string>();
   const roles = t.roles as unknown[] | undefined;
-  if (Array.isArray(roles) && roles.length > 0) {
+  if (false) {
     roles.forEach((role, i) => {
       const ref = typeof role === "string" ? role : (role as LooseRecord | null)?.ref;
killedBy: validateTeamTemplate 穷举负矩阵 负例：roles 元素无引用无 id -> role-ref-required
statusReason: expected [] to include 'role-ref-required'

[Killed] BlockStatement
src/runtime/template/template.ts:277:49
   // roles：引用与覆盖形态，引用唯一
   const seen = new Set<string>();
   const roles = t.roles as unknown[] | undefined;
-  if (Array.isArray(roles) && roles.length > 0) {
-    roles.forEach((role, i) => {
-      const ref = typeof role === "string" ? role : (role as LooseRecord | null)?.ref;
-      const overrideId =
-        typeof role === "object" && role !== null ? (role as LooseRecord).id : undefined;
-      const roleId = typeof ref === "string" ? ref : overrideId;
-      if (!str(roleId)) {
-        errors.push({
-          code: "role-ref-required",
-          path: `roles[${i}]`,
-          message: "role must reference a defined role id",
-        });
-        return;
-      }
-      if (seen.has(roleId)) {
-        errors.push({
-          code: "role-duplicate",
-          path: `roles[${i}]`,
-          message: `duplicate role: ${roleId}`,
-        });
-      }
-      seen.add(roleId);
-    });
-  }
+  if (Array.isArray(roles) && roles.length > 0) {}
 
   // comm：explicit 模式要求白名单且边完整
killedBy: validateTeamTemplate 穷举负矩阵 负例：roles 元素无引用无 id -> role-ref-required
statusReason: expected [] to include 'role-ref-required'

[Killed] CallExpression
src/runtime/template/template.ts:278:5
   const seen = new Set<string>();
   const roles = t.roles as unknown[] | undefined;
   if (Array.isArray(roles) && roles.length > 0) {
-    roles.forEach((role, i) => {
-      const ref = typeof role === "string" ? role : (role as LooseRecord | null)?.ref;
-      const overrideId =
-        typeof role === "object" && role !== null ? (role as LooseRecord).id : undefined;
-      const roleId = typeof ref === "string" ? ref : overrideId;
-      if (!str(roleId)) {
-        errors.push({
-          code: "role-ref-required",
-          path: `roles[${i}]`,
-          message: "role must reference a defined role id",
-        });
-        return;
-      }
-      if (seen.has(roleId)) {
-        errors.push({
-          code: "role-duplicate",
-          path: `roles[${i}]`,
-          message: `duplicate role: ${roleId}`,
-        });
-      }
-      seen.add(roleId);
-    });
+    ;
   }
 
killedBy: validateTeamTemplate 穷举负矩阵 负例：roles 元素无引用无 id -> role-ref-required
statusReason: expected [] to include 'role-ref-required'

[Killed] BlockStatement
src/runtime/template/template.ts:278:32
   const seen = new Set<string>();
   const roles = t.roles as unknown[] | undefined;
   if (Array.isArray(roles) && roles.length > 0) {
-    roles.forEach((role, i) => {
-      const ref = typeof role === "string" ? role : (role as LooseRecord | null)?.ref;
-      const overrideId =
-        typeof role === "object" && role !== null ? (role as LooseRecord).id : undefined;
-      const roleId = typeof ref === "string" ? ref : overrideId;
-      if (!str(roleId)) {
-        errors.push({
-          code: "role-ref-required",
-          path: `roles[${i}]`,
-          message: "role must reference a defined role id",
-        });
-        return;
-      }
-      if (seen.has(roleId)) {
-        errors.push({
-          code: "role-duplicate",
-          path: `roles[${i}]`,
-          message: `duplicate role: ${roleId}`,
-        });
-      }
-      seen.add(roleId);
-    });
+    roles.forEach((role, i) => {});
   }
 
killedBy: validateTeamTemplate 穷举负矩阵 负例：roles 元素无引用无 id -> role-ref-required
statusReason: expected [] to include 'role-ref-required'

[Killed] ConditionalExpression
src/runtime/template/template.ts:279:19
   const roles = t.roles as unknown[] | undefined;
   if (Array.isArray(roles) && roles.length > 0) {
     roles.forEach((role, i) => {
-      const ref = typeof role === "string" ? role : (role as LooseRecord | null)?.ref;
+      const ref = false ? role : (role as LooseRecord | null)?.ref;
       const overrideId =
         typeof role === "object" && role !== null ? (role as LooseRecord).id : undefined;
killedBy: team_reconcile overview 一次调用返回快照摘要、成员对照、状态分布、事件游标与 goal 占位
statusReason: template validation failed:
- [role-ref-required] team.roles[0]: role must reference a defined role id
- [role-ref-required] team.roles[1]: role must reference a defined role id
- [role-ref-required] team.roles[2]: role must reference a defined role id
- [role-ref-required] team.roles[3]: role must reference a defined role id
- [role-ref-required] team.roles[4]: role must reference a defined role

[Killed] EqualityOperator
src/runtime/template/template.ts:279:19
   const roles = t.roles as unknown[] | undefined;
   if (Array.isArray(roles) && roles.length > 0) {
     roles.forEach((role, i) => {
-      const ref = typeof role === "string" ? role : (role as LooseRecord | null)?.ref;
+      const ref = typeof role !== "string" ? role : (role as LooseRecord | null)?.ref;
       const overrideId =
         typeof role === "object" && role !== null ? (role as LooseRecord).id : undefined;
killedBy: validateTeamTemplate 穷举负矩阵 负例：roles 引用重复 -> role-duplicate
statusReason: expected [ 'role-ref-required', …(1) ] to include 'role-duplicate'

[Timeout] ConditionalExpression
src/runtime/template/template.ts:281:9
     roles.forEach((role, i) => {
       const ref = typeof role === "string" ? role : (role as LooseRecord | null)?.ref;
       const overrideId =
-        typeof role === "object" && role !== null ? (role as LooseRecord).id : undefined;
+        false ? (role as LooseRecord).id : undefined;
       const roleId = typeof ref === "string" ? ref : overrideId;
       if (!str(roleId)) {

[Survived] EqualityOperator
src/runtime/template/template.ts:281:37
     roles.forEach((role, i) => {
       const ref = typeof role === "string" ? role : (role as LooseRecord | null)?.ref;
       const overrideId =
-        typeof role === "object" && role !== null ? (role as LooseRecord).id : undefined;
+        typeof role === "object" && role === null ? (role as LooseRecord).id : undefined;
       const roleId = typeof ref === "string" ? ref : overrideId;
       if (!str(roleId)) {

[Killed] ConditionalExpression
src/runtime/template/template.ts:282:22
       const ref = typeof role === "string" ? role : (role as LooseRecord | null)?.ref;
       const overrideId =
         typeof role === "object" && role !== null ? (role as LooseRecord).id : undefined;
-      const roleId = typeof ref === "string" ? ref : overrideId;
+      const roleId = false ? ref : overrideId;
       if (!str(roleId)) {
         errors.push({
killedBy: team_reconcile overview 一次调用返回快照摘要、成员对照、状态分布、事件游标与 goal 占位
statusReason: template validation failed:
- [role-ref-required] team.roles[0]: role must reference a defined role id
- [role-ref-required] team.roles[1]: role must reference a defined role id
- [role-ref-required] team.roles[2]: role must reference a defined role id
- [role-ref-required] team.roles[3]: role must reference a defined role id
- [role-ref-required] team.roles[4]: role must reference a defined role

[Killed] EqualityOperator
src/runtime/template/template.ts:282:22
       const ref = typeof role === "string" ? role : (role as LooseRecord | null)?.ref;
       const overrideId =
         typeof role === "object" && role !== null ? (role as LooseRecord).id : undefined;
-      const roleId = typeof ref === "string" ? ref : overrideId;
+      const roleId = typeof ref !== "string" ? ref : overrideId;
       if (!str(roleId)) {
         errors.push({
killedBy: team_reconcile overview 一次调用返回快照摘要、成员对照、状态分布、事件游标与 goal 占位
statusReason: template validation failed:
- [role-ref-required] team.roles[0]: role must reference a defined role id
- [role-ref-required] team.roles[1]: role must reference a defined role id
- [role-ref-required] team.roles[2]: role must reference a defined role id
- [role-ref-required] team.roles[3]: role must reference a defined role id
- [role-ref-required] team.roles[4]: role must reference a defined role

[Killed] ConditionalExpression
src/runtime/template/template.ts:283:11
       const overrideId =
         typeof role === "object" && role !== null ? (role as LooseRecord).id : undefined;
       const roleId = typeof ref === "string" ? ref : overrideId;
-      if (!str(roleId)) {
+      if (true) {
         errors.push({
           code: "role-ref-required",
killedBy: team_reconcile overview 一次调用返回快照摘要、成员对照、状态分布、事件游标与 goal 占位
statusReason: template validation failed:
- [role-ref-required] team.roles[0]: role must reference a defined role id
- [role-ref-required] team.roles[1]: role must reference a defined role id
- [role-ref-required] team.roles[2]: role must reference a defined role id
- [role-ref-required] team.roles[3]: role must reference a defined role id
- [role-ref-required] team.roles[4]: role must reference a defined role

[Killed] BooleanLiteral
src/runtime/template/template.ts:283:11
       const overrideId =
         typeof role === "object" && role !== null ? (role as LooseRecord).id : undefined;
       const roleId = typeof ref === "string" ? ref : overrideId;
-      if (!str(roleId)) {
+      if (str(roleId)) {
         errors.push({
           code: "role-ref-required",
killedBy: team_reconcile overview 一次调用返回快照摘要、成员对照、状态分布、事件游标与 goal 占位
statusReason: template validation failed:
- [role-ref-required] team.roles[0]: role must reference a defined role id
- [role-ref-required] team.roles[1]: role must reference a defined role id
- [role-ref-required] team.roles[2]: role must reference a defined role id
- [role-ref-required] team.roles[3]: role must reference a defined role id
- [role-ref-required] team.roles[4]: role must reference a defined role

[Survived] StringLiteral
src/runtime/template/template.ts:286:17
       if (!str(roleId)) {
         errors.push({
           code: "role-ref-required",
-          path: `roles[${i}]`,
+          path: ``,
           message: "role must reference a defined role id",
         });

[Killed] ConditionalExpression
src/runtime/template/template.ts:291:11
         });
         return;
       }
-      if (seen.has(roleId)) {
+      if (false) {
         errors.push({
           code: "role-duplicate",
killedBy: validateTeamTemplate 穷举负矩阵 负例：roles 引用重复 -> role-duplicate
statusReason: expected [] to include 'role-duplicate'

[Killed] BlockStatement
src/runtime/template/template.ts:291:29
         });
         return;
       }
-      if (seen.has(roleId)) {
-        errors.push({
-          code: "role-duplicate",
-          path: `roles[${i}]`,
-          message: `duplicate role: ${roleId}`,
-        });
-      }
+      if (seen.has(roleId)) {}
       seen.add(roleId);
     });
killedBy: validateTeamTemplate 穷举负矩阵 负例：roles 引用重复 -> role-duplicate
statusReason: expected [] to include 'role-duplicate'

[Killed] StringLiteral
src/runtime/template/template.ts:293:17
       }
       if (seen.has(roleId)) {
         errors.push({
-          code: "role-duplicate",
+          code: "",
           path: `roles[${i}]`,
           message: `duplicate role: ${roleId}`,
killedBy: validateTeamTemplate 穷举负矩阵 负例：roles 引用重复 -> role-duplicate
statusReason: expected [ '' ] to include 'role-duplicate'

[Survived] StringLiteral
src/runtime/template/template.ts:294:17
       if (seen.has(roleId)) {
         errors.push({
           code: "role-duplicate",
-          path: `roles[${i}]`,
+          path: ``,
           message: `duplicate role: ${roleId}`,
         });

[Killed] CallExpression
src/runtime/template/template.ts:298:7
           message: `duplicate role: ${roleId}`,
         });
       }
-      seen.add(roleId);
+      ;
     });
   }
killedBy: validateTeamTemplate 穷举负矩阵 负例：roles 引用重复 -> role-duplicate
statusReason: expected [] to include 'role-duplicate'

[Killed] EqualityOperator
src/runtime/template/template.ts:303:7
   }
 
   // comm：explicit 模式要求白名单且边完整
-  if (t.comm_mode === "explicit") {
+  if (t.comm_mode !== "explicit") {
     const comm = t.comm;
     if (!Array.isArray(comm)) {
killedBy: team_reconcile overview 一次调用返回快照摘要、成员对照、状态分布、事件游标与 goal 占位
statusReason: template validation failed:
- [explicit-comm-required] team.comm: explicit mode requires a comm whitelist array

[Killed] ConditionalExpression
src/runtime/template/template.ts:303:7
   }
 
   // comm：explicit 模式要求白名单且边完整
-  if (t.comm_mode === "explicit") {
+  if (true) {
     const comm = t.comm;
     if (!Array.isArray(comm)) {
killedBy: team_reconcile overview 一次调用返回快照摘要、成员对照、状态分布、事件游标与 goal 占位
statusReason: template validation failed:
- [explicit-comm-required] team.comm: explicit mode requires a comm whitelist array

[Killed] BooleanLiteral
src/runtime/template/template.ts:305:9
   // comm：explicit 模式要求白名单且边完整
   if (t.comm_mode === "explicit") {
     const comm = t.comm;
-    if (!Array.isArray(comm)) {
+    if (Array.isArray(comm)) {
       errors.push({
         code: "explicit-comm-required",
killedBy: validateTeamTemplate 穷举负矩阵 负例：explicit 无白名单 -> explicit-comm-required
statusReason: Cannot read properties of undefined (reading 'forEach')

[Killed] ConditionalExpression
src/runtime/template/template.ts:305:9
   // comm：explicit 模式要求白名单且边完整
   if (t.comm_mode === "explicit") {
     const comm = t.comm;
-    if (!Array.isArray(comm)) {
+    if (false) {
       errors.push({
         code: "explicit-comm-required",
killedBy: validateTeamTemplate 穷举负矩阵 负例：explicit 无白名单 -> explicit-comm-required
statusReason: Cannot read properties of undefined (reading 'forEach')

[Killed] StringLiteral
src/runtime/template/template.ts:307:15
     const comm = t.comm;
     if (!Array.isArray(comm)) {
       errors.push({
-        code: "explicit-comm-required",
+        code: "",
         path: "comm",
         message: "explicit mode requires a comm whitelist array",
killedBy: validateTeamTemplate 穷举负矩阵 负例：explicit 无白名单 -> explicit-comm-required
statusReason: expected [ '' ] to include 'explicit-comm-required'

[Killed] BlockStatement
src/runtime/template/template.ts:311:12
         path: "comm",
         message: "explicit mode requires a comm whitelist array",
       });
-    } else {
-      comm.forEach((edge, i) => {
-        const e = edge as LooseRecord | null;
-        if (
-          typeof edge !== "object" ||
-          edge === null ||
-          !str(e?.from) ||
-          !str(e?.to)
-        ) {
-          errors.push({
-            code: "comm-edge-invalid",
-            path: `comm[${i}]`,
-            message: "edge must have from/to",
-          });
-        }
-      });
-    }
+    } else {}
   }
 
killedBy: validateTeamTemplate 穷举负矩阵 负例：comm 边缺 to -> comm-edge-invalid
statusReason: expected [] to include 'comm-edge-invalid'

[Killed] BlockStatement
src/runtime/template/template.ts:312:33
         message: "explicit mode requires a comm whitelist array",
       });
     } else {
-      comm.forEach((edge, i) => {
-        const e = edge as LooseRecord | null;
-        if (
-          typeof edge !== "object" ||
-          edge === null ||
-          !str(e?.from) ||
-          !str(e?.to)
-        ) {
-          errors.push({
-            code: "comm-edge-invalid",
-            path: `comm[${i}]`,
-            message: "edge must have from/to",
-          });
-        }
-      });
+      comm.forEach((edge, i) => {});
     }
   }
killedBy: Team Template 校验 explicit comm 缺白名单即拒；白名单边缺字段即拒
statusReason: expected [] to include 'comm-edge-invalid'

[Killed] CallExpression
src/runtime/template/template.ts:312:7
         message: "explicit mode requires a comm whitelist array",
       });
     } else {
-      comm.forEach((edge, i) => {
-        const e = edge as LooseRecord | null;
-        if (
-          typeof edge !== "object" ||
-          edge === null ||
-          !str(e?.from) ||
-          !str(e?.to)
-        ) {
-          errors.push({
-            code: "comm-edge-invalid",
-            path: `comm[${i}]`,
-            message: "edge must have from/to",
-          });
-        }
-      });
+      ;
     }
   }
killedBy: Team Template 校验 explicit comm 缺白名单即拒；白名单边缺字段即拒
statusReason: expected [] to include 'comm-edge-invalid'

[Killed] ConditionalExpression
src/runtime/template/template.ts:315:11
       comm.forEach((edge, i) => {
         const e = edge as LooseRecord | null;
         if (
-          typeof edge !== "object" ||
-          edge === null ||
-          !str(e?.from) ||
-          !str(e?.to)
+          false
         ) {
           errors.push({
killedBy: validateTeamTemplate 穷举负矩阵 负例：comm 边缺 to -> comm-edge-invalid
statusReason: expected [] to include 'comm-edge-invalid'

[Killed] LogicalOperator
src/runtime/template/template.ts:315:11
       comm.forEach((edge, i) => {
         const e = edge as LooseRecord | null;
         if (
-          typeof edge !== "object" ||
-          edge === null ||
-          !str(e?.from) ||
-          !str(e?.to)
+          (typeof edge !== "object" || edge === null || !str(e?.from)) && !str(e?.to)
         ) {
           errors.push({
killedBy: validateTeamTemplate 穷举负矩阵 负例：comm 边缺 to -> comm-edge-invalid
statusReason: expected [] to include 'comm-edge-invalid'

[Survived] ConditionalExpression
src/runtime/template/template.ts:316:11
         const e = edge as LooseRecord | null;
         if (
           typeof edge !== "object" ||
-          edge === null ||
+          false ||
           !str(e?.from) ||
           !str(e?.to)

[Survived] EqualityOperator
src/runtime/template/template.ts:316:11
         const e = edge as LooseRecord | null;
         if (
           typeof edge !== "object" ||
-          edge === null ||
+          edge !== null ||
           !str(e?.from) ||
           !str(e?.to)

[Survived] OptionalChaining
src/runtime/template/template.ts:317:16
         if (
           typeof edge !== "object" ||
           edge === null ||
-          !str(e?.from) ||
+          !str(e.from) ||
           !str(e?.to)
         ) {

[Survived] BooleanLiteral
src/runtime/template/template.ts:317:11
         if (
           typeof edge !== "object" ||
           edge === null ||
-          !str(e?.from) ||
+          str(e?.from) ||
           !str(e?.to)
         ) {

[Killed] BooleanLiteral
src/runtime/template/template.ts:318:11
           typeof edge !== "object" ||
           edge === null ||
           !str(e?.from) ||
-          !str(e?.to)
+          str(e?.to)
         ) {
           errors.push({
killedBy: Team Template 校验 explicit comm 缺白名单即拒；白名单边缺字段即拒
statusReason: expected [] to include 'comm-edge-invalid'

[Survived] OptionalChaining
src/runtime/template/template.ts:318:16
           typeof edge !== "object" ||
           edge === null ||
           !str(e?.from) ||
-          !str(e?.to)
+          !str(e.to)
         ) {
           errors.push({

[Killed] BlockStatement
src/runtime/template/template.ts:319:11
           edge === null ||
           !str(e?.from) ||
           !str(e?.to)
-        ) {
-          errors.push({
-            code: "comm-edge-invalid",
-            path: `comm[${i}]`,
-            message: "edge must have from/to",
-          });
-        }
+        ) {}
       });
     }
killedBy: validateTeamTemplate 穷举负矩阵 负例：comm 边缺 to -> comm-edge-invalid
statusReason: expected [] to include 'comm-edge-invalid'

[Survived] StringLiteral
src/runtime/template/template.ts:323:22
           errors.push({
             code: "comm-edge-invalid",
             path: `comm[${i}]`,
-            message: "edge must have from/to",
+            message: "",
           });
         }

[Killed] ConditionalExpression
src/runtime/template/template.ts:332:7
 
   // archives：file|url 两型硬编码；file 型 target 相对路径
   const archives = t.archives;
-  if (Array.isArray(archives)) {
+  if (false) {
     archives.forEach((arc, i) => {
       const a = arc as LooseRecord | null;
killedBy: Team Template 校验 负例：多规则并发报错不短路（code/path/message 全量快照）
statusReason: expected [] to deeply equal [ 'archives[0].type' ]

[Killed] ConditionalExpression
src/runtime/template/template.ts:332:7
 
   // archives：file|url 两型硬编码；file 型 target 相对路径
   const archives = t.archives;
-  if (Array.isArray(archives)) {
+  if (true) {
     archives.forEach((arc, i) => {
       const a = arc as LooseRecord | null;
killedBy: team/create 一键建团 user 层模板经 source=user 实例化，返回携带 source 标记
statusReason: expected 409 to be 200 // Object.is equality

[Killed] BlockStatement
src/runtime/template/template.ts:335:67
   if (Array.isArray(archives)) {
     archives.forEach((arc, i) => {
       const a = arc as LooseRecord | null;
-      if (typeof arc !== "object" || arc === null || !str(a?.id)) {
-        errors.push({
-          code: "archive-id-required",
-          path: `archives[${i}].id`,
-          message: "archive id is required",
-        });
-        return;
-      }
+      if (typeof arc !== "object" || arc === null || !str(a?.id)) {}
       if (a.type !== "file" && a.type !== "url") {
         errors.push({
killedBy: validateTeamTemplate 穷举负矩阵 负例：archive 元素缺 id -> archive-id-required
statusReason: expected [] to include 'archive-id-required'

[Killed] EqualityOperator
src/runtime/template/template.ts:335:38
   if (Array.isArray(archives)) {
     archives.forEach((arc, i) => {
       const a = arc as LooseRecord | null;
-      if (typeof arc !== "object" || arc === null || !str(a?.id)) {
+      if (typeof arc !== "object" || arc !== null || !str(a?.id)) {
         errors.push({
           code: "archive-id-required",
killedBy: team_reconcile overview 一次调用返回快照摘要、成员对照、状态分布、事件游标与 goal 占位
statusReason: template validation failed:
- [archive-id-required] team.archives[0].id: archive id is required
- [archive-id-required] team.archives[1].id: archive id is required

[Killed] StringLiteral
src/runtime/template/template.ts:337:17
       const a = arc as LooseRecord | null;
       if (typeof arc !== "object" || arc === null || !str(a?.id)) {
         errors.push({
-          code: "archive-id-required",
+          code: "",
           path: `archives[${i}].id`,
           message: "archive id is required",
killedBy: validateTeamTemplate 穷举负矩阵 负例：archive 元素缺 id -> archive-id-required
statusReason: expected [ '' ] to include 'archive-id-required'

[Killed] LogicalOperator
src/runtime/template/template.ts:343:11
         });
         return;
       }
-      if (a.type !== "file" && a.type !== "url") {
+      if (a.type !== "file" || a.type !== "url") {
         errors.push({
           code: "archive-type-invalid",
killedBy: team_reconcile overview 一次调用返回快照摘要、成员对照、状态分布、事件游标与 goal 占位
statusReason: template validation failed:
- [archive-type-invalid] team.archives[0].type: type must be file or url
- [archive-type-invalid] team.archives[1].type: type must be file or url

[Killed] EqualityOperator
src/runtime/template/template.ts:343:11
         });
         return;
       }
-      if (a.type !== "file" && a.type !== "url") {
+      if (a.type === "file" && a.type !== "url") {
         errors.push({
           code: "archive-type-invalid",
killedBy: team_reconcile overview 一次调用返回快照摘要、成员对照、状态分布、事件游标与 goal 占位
statusReason: template validation failed:
- [archive-type-invalid] team.archives[0].type: type must be file or url

[Killed] ObjectLiteral
src/runtime/template/template.ts:344:21
         return;
       }
       if (a.type !== "file" && a.type !== "url") {
-        errors.push({
-          code: "archive-type-invalid",
-          path: `archives[${i}].type`,
-          message: "type must be file or url",
-        });
+        errors.push({});
       }
       if (a.type === "file") {
killedBy: Team Template 校验 负例：多规则并发报错不短路（code/path/message 全量快照）
statusReason: expected [] to deeply equal [ 'archives[0].type' ]

[Killed] StringLiteral
src/runtime/template/template.ts:345:17
       }
       if (a.type !== "file" && a.type !== "url") {
         errors.push({
-          code: "archive-type-invalid",
+          code: "",
           path: `archives[${i}].type`,
           message: "type must be file or url",
killedBy: Team Template 校验 负例：多规则并发报错不短路（code/path/message 全量快照）
statusReason: expected [] to deeply equal [ 'archives[0].type' ]

[Killed] ConditionalExpression
src/runtime/template/template.ts:350:11
           message: "type must be file or url",
         });
       }
-      if (a.type === "file") {
+      if (true) {
         const target = a.target;
         if (!str(target)) {
killedBy: team_reconcile overview 一次调用返回快照摘要、成员对照、状态分布、事件游标与 goal 占位
statusReason: template validation failed:
- [archive-target-required] team.archives[1].target: file archive target is required

[Killed] ConditionalExpression
src/runtime/template/template.ts:350:11
           message: "type must be file or url",
         });
       }
-      if (a.type === "file") {
+      if (false) {
         const target = a.target;
         if (!str(target)) {
killedBy: validateTeamTemplate 穷举负矩阵 负例：file 型缺 target -> archive-target-required
statusReason: expected [] to include 'archive-target-required'

[Killed] ConditionalExpression
src/runtime/template/template.ts:352:13
       }
       if (a.type === "file") {
         const target = a.target;
-        if (!str(target)) {
+        if (true) {
           errors.push({
             code: "archive-target-required",
killedBy: Team Template 校验 正例通过且一次收集全部错误
statusReason: expected { ok: false, errors: [ { …(3) } ] } to deeply equal { ok: true, errors: [] }

[Killed] ConditionalExpression
src/runtime/template/template.ts:352:13
       }
       if (a.type === "file") {
         const target = a.target;
-        if (!str(target)) {
+        if (false) {
           errors.push({
             code: "archive-target-required",
killedBy: validateTeamTemplate 穷举负矩阵 负例：file 型缺 target -> archive-target-required
statusReason: Cannot read properties of undefined (reading 'includes')

[Killed] ObjectLiteral
src/runtime/template/template.ts:353:23
       if (a.type === "file") {
         const target = a.target;
         if (!str(target)) {
-          errors.push({
-            code: "archive-target-required",
-            path: `archives[${i}].target`,
-            message: "file archive target is required",
-          });
+          errors.push({});
         } else if (target.includes("..") || target.startsWith("/")) {
           errors.push({
killedBy: Team Template 校验 file 型 archive 缺 target / url 型缺 url / target 越界各自报错
statusReason: expected [ undefined, …(3) ] to include 'archive-target-required'
