[Killed] ConditionalExpression
src/runtime/template/template.ts:358:20
             path: `archives[${i}].target`,
             message: "file archive target is required",
           });
-        } else if (target.includes("..") || target.startsWith("/")) {
+        } else if (true) {
           errors.push({
             code: "archive-target-escapes",
killedBy: team_reconcile overview 一次调用返回快照摘要、成员对照、状态分布、事件游标与 goal 占位
statusReason: template validation failed:
- [archive-target-escapes] team.archives[0].target: file target must stay inside TEAM_HOME

[Killed] LogicalOperator
src/runtime/template/template.ts:358:20
             path: `archives[${i}].target`,
             message: "file archive target is required",
           });
-        } else if (target.includes("..") || target.startsWith("/")) {
+        } else if (target.includes("..") && target.startsWith("/")) {
           errors.push({
             code: "archive-target-escapes",
killedBy: Team Template 校验 file 型 archive 缺 target / url 型缺 url / target 越界各自报错
statusReason: expected [ 'archive-target-required', …(1) ] to include 'archive-target-escapes'

[Killed] StringLiteral
src/runtime/template/template.ts:360:19
           });
         } else if (target.includes("..") || target.startsWith("/")) {
           errors.push({
-            code: "archive-target-escapes",
+            code: "",
             path: `archives[${i}].target`,
             message: "file target must stay inside TEAM_HOME",
killedBy: Team Template 校验 file 型 archive 缺 target / url 型缺 url / target 越界各自报错
statusReason: expected [ 'archive-target-required', …(3) ] to include 'archive-target-escapes'

[Killed] BooleanLiteral
src/runtime/template/template.ts:366:31
           });
         }
       }
-      if (a.type === "url" && !str(a.url)) {
+      if (a.type === "url" && str(a.url)) {
         errors.push({
           code: "archive-url-required",
killedBy: team_reconcile overview 一次调用返回快照摘要、成员对照、状态分布、事件游标与 goal 占位
statusReason: template validation failed:
- [archive-url-required] team.archives[1].url: url archive requires url field

[Killed] EqualityOperator
src/runtime/template/template.ts:366:11
           });
         }
       }
-      if (a.type === "url" && !str(a.url)) {
+      if (a.type !== "url" && !str(a.url)) {
         errors.push({
           code: "archive-url-required",
killedBy: team_reconcile overview 一次调用返回快照摘要、成员对照、状态分布、事件游标与 goal 占位
statusReason: template validation failed:
- [archive-url-required] team.archives[0].url: url archive requires url field

[Killed] ObjectLiteral
src/runtime/template/template.ts:367:21
         }
       }
       if (a.type === "url" && !str(a.url)) {
-        errors.push({
-          code: "archive-url-required",
-          path: `archives[${i}].url`,
-          message: "url archive requires url field",
-        });
+        errors.push({});
       }
     });
killedBy: validateTeamTemplate 穷举负矩阵 负例：url 型缺 url -> archive-url-required
statusReason: expected [ undefined ] to include 'archive-url-required'

[Killed] StringLiteral
src/runtime/template/template.ts:368:17
       }
       if (a.type === "url" && !str(a.url)) {
         errors.push({
-          code: "archive-url-required",
+          code: "",
           path: `archives[${i}].url`,
           message: "url archive requires url field",
killedBy: validateTeamTemplate 穷举负矩阵 负例：url 型缺 url -> archive-url-required
statusReason: expected [ '' ] to include 'archive-url-required'

[Survived] StringLiteral
src/runtime/template/template.ts:369:17
       if (a.type === "url" && !str(a.url)) {
         errors.push({
           code: "archive-url-required",
-          path: `archives[${i}].url`,
+          path: ``,
           message: "url archive requires url field",
         });

[Killed] ConditionalExpression
src/runtime/template/template.ts:378:7
 
   // gates：at 引用 tier 存在；on 形如 stage-enter:<state>
   const gates = t.gates;
-  if (Array.isArray(gates)) {
+  if (false) {
     gates.forEach((gate, i) => {
       const g = gate as LooseRecord | null;
killedBy: Team Template 校验 负例：多规则并发报错不短路（code/path/message 全量快照）
statusReason: expected undefined to be 'gate at references unknown tier: no-s…' // Object.is equality

[Killed] ConditionalExpression
src/runtime/template/template.ts:378:7
 
   // gates：at 引用 tier 存在；on 形如 stage-enter:<state>
   const gates = t.gates;
-  if (Array.isArray(gates)) {
+  if (true) {
     gates.forEach((gate, i) => {
       const g = gate as LooseRecord | null;
killedBy: team/create 一键建团 research-report 场景：实例化后 tier0_prompt 含规程全文（#39 依赖）
statusReason: expected 409 to be 200 // Object.is equality

[Killed] BlockStatement
src/runtime/template/template.ts:379:32
   // gates：at 引用 tier 存在；on 形如 stage-enter:<state>
   const gates = t.gates;
   if (Array.isArray(gates)) {
-    gates.forEach((gate, i) => {
-      const g = gate as LooseRecord | null;
-      if (typeof gate !== "object" || gate === null || !str(g?.id)) {
-        errors.push({
-          code: "gate-id-required",
-          path: `gates[${i}].id`,
-          message: "gate id is required",
-        });
-        return;
-      }
-      if (!str(g.at) || !tierIds.has(g.at)) {
-        errors.push({
-          code: "gate-at-unknown",
-          path: `gates[${i}].at`,
-          message: `gate at references unknown tier: ${String(g.at)}`,
-        });
-      }
-      if (g.on !== undefined && !/^stage-enter:[a-z][a-z0-9_-]*$/.test(String(g.on))) {
-        errors.push({
-          code: "gate-on-invalid",
-          path: `gates[${i}].on`,
-          message: "on must look like stage-enter:<state>",
-        });
-      }
-    });
+    gates.forEach((gate, i) => {});
   }
 
killedBy: Team Template 校验 负例：多规则并发报错不短路（code/path/message 全量快照）
statusReason: expected undefined to be 'gate at references unknown tier: no-s…' // Object.is equality

[Killed] CallExpression
src/runtime/template/template.ts:379:5
   // gates：at 引用 tier 存在；on 形如 stage-enter:<state>
   const gates = t.gates;
   if (Array.isArray(gates)) {
-    gates.forEach((gate, i) => {
-      const g = gate as LooseRecord | null;
-      if (typeof gate !== "object" || gate === null || !str(g?.id)) {
-        errors.push({
-          code: "gate-id-required",
-          path: `gates[${i}].id`,
-          message: "gate id is required",
-        });
-        return;
-      }
-      if (!str(g.at) || !tierIds.has(g.at)) {
-        errors.push({
-          code: "gate-at-unknown",
-          path: `gates[${i}].at`,
-          message: `gate at references unknown tier: ${String(g.at)}`,
-        });
-      }
-      if (g.on !== undefined && !/^stage-enter:[a-z][a-z0-9_-]*$/.test(String(g.on))) {
-        errors.push({
-          code: "gate-on-invalid",
-          path: `gates[${i}].on`,
-          message: "on must look like stage-enter:<state>",
-        });
-      }
-    });
+    ;
   }
 
killedBy: Team Template 校验 负例：多规则并发报错不短路（code/path/message 全量快照）
statusReason: expected undefined to be 'gate at references unknown tier: no-s…' // Object.is equality

[Killed] ConditionalExpression
src/runtime/template/template.ts:381:11
   if (Array.isArray(gates)) {
     gates.forEach((gate, i) => {
       const g = gate as LooseRecord | null;
-      if (typeof gate !== "object" || gate === null || !str(g?.id)) {
+      if (false) {
         errors.push({
           code: "gate-id-required",
killedBy: validateTeamTemplate 穷举负矩阵 负例：gate 缺 id -> gate-id-required
statusReason: expected [] to include 'gate-id-required'

[Killed] LogicalOperator
src/runtime/template/template.ts:381:11
   if (Array.isArray(gates)) {
     gates.forEach((gate, i) => {
       const g = gate as LooseRecord | null;
-      if (typeof gate !== "object" || gate === null || !str(g?.id)) {
+      if ((typeof gate !== "object" || gate === null) && !str(g?.id)) {
         errors.push({
           code: "gate-id-required",
killedBy: validateTeamTemplate 穷举负矩阵 负例：gate 缺 id -> gate-id-required
statusReason: expected [] to include 'gate-id-required'

[Killed] StringLiteral
src/runtime/template/template.ts:383:17
       const g = gate as LooseRecord | null;
       if (typeof gate !== "object" || gate === null || !str(g?.id)) {
         errors.push({
-          code: "gate-id-required",
+          code: "",
           path: `gates[${i}].id`,
           message: "gate id is required",
killedBy: validateTeamTemplate 穷举负矩阵 负例：gate 缺 id -> gate-id-required
statusReason: expected [ '' ] to include 'gate-id-required'

[Killed] BooleanLiteral
src/runtime/template/template.ts:389:11
         });
         return;
       }
-      if (!str(g.at) || !tierIds.has(g.at)) {
+      if (str(g.at) || !tierIds.has(g.at)) {
         errors.push({
           code: "gate-at-unknown",
killedBy: team_reconcile overview 一次调用返回快照摘要、成员对照、状态分布、事件游标与 goal 占位
statusReason: template validation failed:
- [gate-at-unknown] team.gates[0].at: gate at references unknown tier: master

[Killed] ConditionalExpression
src/runtime/template/template.ts:389:11
         });
         return;
       }
-      if (!str(g.at) || !tierIds.has(g.at)) {
+      if (true) {
         errors.push({
           code: "gate-at-unknown",
killedBy: team_reconcile overview 一次调用返回快照摘要、成员对照、状态分布、事件游标与 goal 占位
statusReason: template validation failed:
- [gate-at-unknown] team.gates[0].at: gate at references unknown tier: master

[Killed] StringLiteral
src/runtime/template/template.ts:391:17
       }
       if (!str(g.at) || !tierIds.has(g.at)) {
         errors.push({
-          code: "gate-at-unknown",
+          code: "",
           path: `gates[${i}].at`,
           message: `gate at references unknown tier: ${String(g.at)}`,
killedBy: Team Template 校验 负例：多规则并发报错不短路（code/path/message 全量快照）
statusReason: expected undefined to be 'gate at references unknown tier: no-s…' // Object.is equality

[Survived] StringLiteral
src/runtime/template/template.ts:392:17
       if (!str(g.at) || !tierIds.has(g.at)) {
         errors.push({
           code: "gate-at-unknown",
-          path: `gates[${i}].at`,
+          path: ``,
           message: `gate at references unknown tier: ${String(g.at)}`,
         });

[Killed] BooleanLiteral
src/runtime/template/template.ts:396:33
           message: `gate at references unknown tier: ${String(g.at)}`,
         });
       }
-      if (g.on !== undefined && !/^stage-enter:[a-z][a-z0-9_-]*$/.test(String(g.on))) {
+      if (g.on !== undefined && /^stage-enter:[a-z][a-z0-9_-]*$/.test(String(g.on))) {
         errors.push({
           code: "gate-on-invalid",
killedBy: team_reconcile overview 一次调用返回快照摘要、成员对照、状态分布、事件游标与 goal 占位
statusReason: template validation failed:
- [gate-on-invalid] team.gates[0].on: on must look like stage-enter:<state>

[Killed] BlockStatement
src/runtime/template/template.ts:396:87
           message: `gate at references unknown tier: ${String(g.at)}`,
         });
       }
-      if (g.on !== undefined && !/^stage-enter:[a-z][a-z0-9_-]*$/.test(String(g.on))) {
-        errors.push({
-          code: "gate-on-invalid",
-          path: `gates[${i}].on`,
-          message: "on must look like stage-enter:<state>",
-        });
-      }
+      if (g.on !== undefined && !/^stage-enter:[a-z][a-z0-9_-]*$/.test(String(g.on))) {}
     });
   }
killedBy: validateTeamTemplate 穷举负矩阵 负例：gate on 格式非法 -> gate-on-invalid
statusReason: expected [] to include 'gate-on-invalid'

[Killed] ConditionalExpression
src/runtime/template/template.ts:408:7
 
   // resources：对象形态 + 正整数（跳过保留键 stages_ext）
   const resources = t.resources;
-  if (resources !== undefined) {
+  if (true) {
     if (typeof resources !== "object" || resources === null || Array.isArray(resources)) {
       errors.push({
killedBy: team/create 一键建团 user 层模板经 source=user 实例化，返回携带 source 标记
statusReason: expected 409 to be 200 // Object.is equality

[Killed] ConditionalExpression
src/runtime/template/template.ts:408:7
 
   // resources：对象形态 + 正整数（跳过保留键 stages_ext）
   const resources = t.resources;
-  if (resources !== undefined) {
+  if (false) {
     if (typeof resources !== "object" || resources === null || Array.isArray(resources)) {
       errors.push({
killedBy: validateTeamTemplate 穷举负矩阵 负例：resources 非对象 -> resources-not-object
statusReason: expected [] to include 'resources-not-object'

[Killed] EqualityOperator
src/runtime/template/template.ts:409:42
   // resources：对象形态 + 正整数（跳过保留键 stages_ext）
   const resources = t.resources;
   if (resources !== undefined) {
-    if (typeof resources !== "object" || resources === null || Array.isArray(resources)) {
+    if (typeof resources !== "object" || resources !== null || Array.isArray(resources)) {
       errors.push({
         code: "resources-not-object",
killedBy: team_reconcile overview 一次调用返回快照摘要、成员对照、状态分布、事件游标与 goal 占位
statusReason: template validation failed:
- [resources-not-object] team.resources: resources must be an object

[Killed] BlockStatement
src/runtime/template/template.ts:409:90
   // resources：对象形态 + 正整数（跳过保留键 stages_ext）
   const resources = t.resources;
   if (resources !== undefined) {
-    if (typeof resources !== "object" || resources === null || Array.isArray(resources)) {
-      errors.push({
-        code: "resources-not-object",
-        path: "resources",
-        message: "resources must be an object",
-      });
-    } else {
+    if (typeof resources !== "object" || resources === null || Array.isArray(resources)) {} else {
       for (const [key, val] of Object.entries(resources as LooseRecord)) {
         if (key === "stages_ext") continue;
killedBy: validateTeamTemplate 穷举负矩阵 负例：resources 非对象 -> resources-not-object
statusReason: expected [] to include 'resources-not-object'

[Killed] ObjectLiteral
src/runtime/template/template.ts:410:19
   const resources = t.resources;
   if (resources !== undefined) {
     if (typeof resources !== "object" || resources === null || Array.isArray(resources)) {
-      errors.push({
-        code: "resources-not-object",
-        path: "resources",
-        message: "resources must be an object",
-      });
+      errors.push({});
     } else {
       for (const [key, val] of Object.entries(resources as LooseRecord)) {
killedBy: validateTeamTemplate 穷举负矩阵 负例：resources 非对象 -> resources-not-object
statusReason: expected [ undefined ] to include 'resources-not-object'

[Survived] StringLiteral
src/runtime/template/template.ts:413:18
       errors.push({
         code: "resources-not-object",
         path: "resources",
-        message: "resources must be an object",
+        message: "",
       });
     } else {

[Killed] BlockStatement
src/runtime/template/template.ts:415:12
         path: "resources",
         message: "resources must be an object",
       });
-    } else {
-      for (const [key, val] of Object.entries(resources as LooseRecord)) {
-        if (key === "stages_ext") continue;
-        if (typeof val !== "number" || !Number.isInteger(val) || val <= 0) {
-          errors.push({
-            code: "resource-invalid",
-            path: `resources.${key}`,
-            message: "resource limits must be positive integers",
-          });
-        }
-      }
-    }
+    } else {}
   }
 
killedBy: Team Template 校验 负例：多规则并发报错不短路（code/path/message 全量快照）
statusReason: expected [] to deeply equal [ { …(2) } ]

[Killed] BlockStatement
src/runtime/template/template.ts:416:74
         message: "resources must be an object",
       });
     } else {
-      for (const [key, val] of Object.entries(resources as LooseRecord)) {
-        if (key === "stages_ext") continue;
-        if (typeof val !== "number" || !Number.isInteger(val) || val <= 0) {
-          errors.push({
-            code: "resource-invalid",
-            path: `resources.${key}`,
-            message: "resource limits must be positive integers",
-          });
-        }
-      }
+      for (const [key, val] of Object.entries(resources as LooseRecord)) {}
     }
   }
killedBy: Team Template 校验 负例：多规则并发报错不短路（code/path/message 全量快照）
statusReason: expected [] to deeply equal [ { …(2) } ]

[Killed] EqualityOperator
src/runtime/template/template.ts:417:13
       });
     } else {
       for (const [key, val] of Object.entries(resources as LooseRecord)) {
-        if (key === "stages_ext") continue;
+        if (key !== "stages_ext") continue;
         if (typeof val !== "number" || !Number.isInteger(val) || val <= 0) {
           errors.push({
killedBy: validateTeamTemplate 穷举负矩阵 resource 计数为零也拒绝（正整数约束）
statusReason: expected [] to include 'resource-invalid'

[Killed] ConditionalExpression
src/runtime/template/template.ts:417:13
       });
     } else {
       for (const [key, val] of Object.entries(resources as LooseRecord)) {
-        if (key === "stages_ext") continue;
+        if (true) continue;
         if (typeof val !== "number" || !Number.isInteger(val) || val <= 0) {
           errors.push({
killedBy: Team Template 校验 负例：多规则并发报错不短路（code/path/message 全量快照）
statusReason: expected [] to deeply equal [ { …(2) } ]

[Killed] EqualityOperator
src/runtime/template/template.ts:418:66
     } else {
       for (const [key, val] of Object.entries(resources as LooseRecord)) {
         if (key === "stages_ext") continue;
-        if (typeof val !== "number" || !Number.isInteger(val) || val <= 0) {
+        if (typeof val !== "number" || !Number.isInteger(val) || val > 0) {
           errors.push({
             code: "resource-invalid",
killedBy: team_reconcile overview 一次调用返回快照摘要、成员对照、状态分布、事件游标与 goal 占位
statusReason: template validation failed:
- [resource-invalid] team.resources.max_active_rooms: resource limits must be positive integers
- [resource-invalid] team.resources.max_handoffs_per_task: resource limits must be positive integers
- [resource-invalid] team.resources.task_max_rounds: resource limits must be positive integers

[Killed] BooleanLiteral
src/runtime/template/template.ts:418:40
     } else {
       for (const [key, val] of Object.entries(resources as LooseRecord)) {
         if (key === "stages_ext") continue;
-        if (typeof val !== "number" || !Number.isInteger(val) || val <= 0) {
+        if (typeof val !== "number" || Number.isInteger(val) || val <= 0) {
           errors.push({
             code: "resource-invalid",
killedBy: team_reconcile overview 一次调用返回快照摘要、成员对照、状态分布、事件游标与 goal 占位
statusReason: template validation failed:
- [resource-invalid] team.resources.max_active_rooms: resource limits must be positive integers
- [resource-invalid] team.resources.max_handoffs_per_task: resource limits must be positive integers
- [resource-invalid] team.resources.task_max_rounds: resource limits must be positive integers

[Killed] StringLiteral
src/runtime/template/template.ts:420:19
         if (key === "stages_ext") continue;
         if (typeof val !== "number" || !Number.isInteger(val) || val <= 0) {
           errors.push({
-            code: "resource-invalid",
+            code: "",
             path: `resources.${key}`,
             message: "resource limits must be positive integers",
killedBy: Team Template 校验 负例：多规则并发报错不短路（code/path/message 全量快照）
statusReason: expected [] to deeply equal [ { …(2) } ]

[Killed] StringLiteral
src/runtime/template/template.ts:421:19
         if (typeof val !== "number" || !Number.isInteger(val) || val <= 0) {
           errors.push({
             code: "resource-invalid",
-            path: `resources.${key}`,
+            path: ``,
             message: "resource limits must be positive integers",
           });
killedBy: Team Template 校验 负例：多规则并发报错不短路（code/path/message 全量快照）
statusReason: expected [ { path: '', …(1) } ] to deeply equal [ { …(2) } ]

[Killed] ConditionalExpression
src/runtime/template/template.ts:431:7
 
   // stages_ext：不得与保留态冲突（保留态出现即拒）
   const stagesExt = t.stages_ext;
-  if (Array.isArray(stagesExt)) {
+  if (true) {
     for (const stage of stagesExt) {
       if ((RESERVED_STAGES as readonly string[]).includes(stage as string)) {
killedBy: team/create 一键建团 research-report 场景：实例化后 tier0_prompt 含规程全文（#39 依赖）
statusReason: expected 409 to be 200 // Object.is equality

[Killed] ConditionalExpression
src/runtime/template/template.ts:431:7
 
   // stages_ext：不得与保留态冲突（保留态出现即拒）
   const stagesExt = t.stages_ext;
-  if (Array.isArray(stagesExt)) {
+  if (false) {
     for (const stage of stagesExt) {
       if ((RESERVED_STAGES as readonly string[]).includes(stage as string)) {
killedBy: Team Template 校验 负例：多规则并发报错不短路（code/path/message 全量快照）
statusReason: expected [] to deeply equal [ { path: 'stages_ext', …(1) } ]

[Killed] BlockStatement
src/runtime/template/template.ts:432:36
   // stages_ext：不得与保留态冲突（保留态出现即拒）
   const stagesExt = t.stages_ext;
   if (Array.isArray(stagesExt)) {
-    for (const stage of stagesExt) {
-      if ((RESERVED_STAGES as readonly string[]).includes(stage as string)) {
-        errors.push({
-          code: "stage-reserved",
-          path: "stages_ext",
-          message: `stage conflicts with reserved: ${String(stage)}`,
-        });
-      }
-    }
+    for (const stage of stagesExt) {}
   }
 
killedBy: Team Template 校验 负例：多规则并发报错不短路（code/path/message 全量快照）
statusReason: expected [] to deeply equal [ { path: 'stages_ext', …(1) } ]

[Killed] ConditionalExpression
src/runtime/template/template.ts:433:11
   const stagesExt = t.stages_ext;
   if (Array.isArray(stagesExt)) {
     for (const stage of stagesExt) {
-      if ((RESERVED_STAGES as readonly string[]).includes(stage as string)) {
+      if (true) {
         errors.push({
           code: "stage-reserved",
killedBy: Team Template 校验 正例通过且一次收集全部错误
statusReason: expected { ok: false, …(1) } to deeply equal { ok: true, errors: [] }

[Killed] BlockStatement
src/runtime/template/template.ts:433:77
   const stagesExt = t.stages_ext;
   if (Array.isArray(stagesExt)) {
     for (const stage of stagesExt) {
-      if ((RESERVED_STAGES as readonly string[]).includes(stage as string)) {
-        errors.push({
-          code: "stage-reserved",
-          path: "stages_ext",
-          message: `stage conflicts with reserved: ${String(stage)}`,
-        });
-      }
+      if ((RESERVED_STAGES as readonly string[]).includes(stage as string)) {}
     }
   }
killedBy: Team Template 校验 负例：多规则并发报错不短路（code/path/message 全量快照）
statusReason: expected [] to deeply equal [ { path: 'stages_ext', …(1) } ]

[Killed] ObjectLiteral
src/runtime/template/template.ts:434:21
   if (Array.isArray(stagesExt)) {
     for (const stage of stagesExt) {
       if ((RESERVED_STAGES as readonly string[]).includes(stage as string)) {
-        errors.push({
-          code: "stage-reserved",
-          path: "stages_ext",
-          message: `stage conflicts with reserved: ${String(stage)}`,
-        });
+        errors.push({});
       }
     }
killedBy: Team Template 校验 负例：多规则并发报错不短路（code/path/message 全量快照）
statusReason: expected [] to deeply equal [ { path: 'stages_ext', …(1) } ]

[Killed] StringLiteral
src/runtime/template/template.ts:437:20
         errors.push({
           code: "stage-reserved",
           path: "stages_ext",
-          message: `stage conflicts with reserved: ${String(stage)}`,
+          message: ``,
         });
       }
killedBy: Team Template 校验 负例：多规则并发报错不短路（code/path/message 全量快照）
statusReason: expected [ { path: 'stages_ext', message: '' } ] to deeply equal [ { path: 'stages_ext', …(1) } ]

[Killed] ConditionalExpression
src/runtime/template/template.ts:443:16
     }
   }
 
-  return { ok: errors.length === 0, errors };
+  return { ok: false, errors };
 }
 
killedBy: Team Template 校验 正例通过且一次收集全部错误
statusReason: expected { ok: false, errors: [] } to deeply equal { ok: true, errors: [] }

[Killed] EqualityOperator
src/runtime/template/template.ts:443:16
     }
   }
 
-  return { ok: errors.length === 0, errors };
+  return { ok: errors.length !== 0, errors };
 }
 
killedBy: Team Template 校验 正例通过且一次收集全部错误
statusReason: expected { ok: false, errors: [] } to deeply equal { ok: true, errors: [] }
