[Killed] BlockStatement
src/runtime/view/detail.ts:196:59
 /* ── 纯函数导出 ──────────────────────────────────────────────────────── */
 
 /** TaskStatus 五值白名单守卫（历史遗留账本可能出现非五值脏 status）。 */
-function isTaskStatus(value: string): value is TaskStatus {
-  return (TASK_STATUSES as readonly string[]).includes(value);
-}
+function isTaskStatus(value: string): value is TaskStatus {}
 
 /**
killedBy: GET /api/xiaozhuge/team/detail T14: happy path——全字段形状 + stale/awaiting 划分正确
statusReason: expected { queued: +0, running: +0, …(3) } to deeply equal { queued: +0, running: 1, …(3) }

[Killed] BlockStatement
src/runtime/view/detail.ts:205:92
  * 非五值）不炸归约、不计入任何键。注意与 reconcile statusCounts 为稀疏
  * Record<string, number> 仅语义参考、非同一实现。
  */
-export function taskCountsOf(tasks: readonly TaskLedgerView[]): Record<TaskStatus, number> {
-  const counts = Object.fromEntries(TASK_STATUSES.map((s) => [s, 0])) as Record<TaskStatus, number>;
-  for (const t of tasks) {
-    if (isTaskStatus(t.status)) counts[t.status] += 1;
-  }
-  return counts;
-}
+export function taskCountsOf(tasks: readonly TaskLedgerView[]): Record<TaskStatus, number> {}
 
 /** 任务记录 → 白名单投影：逐字段显式拷贝（禁止 spread 原始记录防字段回潮）。 */
killedBy: GET /api/xiaozhuge/team/detail T13: team.yaml 不在场 → 200 全空形短路（isTeam:false），不读任何数据文件
statusReason: expected { isTeam: false, tasks: [], …(7) } to deeply equal { isTeam: false, tasks: [], …(8) }

[Killed] BlockStatement
src/runtime/view/detail.ts:207:26
  */
 export function taskCountsOf(tasks: readonly TaskLedgerView[]): Record<TaskStatus, number> {
   const counts = Object.fromEntries(TASK_STATUSES.map((s) => [s, 0])) as Record<TaskStatus, number>;
-  for (const t of tasks) {
-    if (isTaskStatus(t.status)) counts[t.status] += 1;
-  }
+  for (const t of tasks) {}
   return counts;
 }
killedBy: GET /api/xiaozhuge/team/detail T14: happy path——全字段形状 + stale/awaiting 划分正确
statusReason: expected { queued: +0, running: +0, …(3) } to deeply equal { queued: +0, running: 1, …(3) }

[Killed] ConditionalExpression
src/runtime/view/detail.ts:208:9
 export function taskCountsOf(tasks: readonly TaskLedgerView[]): Record<TaskStatus, number> {
   const counts = Object.fromEntries(TASK_STATUSES.map((s) => [s, 0])) as Record<TaskStatus, number>;
   for (const t of tasks) {
-    if (isTaskStatus(t.status)) counts[t.status] += 1;
+    if (true) counts[t.status] += 1;
   }
   return counts;
killedBy: T4 任务计数 五状态各若干条计数精确；脏 status 不炸且不计入任何键（记录仍原样透传展示）
statusReason: expected { queued: 1, running: 2, …(4) } to deeply equal { queued: 1, running: 2, …(3) }

[Killed] AssignmentOperator
src/runtime/view/detail.ts:208:33
 export function taskCountsOf(tasks: readonly TaskLedgerView[]): Record<TaskStatus, number> {
   const counts = Object.fromEntries(TASK_STATUSES.map((s) => [s, 0])) as Record<TaskStatus, number>;
   for (const t of tasks) {
-    if (isTaskStatus(t.status)) counts[t.status] += 1;
+    if (isTaskStatus(t.status)) counts[t.status] -= 1;
   }
   return counts;
killedBy: T4 任务计数 五状态各若干条计数精确；脏 status 不炸且不计入任何键（记录仍原样透传展示）
statusReason: expected { queued: -1, running: -2, …(3) } to deeply equal { queued: 1, running: 2, …(3) }

[Killed] BlockStatement
src/runtime/view/detail.ts:214:53
 }
 
 /** 任务记录 → 白名单投影：逐字段显式拷贝（禁止 spread 原始记录防字段回潮）。 */
-function projectTask(t: TaskRecord): TaskLedgerView {
-  return {
-    id: t.id,
-    title: t.title,
-    room: t.room,
-    status: t.status,
-    assignee: t.assignee ?? null,
-    rounds: t.rounds,
-    // P0-2（PR-D，#169）：maxRounds 旧数据落盘 0 视为未设限 → 归一为 null
-    //（0/负/null/undefined 一律不展示上限，与 ledger.update maxRounds>0 判据一致）。
-    maxRounds: t.maxRounds !== null && t.maxRounds !== undefined && t.maxRounds > 0 ? t.maxRounds : null,
-    touched: [...t.touched],
-    rev: t.rev,
-    createdAt: t.createdAt,
-    updatedAt: t.updatedAt,
-    artifact: t.artifact ?? null,
-  };
-}
+function projectTask(t: TaskRecord): TaskLedgerView {}
 
 /** updatedAt desc 排序，同值以 id asc 稳定 tiebreak（uuid 纯 ASCII，字典序确定）。 */
killedBy: GET /api/xiaozhuge/team/detail T14: happy path——全字段形状 + stale/awaiting 划分正确
statusReason: expected 500 to be 200 // Object.is equality

[Killed] LogicalOperator
src/runtime/view/detail.ts:220:15
     title: t.title,
     room: t.room,
     status: t.status,
-    assignee: t.assignee ?? null,
+    assignee: t.assignee && null,
     rounds: t.rounds,
     // P0-2（PR-D，#169）：maxRounds 旧数据落盘 0 视为未设限 → 归一为 null
killedBy: T2 保守投影：缺省字段 → null assignee/maxRounds/artifact 缺省（undefined）一律投影为 null
statusReason: expected { id: 'task-1', title: '样例任务', …(10) } to match object { id: 'task-1', assignee: null, …(2) }
(8 matching properties omitted from actual)

[Killed] EqualityOperator
src/runtime/view/detail.ts:224:40
     rounds: t.rounds,
     // P0-2（PR-D，#169）：maxRounds 旧数据落盘 0 视为未设限 → 归一为 null
     //（0/负/null/undefined 一律不展示上限，与 ledger.update maxRounds>0 判据一致）。
-    maxRounds: t.maxRounds !== null && t.maxRounds !== undefined && t.maxRounds > 0 ? t.maxRounds : null,
+    maxRounds: t.maxRounds !== null && t.maxRounds === undefined && t.maxRounds > 0 ? t.maxRounds : null,
     touched: [...t.touched],
     rev: t.rev,
killedBy: T2 保守投影：缺省字段 → null maxRounds>0 如实投影（设限任务保留上限）
statusReason: expected null to be 3 // Object.is equality

[Killed] EqualityOperator
src/runtime/view/detail.ts:224:69
     rounds: t.rounds,
     // P0-2（PR-D，#169）：maxRounds 旧数据落盘 0 视为未设限 → 归一为 null
     //（0/负/null/undefined 一律不展示上限，与 ledger.update maxRounds>0 判据一致）。
-    maxRounds: t.maxRounds !== null && t.maxRounds !== undefined && t.maxRounds > 0 ? t.maxRounds : null,
+    maxRounds: t.maxRounds !== null && t.maxRounds !== undefined && t.maxRounds >= 0 ? t.maxRounds : null,
     touched: [...t.touched],
     rev: t.rev,
killedBy: T2 保守投影：缺省字段 → null maxRounds=0 视为未设上限 → 归一为 null（PR-D #169：旧数据 0 落盘，读侧归一）
statusReason: expected { id: 'task-1', title: '样例任务', …(10) } to match object { assignee: 'qa', …(2) }
(9 matching properties omitted from actual)

[Killed] LogicalOperator
src/runtime/view/detail.ts:229:15
     rev: t.rev,
     createdAt: t.createdAt,
     updatedAt: t.updatedAt,
-    artifact: t.artifact ?? null,
+    artifact: t.artifact && null,
   };
 }
killedBy: T2 保守投影：缺省字段 → null assignee/maxRounds/artifact 缺省（undefined）一律投影为 null
statusReason: expected { id: 'task-1', title: '样例任务', …(10) } to match object { id: 'task-1', assignee: null, …(2) }
(8 matching properties omitted from actual)

[Killed] BlockStatement
src/runtime/view/detail.ts:234:72
 }
 
 /** updatedAt desc 排序，同值以 id asc 稳定 tiebreak（uuid 纯 ASCII，字典序确定）。 */
-function byUpdatedAtDesc(a: TaskLedgerView, b: TaskLedgerView): number {
-  return b.updatedAt - a.updatedAt || (a.id < b.id ? -1 : a.id > b.id ? 1 : 0);
-}
+function byUpdatedAtDesc(a: TaskLedgerView, b: TaskLedgerView): number {}
 
 /**
killedBy: T3 任务排序确定性 按 updatedAt desc；同值按 id asc 稳定 tiebreak
statusReason: expected [ 'task-b', 'task-a', 'task-z' ] to deeply equal [ 'task-z', 'task-a', 'task-b' ]

[Killed] EqualityOperator
src/runtime/view/detail.ts:235:40
 
 /** updatedAt desc 排序，同值以 id asc 稳定 tiebreak（uuid 纯 ASCII，字典序确定）。 */
 function byUpdatedAtDesc(a: TaskLedgerView, b: TaskLedgerView): number {
-  return b.updatedAt - a.updatedAt || (a.id < b.id ? -1 : a.id > b.id ? 1 : 0);
+  return b.updatedAt - a.updatedAt || (a.id >= b.id ? -1 : a.id > b.id ? 1 : 0);
 }
 
killedBy: T3 任务排序确定性 按 updatedAt desc；同值按 id asc 稳定 tiebreak
statusReason: expected [ 'task-z', 'task-b', 'task-a' ] to deeply equal [ 'task-z', 'task-a', 'task-b' ]

[Killed] ConditionalExpression
src/runtime/view/detail.ts:235:10
 
 /** updatedAt desc 排序，同值以 id asc 稳定 tiebreak（uuid 纯 ASCII，字典序确定）。 */
 function byUpdatedAtDesc(a: TaskLedgerView, b: TaskLedgerView): number {
-  return b.updatedAt - a.updatedAt || (a.id < b.id ? -1 : a.id > b.id ? 1 : 0);
+  return false;
 }
 
killedBy: T3 任务排序确定性 按 updatedAt desc；同值按 id asc 稳定 tiebreak
statusReason: expected [ 'task-b', 'task-a', 'task-z' ] to deeply equal [ 'task-z', 'task-a', 'task-b' ]

[Killed] MethodExpression
src/runtime/view/detail.ts:245:18
 function sortAndCapEnvelopes(
   mailboxes: readonly MailboxHeadView[],
 ): MailboxHeadView[] {
-  const sorted = [...mailboxes].sort(
-    (a, b) => b.createdAt - a.createdAt || (a.id < b.id ? -1 : a.id > b.id ? 1 : 0),
-  );
+  const sorted = [...mailboxes];
   const seen = new Map<string, number>();
   const kept: MailboxHeadView[] = [];
killedBy: GET /api/xiaozhuge/team/detail T14: happy path——全字段形状 + stale/awaiting 划分正确
statusReason: expected [ …(2) ] to deeply equal [ …(2) ]

[Killed] ArithmeticOperator
src/runtime/view/detail.ts:246:15
   mailboxes: readonly MailboxHeadView[],
 ): MailboxHeadView[] {
   const sorted = [...mailboxes].sort(
-    (a, b) => b.createdAt - a.createdAt || (a.id < b.id ? -1 : a.id > b.id ? 1 : 0),
+    (a, b) => b.createdAt + a.createdAt || (a.id < b.id ? -1 : a.id > b.id ? 1 : 0),
   );
   const seen = new Map<string, number>();
killedBy: GET /api/xiaozhuge/team/detail T14: happy path——全字段形状 + stale/awaiting 划分正确
statusReason: expected [ …(2) ] to deeply equal [ …(2) ]

[Killed] EqualityOperator
src/runtime/view/detail.ts:246:45
   mailboxes: readonly MailboxHeadView[],
 ): MailboxHeadView[] {
   const sorted = [...mailboxes].sort(
-    (a, b) => b.createdAt - a.createdAt || (a.id < b.id ? -1 : a.id > b.id ? 1 : 0),
+    (a, b) => b.createdAt - a.createdAt || (a.id >= b.id ? -1 : a.id > b.id ? 1 : 0),
   );
   const seen = new Map<string, number>();
killedBy: GET /api/xiaozhuge/team/detail T14: happy path——全字段形状 + stale/awaiting 划分正确
statusReason: expected [ …(2) ] to deeply equal [ …(2) ]

[Killed] ArrayDeclaration
src/runtime/view/detail.ts:249:35
     (a, b) => b.createdAt - a.createdAt || (a.id < b.id ? -1 : a.id > b.id ? 1 : 0),
   );
   const seen = new Map<string, number>();
-  const kept: MailboxHeadView[] = [];
+  const kept: MailboxHeadView[] = ["Stryker was here"];
   for (const head of sorted) {
     // 显式重建对象而非透传引用：即使未来入参意外携带 body 等多余字段，
killedBy: GET /api/xiaozhuge/team/detail T13: team.yaml 不在场 → 200 全空形短路（isTeam:false），不读任何数据文件
statusReason: expected { isTeam: false, tasks: [], …(8) } to deeply equal { isTeam: false, tasks: [], …(8) }

[Killed] BlockStatement
src/runtime/view/detail.ts:250:30
   );
   const seen = new Map<string, number>();
   const kept: MailboxHeadView[] = [];
-  for (const head of sorted) {
-    // 显式重建对象而非透传引用：即使未来入参意外携带 body 等多余字段，
-    // 输出形状也始终锁定八键白名单（防御性拷贝纪律的最后防线）。
-    const projected: MailboxHeadView = {
-      id: head.id,
-      to: head.to,
-      from: head.from,
-      type: head.type,
-      state: head.state,
-      createdAt: head.createdAt,
-      summary: head.summary ?? null,
-    };
-    const bucket = `${head.to}\u0000${head.state}`;
-    const count = seen.get(bucket) ?? 0;
-    if (count >= MAILBOX_PER_STATE_LIMIT) continue;
-    seen.set(bucket, count + 1);
-    kept.push(projected);
-  }
+  for (const head of sorted) {}
   return kept;
 }
killedBy: GET /api/xiaozhuge/team/detail T14: happy path——全字段形状 + stale/awaiting 划分正确
statusReason: expected [] to deeply equal [ …(2) ]

[Killed] LogicalOperator
src/runtime/view/detail.ts:260:16
       type: head.type,
       state: head.state,
       createdAt: head.createdAt,
-      summary: head.summary ?? null,
+      summary: head.summary && null,
     };
     const bucket = `${head.to}\u0000${head.state}`;
killedBy: GET /api/xiaozhuge/team/detail T14b: task-assign 信封 body 带 task_id+title → 白名单摘要入投影（PR-B，#169）
statusReason: expected [ { id: 'env-assign', …(6) } ] to deeply equal [ { id: 'env-assign', …(6) } ]

[Killed] LogicalOperator
src/runtime/view/detail.ts:263:19
       summary: head.summary ?? null,
     };
     const bucket = `${head.to}\u0000${head.state}`;
-    const count = seen.get(bucket) ?? 0;
+    const count = seen.get(bucket) && 0;
     if (count >= MAILBOX_PER_STATE_LIMIT) continue;
     seen.set(bucket, count + 1);
killedBy: T7 信封排序与公平截断 每成员每 state 截至最新 5 条
statusReason: expected [ 'e7', 'e6', 'e5', 'e4', 'e3', …(3) ] to deeply equal [ 'e7', 'e6', 'e5', 'e4', 'e3' ]

[Killed] EqualityOperator
src/runtime/view/detail.ts:264:9
     };
     const bucket = `${head.to}\u0000${head.state}`;
     const count = seen.get(bucket) ?? 0;
-    if (count >= MAILBOX_PER_STATE_LIMIT) continue;
+    if (count > MAILBOX_PER_STATE_LIMIT) continue;
     seen.set(bucket, count + 1);
     kept.push(projected);
killedBy: T7 信封排序与公平截断 每成员每 state 截至最新 5 条
statusReason: expected [ 'e7', 'e6', 'e5', 'e4', 'e3', 'e2' ] to deeply equal [ 'e7', 'e6', 'e5', 'e4', 'e3' ]

[Killed] ConditionalExpression
src/runtime/view/detail.ts:264:9
     };
     const bucket = `${head.to}\u0000${head.state}`;
     const count = seen.get(bucket) ?? 0;
-    if (count >= MAILBOX_PER_STATE_LIMIT) continue;
+    if (true) continue;
     seen.set(bucket, count + 1);
     kept.push(projected);
killedBy: GET /api/xiaozhuge/team/detail T14: happy path——全字段形状 + stale/awaiting 划分正确
statusReason: expected [] to deeply equal [ …(2) ]

[Killed] ArithmeticOperator
src/runtime/view/detail.ts:265:22
     const bucket = `${head.to}\u0000${head.state}`;
     const count = seen.get(bucket) ?? 0;
     if (count >= MAILBOX_PER_STATE_LIMIT) continue;
-    seen.set(bucket, count + 1);
+    seen.set(bucket, count - 1);
     kept.push(projected);
   }
killedBy: T7 信封排序与公平截断 每成员每 state 截至最新 5 条
statusReason: expected [ 'e7', 'e6', 'e5', 'e4', 'e3', …(3) ] to deeply equal [ 'e7', 'e6', 'e5', 'e4', 'e3' ]

[Killed] CallExpression
src/runtime/view/detail.ts:266:5
     const count = seen.get(bucket) ?? 0;
     if (count >= MAILBOX_PER_STATE_LIMIT) continue;
     seen.set(bucket, count + 1);
-    kept.push(projected);
+    ;
   }
   return kept;
killedBy: T5 信封白名单投影（脱敏防线） 入参意外携带 body/payload 等多余键也不出投影面：严格八键 toEqual + 序列化负向断言
statusReason: expected [] to deeply equal [ { id: 'env-1', to: 'coder', …(5) } ]

[Killed] BlockStatement
src/runtime/view/detail.ts:272:62
 }
 
 /** 从分片 ext 提取 current_activity（非空字符串才认可；机械取值零生成；其余 ext 键一律不透传）。 */
-function currentActivityFromExt(ext: unknown): string | null {
-  if (ext !== null && typeof ext === "object") {
-    const v = (ext as { current_activity?: unknown }).current_activity;
-    if (typeof v === "string" && v.length > 0) return v;
-  }
-  return null;
-}
+function currentActivityFromExt(ext: unknown): string | null {}
 
 /**
killedBy: T8 分片 ext 白名单 current_activity 单键提取；其余 ext 键不泄漏（负向断言）
statusReason: expected { room: 'root', role: 'coder', …(3) } to deeply equal { room: 'root', role: 'coder', …(3) }

[Killed] ConditionalExpression
src/runtime/view/detail.ts:273:23
 
 /** 从分片 ext 提取 current_activity（非空字符串才认可；机械取值零生成；其余 ext 键一律不透传）。 */
 function currentActivityFromExt(ext: unknown): string | null {
-  if (ext !== null && typeof ext === "object") {
+  if (ext !== null && true) {
     const v = (ext as { current_activity?: unknown }).current_activity;
     if (typeof v === "string" && v.length > 0) return v;
killedBy: T8 分片 ext 白名单 ext 缺失 / current_activity 非字符串 / 空串 / ext 为原始值 → currentActivity 均为 null
statusReason: Cannot read properties of undefined (reading 'current_activity')

[Killed] EqualityOperator
src/runtime/view/detail.ts:273:7
 
 /** 从分片 ext 提取 current_activity（非空字符串才认可；机械取值零生成；其余 ext 键一律不透传）。 */
 function currentActivityFromExt(ext: unknown): string | null {
-  if (ext !== null && typeof ext === "object") {
+  if (ext === null && typeof ext === "object") {
     const v = (ext as { current_activity?: unknown }).current_activity;
     if (typeof v === "string" && v.length > 0) return v;
killedBy: T8 分片 ext 白名单 current_activity 单键提取；其余 ext 键不泄漏（负向断言）
statusReason: expected { room: 'root', role: 'coder', …(3) } to deeply equal { room: 'root', role: 'coder', …(3) }

[Killed] ConditionalExpression
src/runtime/view/detail.ts:275:34
 function currentActivityFromExt(ext: unknown): string | null {
   if (ext !== null && typeof ext === "object") {
     const v = (ext as { current_activity?: unknown }).current_activity;
-    if (typeof v === "string" && v.length > 0) return v;
+    if (typeof v === "string" && true) return v;
   }
   return null;
killedBy: T8 分片 ext 白名单 ext 缺失 / current_activity 非字符串 / 空串 / ext 为原始值 → currentActivity 均为 null
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/runtime/view/detail.ts:275:9
 function currentActivityFromExt(ext: unknown): string | null {
   if (ext !== null && typeof ext === "object") {
     const v = (ext as { current_activity?: unknown }).current_activity;
-    if (typeof v === "string" && v.length > 0) return v;
+    if (true) return v;
   }
   return null;
killedBy: T8 分片 ext 白名单 ext 缺失 / current_activity 非字符串 / 空串 / ext 为原始值 → currentActivity 均为 null
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/runtime/view/detail.ts:290:95
   registry: TeamRegistry,
   shards: readonly Shard[],
   nowMs: number,
-): { masterIdle: boolean; staleMembers: StaleAnnotation[]; awaitingInput: StaleAnnotation[] } {
-  // 黑板 blocked 免责索引：任一房间的任一 blocked 分片即豁免（跨房间平铺命中）。
-  const blockedRoles = new Set<string>();
-  for (const shard of shards) {
-    if (shard.status === "blocked") blockedRoles.add(shard.role);
-  }
-  return staleVerdict(Object.values(registry.members), blockedRoles, nowMs);
-}
+): { masterIdle: boolean; staleMembers: StaleAnnotation[]; awaitingInput: StaleAnnotation[] } {}
 
 /**
killedBy: GET /api/xiaozhuge/team/detail T13: team.yaml 不在场 → 200 全空形短路（isTeam:false），不读任何数据文件
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/runtime/view/detail.ts:293:31
 ): { masterIdle: boolean; staleMembers: StaleAnnotation[]; awaitingInput: StaleAnnotation[] } {
   // 黑板 blocked 免责索引：任一房间的任一 blocked 分片即豁免（跨房间平铺命中）。
   const blockedRoles = new Set<string>();
-  for (const shard of shards) {
-    if (shard.status === "blocked") blockedRoles.add(shard.role);
-  }
+  for (const shard of shards) {}
   return staleVerdict(Object.values(registry.members), blockedRoles, nowMs);
 }
killedBy: T10 stale 判定矩阵（对齐 ADR 0016；镜像 handlers reconcile） d. 任一房间存在 blocked 分片 → 入 awaitingInput 免责档且不同时在 staleMembers
statusReason: expected [] to deeply equal [ { member: 'qa', …(1) } ]

[Killed] EqualityOperator
src/runtime/view/detail.ts:294:9
   // 黑板 blocked 免责索引：任一房间的任一 blocked 分片即豁免（跨房间平铺命中）。
   const blockedRoles = new Set<string>();
   for (const shard of shards) {
-    if (shard.status === "blocked") blockedRoles.add(shard.role);
+    if (shard.status !== "blocked") blockedRoles.add(shard.role);
   }
   return staleVerdict(Object.values(registry.members), blockedRoles, nowMs);
killedBy: T10 stale 判定矩阵（对齐 ADR 0016；镜像 handlers reconcile） d. 任一房间存在 blocked 分片 → 入 awaitingInput 免责档且不同时在 staleMembers
statusReason: expected [] to deeply equal [ { member: 'qa', …(1) } ]

[Killed] CallExpression
src/runtime/view/detail.ts:294:37
   // 黑板 blocked 免责索引：任一房间的任一 blocked 分片即豁免（跨房间平铺命中）。
   const blockedRoles = new Set<string>();
   for (const shard of shards) {
-    if (shard.status === "blocked") blockedRoles.add(shard.role);
+    if (shard.status === "blocked") ;
   }
   return staleVerdict(Object.values(registry.members), blockedRoles, nowMs);
killedBy: T10 stale 判定矩阵（对齐 ADR 0016；镜像 handlers reconcile） d. 任一房间存在 blocked 分片 → 入 awaitingInput 免责档且不同时在 staleMembers
statusReason: expected [] to deeply equal [ { member: 'qa', …(1) } ]

[Killed] EqualityOperator
src/runtime/view/detail.ts:306:7
  */
 function summaryOf(type: string, payload: unknown): string | null {
   const p = payload as Record<string, unknown> | null;
-  if (p === null || typeof p !== "object") return null;
+  if (p !== null || typeof p !== "object") return null;
   const str = (v: unknown): string | null => (typeof v === "string" && v.length > 0 ? v : null);
   switch (type) {
killedBy: Q2 事件投影：白名单摘要 task/update / handoff / mailbox/deliver / member/status / spawn 机械摘录
statusReason: expected [ Array(5) ] to match object [ Array(5) ]
(10 matching properties omitted from actual)

[Killed] EqualityOperator
src/runtime/view/detail.ts:306:21
  */
 function summaryOf(type: string, payload: unknown): string | null {
   const p = payload as Record<string, unknown> | null;
-  if (p === null || typeof p !== "object") return null;
+  if (p === null || typeof p === "object") return null;
   const str = (v: unknown): string | null => (typeof v === "string" && v.length > 0 ? v : null);
   switch (type) {
killedBy: Q2 事件投影：白名单摘要 task/update / handoff / mailbox/deliver / member/status / spawn 机械摘录
statusReason: expected [ Array(5) ] to match object [ Array(5) ]
(10 matching properties omitted from actual)

[Killed] EqualityOperator
src/runtime/view/detail.ts:307:72
 function summaryOf(type: string, payload: unknown): string | null {
   const p = payload as Record<string, unknown> | null;
   if (p === null || typeof p !== "object") return null;
-  const str = (v: unknown): string | null => (typeof v === "string" && v.length > 0 ? v : null);
+  const str = (v: unknown): string | null => (typeof v === "string" && v.length <= 0 ? v : null);
   switch (type) {
     case "task/update": {
killedBy: Q2 事件投影：白名单摘要 task/update / handoff / mailbox/deliver / member/status / spawn 机械摘录
statusReason: expected [ Array(5) ] to match object [ Array(5) ]
(10 matching properties omitted from actual)

[Killed] ConditionalExpression
src/runtime/view/detail.ts:307:47
 function summaryOf(type: string, payload: unknown): string | null {
   const p = payload as Record<string, unknown> | null;
   if (p === null || typeof p !== "object") return null;
-  const str = (v: unknown): string | null => (typeof v === "string" && v.length > 0 ? v : null);
+  const str = (v: unknown): string | null => (false ? v : null);
   switch (type) {
     case "task/update": {
killedBy: Q2 事件投影：白名单摘要 task/update / handoff / mailbox/deliver / member/status / spawn 机械摘录
statusReason: expected [ Array(5) ] to match object [ Array(5) ]
(10 matching properties omitted from actual)

[Killed] ConditionalExpression
src/runtime/view/detail.ts:309:5
   if (p === null || typeof p !== "object") return null;
   const str = (v: unknown): string | null => (typeof v === "string" && v.length > 0 ? v : null);
   switch (type) {
-    case "task/update": {
-      const id = str(p.task_id);
-      const status = str(p.status);
-      if (id === null || status === null) return null;
-      // P0-1（#169 复核）：title 是 PR-C 增强项而非必需项——历史事件无 title
-      // 字段时退化旧格式，避免「新增字段导致历史摘要整体 null 回退」。
-      const title = str(p.title);
-      return title !== null ? `task ${id}（${title}）→ ${status}` : `task ${id} → ${status}`;
-    }
+    case "task/update":
     case "task/create": {
       const id = str(p.task_id);
killedBy: Q2 事件投影：白名单摘要 task/update / handoff / mailbox/deliver / member/status / spawn 机械摘录
statusReason: expected [ Array(5) ] to match object [ Array(5) ]
(2 matching properties omitted from actual)

[Killed] BlockStatement
src/runtime/view/detail.ts:309:25
   if (p === null || typeof p !== "object") return null;
   const str = (v: unknown): string | null => (typeof v === "string" && v.length > 0 ? v : null);
   switch (type) {
-    case "task/update": {
-      const id = str(p.task_id);
-      const status = str(p.status);
-      if (id === null || status === null) return null;
-      // P0-1（#169 复核）：title 是 PR-C 增强项而非必需项——历史事件无 title
-      // 字段时退化旧格式，避免「新增字段导致历史摘要整体 null 回退」。
-      const title = str(p.title);
-      return title !== null ? `task ${id}（${title}）→ ${status}` : `task ${id} → ${status}`;
-    }
+    case "task/update": {}
     case "task/create": {
       const id = str(p.task_id);
killedBy: Q2 事件投影：白名单摘要 task/update / handoff / mailbox/deliver / member/status / spawn 机械摘录
statusReason: expected [ Array(5) ] to match object [ Array(5) ]
(2 matching properties omitted from actual)

[Killed] EqualityOperator
src/runtime/view/detail.ts:312:26
     case "task/update": {
       const id = str(p.task_id);
       const status = str(p.status);
-      if (id === null || status === null) return null;
+      if (id === null || status !== null) return null;
       // P0-1（#169 复核）：title 是 PR-C 增强项而非必需项——历史事件无 title
       // 字段时退化旧格式，避免「新增字段导致历史摘要整体 null 回退」。
killedBy: Q2 事件投影：白名单摘要 task/update / handoff / mailbox/deliver / member/status / spawn 机械摘录
statusReason: expected [ Array(5) ] to match object [ Array(5) ]
(2 matching properties omitted from actual)

[Killed] ConditionalExpression
src/runtime/view/detail.ts:312:11
     case "task/update": {
       const id = str(p.task_id);
       const status = str(p.status);
-      if (id === null || status === null) return null;
+      if (false) return null;
       // P0-1（#169 复核）：title 是 PR-C 增强项而非必需项——历史事件无 title
       // 字段时退化旧格式，避免「新增字段导致历史摘要整体 null 回退」。
killedBy: Q2 事件投影：白名单摘要 payload 字段缺省/类型不符 → 该分支摘要置 null（防拼 undefined 文案）
statusReason: expected 'task null → null' to be null

[Killed] ConditionalExpression
src/runtime/view/detail.ts:316:14
       // P0-1（#169 复核）：title 是 PR-C 增强项而非必需项——历史事件无 title
       // 字段时退化旧格式，避免「新增字段导致历史摘要整体 null 回退」。
       const title = str(p.title);
-      return title !== null ? `task ${id}（${title}）→ ${status}` : `task ${id} → ${status}`;
+      return false ? `task ${id}（${title}）→ ${status}` : `task ${id} → ${status}`;
     }
     case "task/create": {
killedBy: Q2 事件投影：白名单摘要 task/update 带 title：新格式；历史事件缺 title：退化旧格式（P0-1，#169）
statusReason: expected 'task t1 → running' to be 'task t1（实现 X）→ running' // Object.is equality

[Killed] EqualityOperator
src/runtime/view/detail.ts:316:14
       // P0-1（#169 复核）：title 是 PR-C 增强项而非必需项——历史事件无 title
       // 字段时退化旧格式，避免「新增字段导致历史摘要整体 null 回退」。
       const title = str(p.title);
-      return title !== null ? `task ${id}（${title}）→ ${status}` : `task ${id} → ${status}`;
+      return title === null ? `task ${id}（${title}）→ ${status}` : `task ${id} → ${status}`;
     }
     case "task/create": {
killedBy: Q2 事件投影：白名单摘要 task/update / handoff / mailbox/deliver / member/status / spawn 机械摘录
statusReason: expected [ Array(5) ] to match object [ Array(5) ]
(2 matching properties omitted from actual)

[Killed] ConditionalExpression
src/runtime/view/detail.ts:318:5
       const title = str(p.title);
       return title !== null ? `task ${id}（${title}）→ ${status}` : `task ${id} → ${status}`;
     }
-    case "task/create": {
-      const id = str(p.task_id);
-      const title = str(p.title);
-      return id !== null && title !== null ? `task ${id} 创建：${title}` : null;
-    }
+    case "task/create":
     case "handoff": {
       const id = str(p.task_id);
killedBy: Q2 事件投影：白名单摘要 task/create 白名单分支：摘要带任务标题（PR-B，#169）
statusReason: expected { Object (room, seq, ...) } to match object { type: 'task/create', …(2) }
(4 matching properties omitted from actual)

[Killed] BlockStatement
src/runtime/view/detail.ts:318:25
       const title = str(p.title);
       return title !== null ? `task ${id}（${title}）→ ${status}` : `task ${id} → ${status}`;
     }
-    case "task/create": {
-      const id = str(p.task_id);
-      const title = str(p.title);
-      return id !== null && title !== null ? `task ${id} 创建：${title}` : null;
-    }
+    case "task/create": {}
     case "handoff": {
       const id = str(p.task_id);
killedBy: Q2 事件投影：白名单摘要 task/create 白名单分支：摘要带任务标题（PR-B，#169）
statusReason: expected { Object (room, seq, ...) } to match object { type: 'task/create', …(2) }
(4 matching properties omitted from actual)

[Killed] ConditionalExpression
src/runtime/view/detail.ts:321:14
     case "task/create": {
       const id = str(p.task_id);
       const title = str(p.title);
-      return id !== null && title !== null ? `task ${id} 创建：${title}` : null;
+      return false ? `task ${id} 创建：${title}` : null;
     }
     case "handoff": {
killedBy: Q2 事件投影：白名单摘要 task/create 白名单分支：摘要带任务标题（PR-B，#169）
statusReason: expected { Object (room, seq, ...) } to match object { type: 'task/create', …(2) }
(4 matching properties omitted from actual)

[Killed] EqualityOperator
src/runtime/view/detail.ts:321:29
     case "task/create": {
       const id = str(p.task_id);
       const title = str(p.title);
-      return id !== null && title !== null ? `task ${id} 创建：${title}` : null;
+      return id !== null && title === null ? `task ${id} 创建：${title}` : null;
     }
     case "handoff": {
killedBy: Q2 事件投影：白名单摘要 task/create 白名单分支：摘要带任务标题（PR-B，#169）
statusReason: expected { Object (room, seq, ...) } to match object { type: 'task/create', …(2) }
(4 matching properties omitted from actual)

[Killed] ConditionalExpression
src/runtime/view/detail.ts:323:5
       const title = str(p.title);
       return id !== null && title !== null ? `task ${id} 创建：${title}` : null;
     }
-    case "handoff": {
-      const id = str(p.task_id);
-      const to = str(p.to_role);
-      return id !== null && to !== null ? `handoff ${id} → ${to}` : null;
-    }
+    case "handoff":
     case "mailbox/deliver": {
       const to = str(p.to);
killedBy: Q2 事件投影：白名单摘要 task/update / handoff / mailbox/deliver / member/status / spawn 机械摘录
statusReason: expected [ Array(5) ] to match object [ Array(5) ]
(2 matching properties omitted from actual)

[Killed] BlockStatement
src/runtime/view/detail.ts:323:21
       const title = str(p.title);
       return id !== null && title !== null ? `task ${id} 创建：${title}` : null;
     }
-    case "handoff": {
-      const id = str(p.task_id);
-      const to = str(p.to_role);
-      return id !== null && to !== null ? `handoff ${id} → ${to}` : null;
-    }
+    case "handoff": {}
     case "mailbox/deliver": {
       const to = str(p.to);
killedBy: Q2 事件投影：白名单摘要 task/update / handoff / mailbox/deliver / member/status / spawn 机械摘录
statusReason: expected [ Array(5) ] to match object [ Array(5) ]
(2 matching properties omitted from actual)
