[Killed] BlockStatement
src/plugin/handlers.ts:49:46
 /** 统一错误形状：{ error: { code, message } }，模型可读可路由。 */
 export class ToolError extends Error {
   readonly code: string;
-  constructor(code: string, message: string) {
-    super(message);
-    this.name = "ToolError";
-    this.code = code;
-  }
+  constructor(code: string, message: string) {}
 }
 
killedBy: team/create 一键建团 未知场景给稳定错误码 unknown-scenario（HTTP 400）
statusReason: no-such-template: expected 409 to be 400 // Object.is equality

[Killed] StringLiteral
src/plugin/handlers.ts:57:86
 }
 
 /** 包根目录（dist 与 src 双形态均回溯到仓根），builtin 模板定位用。 */
-export const PACKAGE_ROOT = join(fileURLToPath(new URL(".", import.meta.url)), "..", "..");
+export const PACKAGE_ROOT = join(fileURLToPath(new URL(".", import.meta.url)), "..", "");
 
 function wrap(error: unknown): never {
killedBy: 场景枚举 列出全部 builtin 场景（oss-maintenance + research-report）带 source 标记
statusReason: expected [] to deeply equal [ …(2) ]

[Killed] BlockStatement
src/plugin/handlers.ts:59:38
 /** 包根目录（dist 与 src 双形态均回溯到仓根），builtin 模板定位用。 */
 export const PACKAGE_ROOT = join(fileURLToPath(new URL(".", import.meta.url)), "..", "..");
 
-function wrap(error: unknown): never {
-  if (error instanceof ToolError) throw error;
-  const e = error as { code?: string; message?: string };
-  throw new ToolError(e.code ?? "internal-error", e.message ?? String(error));
-}
+function wrap(error: unknown): never {}
 
 /** 必填字符串参数校验（裸 definition 无自动校验，S1 结论）。 */
killedBy: team/create 一键建团 未知场景给稳定错误码 unknown-scenario（HTTP 400）
statusReason: Unexpected end of JSON input

[Survived] ConditionalExpression
src/plugin/handlers.ts:60:7
 export const PACKAGE_ROOT = join(fileURLToPath(new URL(".", import.meta.url)), "..", "..");
 
 function wrap(error: unknown): never {
-  if (error instanceof ToolError) throw error;
+  if (true) throw error;
   const e = error as { code?: string; message?: string };
   throw new ToolError(e.code ?? "internal-error", e.message ?? String(error));

[Survived] ConditionalExpression
src/plugin/handlers.ts:60:7
 export const PACKAGE_ROOT = join(fileURLToPath(new URL(".", import.meta.url)), "..", "..");
 
 function wrap(error: unknown): never {
-  if (error instanceof ToolError) throw error;
+  if (false) throw error;
   const e = error as { code?: string; message?: string };
   throw new ToolError(e.code ?? "internal-error", e.message ?? String(error));

[Killed] LogicalOperator
src/plugin/handlers.ts:62:23
 function wrap(error: unknown): never {
   if (error instanceof ToolError) throw error;
   const e = error as { code?: string; message?: string };
-  throw new ToolError(e.code ?? "internal-error", e.message ?? String(error));
+  throw new ToolError(e.code && "internal-error", e.message ?? String(error));
 }
 
killedBy: golden 场景一：init → spawn → task 全链路 单任务全流程：create→running→handoff→done，事件与账本逐项核对
statusReason: expected ToolError: task task-795c349f-85e3-4dc2-a… { code: '…' } to match object { code: 'illegal-transition' }
(1 matching property omitted from actual)

[Survived] LogicalOperator
src/plugin/handlers.ts:62:51
 function wrap(error: unknown): never {
   if (error instanceof ToolError) throw error;
   const e = error as { code?: string; message?: string };
-  throw new ToolError(e.code ?? "internal-error", e.message ?? String(error));
+  throw new ToolError(e.code ?? "internal-error", e.message && String(error));
 }
 

[Killed] BlockStatement
src/plugin/handlers.ts:66:69
 }
 
 /** 必填字符串参数校验（裸 definition 无自动校验，S1 结论）。 */
-function reqStr(args: Record<string, unknown>, key: string): string {
-  const v = args[key];
-  if (typeof v !== "string" || v.length === 0) {
-    throw new ToolError("invalid-arguments", `string field "${key}" is required`);
-  }
-  return v;
-}
+function reqStr(args: Record<string, unknown>, key: string): string {}
 
 /** 必填数字参数校验。 */
killedBy: team_dispatch 正常链路 spawn→assign→send 三步全成，注册表/账本/信箱/事件流逐项核对
statusReason: task undefined does not exist

[Killed] ConditionalExpression
src/plugin/handlers.ts:68:7
 /** 必填字符串参数校验（裸 definition 无自动校验，S1 结论）。 */
 function reqStr(args: Record<string, unknown>, key: string): string {
   const v = args[key];
-  if (typeof v !== "string" || v.length === 0) {
+  if (true) {
     throw new ToolError("invalid-arguments", `string field "${key}" is required`);
   }
killedBy: golden 场景一：init → spawn → task 全链路 单任务全流程：create→running→handoff→done，事件与账本逐项核对
statusReason: string field "member" is required

[Killed] ConditionalExpression
src/plugin/handlers.ts:68:7
 /** 必填字符串参数校验（裸 definition 无自动校验，S1 结论）。 */
 function reqStr(args: Record<string, unknown>, key: string): string {
   const v = args[key];
-  if (typeof v !== "string" || v.length === 0) {
+  if (false) {
     throw new ToolError("invalid-arguments", `string field "${key}" is required`);
   }
killedBy: golden 场景四：参数校验负矩阵 缺必填参数给稳定 code
statusReason: expected ToolError: recipient undefined is not reg… { code: '…' } to match object { code: 'invalid-arguments' }
(1 matching property omitted from actual)

[Killed] BlockStatement
src/plugin/handlers.ts:75:69
 }
 
 /** 必填数字参数校验。 */
-function reqNum(args: Record<string, unknown>, key: string): number {
-  const v = args[key];
-  if (typeof v !== "number" || !Number.isFinite(v)) {
-    throw new ToolError("invalid-arguments", `number field "${key}" is required`);
-  }
-  return v;
-}
+function reqNum(args: Record<string, unknown>, key: string): number {}
 
 function optStr(args: Record<string, unknown>, key: string): string | undefined {
killedBy: team_dispatch 正常链路 spawn→assign→send 三步全成，注册表/账本/信箱/事件流逐项核对
statusReason: expected { member: 'coder', …(3) } to match object { member: 'coder', …(3) }
(1 matching property omitted from actual)

[Killed] ConditionalExpression
src/plugin/handlers.ts:77:7
 /** 必填数字参数校验。 */
 function reqNum(args: Record<string, unknown>, key: string): number {
   const v = args[key];
-  if (typeof v !== "number" || !Number.isFinite(v)) {
+  if (true) {
     throw new ToolError("invalid-arguments", `number field "${key}" is required`);
   }
killedBy: team_dispatch 正常链路 spawn→assign→send 三步全成，注册表/账本/信箱/事件流逐项核对
statusReason: number field "tier" is required

[Killed] BooleanLiteral
src/plugin/handlers.ts:77:32
 /** 必填数字参数校验。 */
 function reqNum(args: Record<string, unknown>, key: string): number {
   const v = args[key];
-  if (typeof v !== "number" || !Number.isFinite(v)) {
+  if (typeof v !== "number" || Number.isFinite(v)) {
     throw new ToolError("invalid-arguments", `number field "${key}" is required`);
   }
killedBy: golden 场景五：team_dispatch 复合派发（ADR 0015） dispatch 一步完成 spawn→assign→send，事件流与信封逐项核对
statusReason: number field "tier" is required

[Killed] StringLiteral
src/plugin/handlers.ts:78:25
 function reqNum(args: Record<string, unknown>, key: string): number {
   const v = args[key];
   if (typeof v !== "number" || !Number.isFinite(v)) {
-    throw new ToolError("invalid-arguments", `number field "${key}" is required`);
+    throw new ToolError("", `number field "${key}" is required`);
   }
   return v;
killedBy: team_dispatch 前置校验（无副作用） 缺参逐项拒绝（tier 必填数字）
statusReason: expected ToolError: number field "tier" is required { code: '' } to match object { code: 'invalid-arguments' }
(1 matching property omitted from actual)

[Killed] BlockStatement
src/plugin/handlers.ts:83:81
   return v;
 }
 
-function optStr(args: Record<string, unknown>, key: string): string | undefined {
-  const v = args[key];
-  if (v === undefined) return undefined;
-  if (typeof v !== "string") throw new ToolError("invalid-arguments", `field "${key}" must be a string`);
-  return v;
-}
+function optStr(args: Record<string, unknown>, key: string): string | undefined {}
 
 function optNum(args: Record<string, unknown>, key: string): number | undefined {
killedBy: golden 场景一：init → spawn → task 全链路 单任务全流程：create→running→handoff→done，事件与账本逐项核对
statusReason: promise resolved "{ ok: true, …(3) }" instead of rejecting

[Killed] ConditionalExpression
src/plugin/handlers.ts:85:7
 
 function optStr(args: Record<string, unknown>, key: string): string | undefined {
   const v = args[key];
-  if (v === undefined) return undefined;
+  if (false) return undefined;
   if (typeof v !== "string") throw new ToolError("invalid-arguments", `field "${key}" must be a string`);
   return v;
killedBy: 必填参数缺失矩阵 spawn: 缺数值 tier
statusReason: expected ToolError: field "parent" must be a string { code: '…' } to match object { code: 'invalid-arguments', …(1) }
(1 matching property omitted from actual)

[Killed] ConditionalExpression
src/plugin/handlers.ts:85:7
 
 function optStr(args: Record<string, unknown>, key: string): string | undefined {
   const v = args[key];
-  if (v === undefined) return undefined;
+  if (true) return undefined;
   if (typeof v !== "string") throw new ToolError("invalid-arguments", `field "${key}" must be a string`);
   return v;
killedBy: team_dispatch 正常链路 spawn→assign→send 三步全成，注册表/账本/信箱/事件流逐项核对
statusReason: expected { …(6) } to match object { from: 'root', to: 'coder', …(2) }
(2 matching properties omitted from actual)

[Killed] EqualityOperator
src/plugin/handlers.ts:86:7
 function optStr(args: Record<string, unknown>, key: string): string | undefined {
   const v = args[key];
   if (v === undefined) return undefined;
-  if (typeof v !== "string") throw new ToolError("invalid-arguments", `field "${key}" must be a string`);
+  if (typeof v === "string") throw new ToolError("invalid-arguments", `field "${key}" must be a string`);
   return v;
 }
killedBy: team_dispatch 正常链路 spawn→assign→send 三步全成，注册表/账本/信箱/事件流逐项核对
statusReason: field "provider" must be a string

[Killed] ConditionalExpression
src/plugin/handlers.ts:86:7
 function optStr(args: Record<string, unknown>, key: string): string | undefined {
   const v = args[key];
   if (v === undefined) return undefined;
-  if (typeof v !== "string") throw new ToolError("invalid-arguments", `field "${key}" must be a string`);
+  if (true) throw new ToolError("invalid-arguments", `field "${key}" must be a string`);
   return v;
 }
killedBy: team_dispatch 正常链路 spawn→assign→send 三步全成，注册表/账本/信箱/事件流逐项核对
statusReason: field "provider" must be a string

[Killed] BlockStatement
src/plugin/handlers.ts:90:81
   return v;
 }
 
-function optNum(args: Record<string, unknown>, key: string): number | undefined {
-  const v = args[key];
-  if (v === undefined) return undefined;
-  if (typeof v !== "number" || !Number.isFinite(v)) {
-    throw new ToolError("invalid-arguments", `field "${key}" must be a number`);
-  }
-  return v;
-}
+function optNum(args: Record<string, unknown>, key: string): number | undefined {}
 
 function optStrArray(args: Record<string, unknown>, key: string): string[] | undefined {
killedBy: team_dispatch 半事务语义 step2 rev 冲突即停：已完成 spawn 随错误留痕，assignee 未变、无信封
statusReason: promise resolved "{ ok: true, member: 'coder', …(4) }" instead of rejecting

[Killed] EqualityOperator
src/plugin/handlers.ts:92:7
 
 function optNum(args: Record<string, unknown>, key: string): number | undefined {
   const v = args[key];
-  if (v === undefined) return undefined;
+  if (v !== undefined) return undefined;
   if (typeof v !== "number" || !Number.isFinite(v)) {
     throw new ToolError("invalid-arguments", `field "${key}" must be a number`);
killedBy: team_dispatch 正常链路 spawn→assign→send 三步全成，注册表/账本/信箱/事件流逐项核对
statusReason: field "max_rounds" must be a number

[Killed] ConditionalExpression
src/plugin/handlers.ts:93:7
 function optNum(args: Record<string, unknown>, key: string): number | undefined {
   const v = args[key];
   if (v === undefined) return undefined;
-  if (typeof v !== "number" || !Number.isFinite(v)) {
+  if (true) {
     throw new ToolError("invalid-arguments", `field "${key}" must be a number`);
   }
killedBy: team_dispatch 半事务语义 step2 rev 冲突即停：已完成 spawn 随错误留痕，assignee 未变、无信封
statusReason: field "rounds" must be a number

[Killed] EqualityOperator
src/plugin/handlers.ts:93:7
 function optNum(args: Record<string, unknown>, key: string): number | undefined {
   const v = args[key];
   if (v === undefined) return undefined;
-  if (typeof v !== "number" || !Number.isFinite(v)) {
+  if (typeof v === "number" || !Number.isFinite(v)) {
     throw new ToolError("invalid-arguments", `field "${key}" must be a number`);
   }
killedBy: team_dispatch 半事务语义 step2 rev 冲突即停：已完成 spawn 随错误留痕，assignee 未变、无信封
statusReason: field "rounds" must be a number

[Killed] StringLiteral
src/plugin/handlers.ts:94:25
   const v = args[key];
   if (v === undefined) return undefined;
   if (typeof v !== "number" || !Number.isFinite(v)) {
-    throw new ToolError("invalid-arguments", `field "${key}" must be a number`);
+    throw new ToolError("", `field "${key}" must be a number`);
   }
   return v;
killedBy: 可选字段类型违规矩阵 spawn.tier 非数字
statusReason: expected ToolError: field "tier" must be a number { code: '' } to match object { code: 'invalid-arguments', …(1) }
(1 matching property omitted from actual)

[Killed] BlockStatement
src/plugin/handlers.ts:99:88
   return v;
 }
 
-function optStrArray(args: Record<string, unknown>, key: string): string[] | undefined {
-  const v = args[key];
-  if (v === undefined) return undefined;
-  if (!Array.isArray(v) || v.some((x) => typeof x !== "string")) {
-    throw new ToolError("invalid-arguments", `field "${key}" must be a string array`);
-  }
-  return v as string[];
-}
+function optStrArray(args: Record<string, unknown>, key: string): string[] | undefined {}
 
 /** role_inline 白名单（对齐模板 role schema 的动态字段，ADR 0015：随信封投递不持久化）。 */
killedBy: team_dispatch 正常链路 spawn→assign→send 三步全成，注册表/账本/信箱/事件流逐项核对
statusReason: role_inline.dod must be a string array

[Killed] MethodExpression
src/plugin/handlers.ts:102:28
 function optStrArray(args: Record<string, unknown>, key: string): string[] | undefined {
   const v = args[key];
   if (v === undefined) return undefined;
-  if (!Array.isArray(v) || v.some((x) => typeof x !== "string")) {
+  if (!Array.isArray(v) || v.every(x => typeof x !== "string")) {
     throw new ToolError("invalid-arguments", `field "${key}" must be a string array`);
   }
killedBy: golden 场景一：init → spawn → task 全链路 单任务全流程：create→running→handoff→done，事件与账本逐项核对
statusReason: expected ToolError: field "receipt" must be a stri… { code: '…' } to match object { code: 'receipt-incomplete' }
(1 matching property omitted from actual)

[Killed] BlockStatement
src/plugin/handlers.ts:102:66
 function optStrArray(args: Record<string, unknown>, key: string): string[] | undefined {
   const v = args[key];
   if (v === undefined) return undefined;
-  if (!Array.isArray(v) || v.some((x) => typeof x !== "string")) {
-    throw new ToolError("invalid-arguments", `field "${key}" must be a string array`);
-  }
+  if (!Array.isArray(v) || v.some((x) => typeof x !== "string")) {}
   return v as string[];
 }
killedBy: 可选字段类型违规矩阵 taskCreate.touched_paths 非字符串数组
statusReason: promise resolved "{ ok: true, …(2) }" instead of rejecting

[Killed] EqualityOperator
src/plugin/handlers.ts:113:7
 
 function optRoleInline(args: Record<string, unknown>): Record<string, unknown> | undefined {
   const v = args.role_inline;
-  if (v === undefined) return undefined;
+  if (v !== undefined) return undefined;
   if (typeof v !== "object" || v === null || Array.isArray(v)) {
     throw new ToolError("invalid-arguments", 'field "role_inline" must be an object');
killedBy: team_dispatch 正常链路 spawn→assign→send 三步全成，注册表/账本/信箱/事件流逐项核对
statusReason: expected { …(6) } to match object { from: 'root', to: 'coder', …(2) }
(2 matching properties omitted from actual)

[Killed] ConditionalExpression
src/plugin/handlers.ts:113:7
 
 function optRoleInline(args: Record<string, unknown>): Record<string, unknown> | undefined {
   const v = args.role_inline;
-  if (v === undefined) return undefined;
+  if (false) return undefined;
   if (typeof v !== "object" || v === null || Array.isArray(v)) {
     throw new ToolError("invalid-arguments", 'field "role_inline" must be an object');
killedBy: golden 场景五：team_dispatch 复合派发（ADR 0015） 半事务：rev 冲突停在 assign 前，spawn 已留痕
statusReason: expected ToolError: field "role_inline" must be an… { code: '…' } to match object { code: 'rev-conflict' }
(1 matching property omitted from actual)

[Killed] EqualityOperator
src/plugin/handlers.ts:114:7
 function optRoleInline(args: Record<string, unknown>): Record<string, unknown> | undefined {
   const v = args.role_inline;
   if (v === undefined) return undefined;
-  if (typeof v !== "object" || v === null || Array.isArray(v)) {
+  if (typeof v === "object" || v === null || Array.isArray(v)) {
     throw new ToolError("invalid-arguments", 'field "role_inline" must be an object');
   }
killedBy: team_dispatch 正常链路 spawn→assign→send 三步全成，注册表/账本/信箱/事件流逐项核对
statusReason: field "role_inline" must be an object

[Killed] EqualityOperator
src/plugin/handlers.ts:114:32
 function optRoleInline(args: Record<string, unknown>): Record<string, unknown> | undefined {
   const v = args.role_inline;
   if (v === undefined) return undefined;
-  if (typeof v !== "object" || v === null || Array.isArray(v)) {
+  if (typeof v !== "object" || v !== null || Array.isArray(v)) {
     throw new ToolError("invalid-arguments", 'field "role_inline" must be an object');
   }
killedBy: team_dispatch 正常链路 spawn→assign→send 三步全成，注册表/账本/信箱/事件流逐项核对
statusReason: field "role_inline" must be an object

[NoCoverage] StringLiteral
src/plugin/handlers.ts:115:46
   const v = args.role_inline;
   if (v === undefined) return undefined;
   if (typeof v !== "object" || v === null || Array.isArray(v)) {
-    throw new ToolError("invalid-arguments", 'field "role_inline" must be an object');
+    throw new ToolError("invalid-arguments", "");
   }
   const inline = v as Record<string, unknown>;

[Killed] BlockStatement
src/plugin/handlers.ts:118:42
     throw new ToolError("invalid-arguments", 'field "role_inline" must be an object');
   }
   const inline = v as Record<string, unknown>;
-  for (const key of Object.keys(inline)) {
-    if (!(ROLE_INLINE_FIELDS as readonly string[]).includes(key)) {
-      throw new ToolError("invalid-arguments", `unknown role_inline field "${key}"`);
-    }
-  }
+  for (const key of Object.keys(inline)) {}
   if (
     inline.prompt !== undefined &&
killedBy: team_dispatch role_inline 校验 未知字段拒绝
statusReason: promise resolved "{ ok: true, member: 'c', …(4) }" instead of rejecting

[Killed] BlockStatement
src/plugin/handlers.ts:119:67
   }
   const inline = v as Record<string, unknown>;
   for (const key of Object.keys(inline)) {
-    if (!(ROLE_INLINE_FIELDS as readonly string[]).includes(key)) {
-      throw new ToolError("invalid-arguments", `unknown role_inline field "${key}"`);
-    }
+    if (!(ROLE_INLINE_FIELDS as readonly string[]).includes(key)) {}
   }
   if (
killedBy: team_dispatch role_inline 校验 未知字段拒绝
statusReason: promise resolved "{ ok: true, member: 'c', …(4) }" instead of rejecting

[Killed] ConditionalExpression
src/plugin/handlers.ts:119:9
   }
   const inline = v as Record<string, unknown>;
   for (const key of Object.keys(inline)) {
-    if (!(ROLE_INLINE_FIELDS as readonly string[]).includes(key)) {
+    if (false) {
       throw new ToolError("invalid-arguments", `unknown role_inline field "${key}"`);
     }
killedBy: team_dispatch role_inline 校验 未知字段拒绝
statusReason: promise resolved "{ ok: true, member: 'c', …(4) }" instead of rejecting

[Killed] LogicalOperator
src/plugin/handlers.ts:124:5
     }
   }
   if (
-    inline.prompt !== undefined &&
-    (typeof inline.prompt !== "string" || inline.prompt.length === 0)
+    inline.prompt !== undefined || typeof inline.prompt !== "string" || inline.prompt.length === 0
   ) {
     throw new ToolError("invalid-arguments", 'role_inline.prompt must be a non-empty string');
killedBy: team_dispatch 正常链路 spawn→assign→send 三步全成，注册表/账本/信箱/事件流逐项核对
statusReason: role_inline.prompt must be a non-empty string

[Killed] EqualityOperator
src/plugin/handlers.ts:124:5
     }
   }
   if (
-    inline.prompt !== undefined &&
+    inline.prompt === undefined &&
     (typeof inline.prompt !== "string" || inline.prompt.length === 0)
   ) {
killedBy: team_dispatch 正常链路 spawn→assign→send 三步全成，注册表/账本/信箱/事件流逐项核对
statusReason: role_inline.prompt must be a non-empty string

[NoCoverage] LogicalOperator
src/plugin/handlers.ts:125:6
   }
   if (
     inline.prompt !== undefined &&
-    (typeof inline.prompt !== "string" || inline.prompt.length === 0)
+    (typeof inline.prompt !== "string" && inline.prompt.length === 0)
   ) {
     throw new ToolError("invalid-arguments", 'role_inline.prompt must be a non-empty string');

[NoCoverage] ConditionalExpression
src/plugin/handlers.ts:125:43
   }
   if (
     inline.prompt !== undefined &&
-    (typeof inline.prompt !== "string" || inline.prompt.length === 0)
+    (typeof inline.prompt !== "string" || false)
   ) {
     throw new ToolError("invalid-arguments", 'role_inline.prompt must be a non-empty string');

[NoCoverage] BlockStatement
src/plugin/handlers.ts:126:5
   if (
     inline.prompt !== undefined &&
     (typeof inline.prompt !== "string" || inline.prompt.length === 0)
-  ) {
-    throw new ToolError("invalid-arguments", 'role_inline.prompt must be a non-empty string');
-  }
+  ) {}
   if (
     inline.briefing !== undefined &&

[NoCoverage] StringLiteral
src/plugin/handlers.ts:127:46
     inline.prompt !== undefined &&
     (typeof inline.prompt !== "string" || inline.prompt.length === 0)
   ) {
-    throw new ToolError("invalid-arguments", 'role_inline.prompt must be a non-empty string');
+    throw new ToolError("invalid-arguments", "");
   }
   if (

[Killed] LogicalOperator
src/plugin/handlers.ts:130:5
     throw new ToolError("invalid-arguments", 'role_inline.prompt must be a non-empty string');
   }
   if (
-    inline.briefing !== undefined &&
-    (typeof inline.briefing !== "string" || inline.briefing.length === 0)
+    inline.briefing !== undefined || typeof inline.briefing !== "string" || inline.briefing.length === 0
   ) {
     throw new ToolError("invalid-arguments", 'role_inline.briefing must be a non-empty string');
killedBy: golden 场景五：team_dispatch 复合派发（ADR 0015） dispatch 一步完成 spawn→assign→send，事件流与信封逐项核对
statusReason: role_inline.briefing must be a non-empty string

[Killed] ConditionalExpression
src/plugin/handlers.ts:130:5
     throw new ToolError("invalid-arguments", 'role_inline.prompt must be a non-empty string');
   }
   if (
-    inline.briefing !== undefined &&
-    (typeof inline.briefing !== "string" || inline.briefing.length === 0)
+    true
   ) {
     throw new ToolError("invalid-arguments", 'role_inline.briefing must be a non-empty string');
killedBy: team_dispatch 正常链路 spawn→assign→send 三步全成，注册表/账本/信箱/事件流逐项核对
statusReason: role_inline.briefing must be a non-empty string

[Killed] ConditionalExpression
src/plugin/handlers.ts:131:6
   }
   if (
     inline.briefing !== undefined &&
-    (typeof inline.briefing !== "string" || inline.briefing.length === 0)
+    (true)
   ) {
     throw new ToolError("invalid-arguments", 'role_inline.briefing must be a non-empty string');
killedBy: team_dispatch 正常链路 spawn→assign→send 三步全成，注册表/账本/信箱/事件流逐项核对
statusReason: role_inline.briefing must be a non-empty string

[Killed] EqualityOperator
src/plugin/handlers.ts:131:6
   }
   if (
     inline.briefing !== undefined &&
-    (typeof inline.briefing !== "string" || inline.briefing.length === 0)
+    (typeof inline.briefing === "string" || inline.briefing.length === 0)
   ) {
     throw new ToolError("invalid-arguments", 'role_inline.briefing must be a non-empty string');
killedBy: team_dispatch 正常链路 spawn→assign→send 三步全成，注册表/账本/信箱/事件流逐项核对
statusReason: role_inline.briefing must be a non-empty string

[NoCoverage] BlockStatement
src/plugin/handlers.ts:132:5
   if (
     inline.briefing !== undefined &&
     (typeof inline.briefing !== "string" || inline.briefing.length === 0)
-  ) {
-    throw new ToolError("invalid-arguments", 'role_inline.briefing must be a non-empty string');
-  }
+  ) {}
   if (inline.dod !== undefined) {
     const probe = { dod: inline.dod };

[NoCoverage] StringLiteral
src/plugin/handlers.ts:133:25
     inline.briefing !== undefined &&
     (typeof inline.briefing !== "string" || inline.briefing.length === 0)
   ) {
-    throw new ToolError("invalid-arguments", 'role_inline.briefing must be a non-empty string');
+    throw new ToolError("", 'role_inline.briefing must be a non-empty string');
   }
   if (inline.dod !== undefined) {

[Killed] BlockStatement
src/plugin/handlers.ts:135:33
   ) {
     throw new ToolError("invalid-arguments", 'role_inline.briefing must be a non-empty string');
   }
-  if (inline.dod !== undefined) {
-    const probe = { dod: inline.dod };
-    if (optStrArray(probe, "dod") === undefined) {
-      throw new ToolError("invalid-arguments", 'role_inline.dod must be a string array');
-    }
-  }
+  if (inline.dod !== undefined) {}
   if (inline.max_hops !== undefined && (typeof inline.max_hops !== "number" || !Number.isFinite(inline.max_hops))) {
     throw new ToolError("invalid-arguments", 'role_inline.max_hops must be a number');
killedBy: team_dispatch role_inline 校验 字段类型不符拒绝
statusReason: promise resolved "{ ok: true, member: 'c', …(4) }" instead of rejecting

[Killed] EqualityOperator
src/plugin/handlers.ts:135:7
   ) {
     throw new ToolError("invalid-arguments", 'role_inline.briefing must be a non-empty string');
   }
-  if (inline.dod !== undefined) {
+  if (inline.dod === undefined) {
     const probe = { dod: inline.dod };
     if (optStrArray(probe, "dod") === undefined) {
killedBy: team_dispatch role_inline 校验 字段类型不符拒绝
statusReason: promise resolved "{ ok: true, member: 'c', …(4) }" instead of rejecting

[Killed] EqualityOperator
src/plugin/handlers.ts:137:9
   }
   if (inline.dod !== undefined) {
     const probe = { dod: inline.dod };
-    if (optStrArray(probe, "dod") === undefined) {
+    if (optStrArray(probe, "dod") !== undefined) {
       throw new ToolError("invalid-arguments", 'role_inline.dod must be a string array');
     }
killedBy: team_dispatch 正常链路 spawn→assign→send 三步全成，注册表/账本/信箱/事件流逐项核对
statusReason: role_inline.dod must be a string array

[Killed] ConditionalExpression
src/plugin/handlers.ts:137:9
   }
   if (inline.dod !== undefined) {
     const probe = { dod: inline.dod };
-    if (optStrArray(probe, "dod") === undefined) {
+    if (false) {
       throw new ToolError("invalid-arguments", 'role_inline.dod must be a string array');
     }
killedBy: team_dispatch role_inline 校验 字段类型不符拒绝
statusReason: promise resolved "{ ok: true, member: 'c', …(4) }" instead of rejecting

[Killed] ConditionalExpression
src/plugin/handlers.ts:141:41
       throw new ToolError("invalid-arguments", 'role_inline.dod must be a string array');
     }
   }
-  if (inline.max_hops !== undefined && (typeof inline.max_hops !== "number" || !Number.isFinite(inline.max_hops))) {
+  if (inline.max_hops !== undefined && (true)) {
     throw new ToolError("invalid-arguments", 'role_inline.max_hops must be a number');
   }
killedBy: team_dispatch 正常链路 spawn→assign→send 三步全成，注册表/账本/信箱/事件流逐项核对
statusReason: role_inline.max_hops must be a number

[Killed] BooleanLiteral
src/plugin/handlers.ts:141:80
       throw new ToolError("invalid-arguments", 'role_inline.dod must be a string array');
     }
   }
-  if (inline.max_hops !== undefined && (typeof inline.max_hops !== "number" || !Number.isFinite(inline.max_hops))) {
+  if (inline.max_hops !== undefined && (typeof inline.max_hops !== "number" || Number.isFinite(inline.max_hops))) {
     throw new ToolError("invalid-arguments", 'role_inline.max_hops must be a number');
   }
killedBy: team_dispatch 正常链路 spawn→assign→send 三步全成，注册表/账本/信箱/事件流逐项核对
statusReason: role_inline.max_hops must be a number

[NoCoverage] StringLiteral
src/plugin/handlers.ts:142:46
     }
   }
   if (inline.max_hops !== undefined && (typeof inline.max_hops !== "number" || !Number.isFinite(inline.max_hops))) {
-    throw new ToolError("invalid-arguments", 'role_inline.max_hops must be a number');
+    throw new ToolError("invalid-arguments", "");
   }
   if (inline.as_judge !== undefined && typeof inline.as_judge !== "boolean") {

[Killed] EqualityOperator
src/plugin/handlers.ts:144:7
   if (inline.max_hops !== undefined && (typeof inline.max_hops !== "number" || !Number.isFinite(inline.max_hops))) {
     throw new ToolError("invalid-arguments", 'role_inline.max_hops must be a number');
   }
-  if (inline.as_judge !== undefined && typeof inline.as_judge !== "boolean") {
+  if (inline.as_judge === undefined && typeof inline.as_judge !== "boolean") {
     throw new ToolError("invalid-arguments", 'role_inline.as_judge must be a boolean');
   }
killedBy: team_dispatch role_inline 校验 字段类型不符拒绝
statusReason: promise resolved "{ ok: true, member: 'c', …(4) }" instead of rejecting

[Killed] ConditionalExpression
src/plugin/handlers.ts:144:7
   if (inline.max_hops !== undefined && (typeof inline.max_hops !== "number" || !Number.isFinite(inline.max_hops))) {
     throw new ToolError("invalid-arguments", 'role_inline.max_hops must be a number');
   }
-  if (inline.as_judge !== undefined && typeof inline.as_judge !== "boolean") {
+  if (false) {
     throw new ToolError("invalid-arguments", 'role_inline.as_judge must be a boolean');
   }
killedBy: team_dispatch role_inline 校验 字段类型不符拒绝
statusReason: promise resolved "{ ok: true, member: 'c', …(4) }" instead of rejecting
