[Killed] StringLiteral
src/plugin/handlers.ts:145:25
     throw new ToolError("invalid-arguments", 'role_inline.max_hops must be a number');
   }
   if (inline.as_judge !== undefined && typeof inline.as_judge !== "boolean") {
-    throw new ToolError("invalid-arguments", 'role_inline.as_judge must be a boolean');
+    throw new ToolError("", 'role_inline.as_judge must be a boolean');
   }
   return inline;
killedBy: team_dispatch role_inline 校验 字段类型不符拒绝
statusReason: expected ToolError: role_inline.as_judge must be a… { code: '' } to match object { code: 'invalid-arguments' }
(1 matching property omitted from actual)

[Survived] StringLiteral
src/plugin/handlers.ts:145:46
     throw new ToolError("invalid-arguments", 'role_inline.max_hops must be a number');
   }
   if (inline.as_judge !== undefined && typeof inline.as_judge !== "boolean") {
-    throw new ToolError("invalid-arguments", 'role_inline.as_judge must be a boolean');
+    throw new ToolError("invalid-arguments", "");
   }
   return inline;

[Killed] BlockStatement
src/plugin/handlers.ts:184:26
   let registry: Registry | undefined;
 
   // 惰性单例：同一实例根内复用事件游标等内存状态。
-  function led(): Ledger {
-    return (ledger ??= new Ledger(teamHome, l.ledgerTasksDir));
-  }
+  function led(): Ledger {}
   function log(room: string): EventLog {
     // 同房间单写者约定下缓存游标；不同房间各自独立文件。
killedBy: team_dispatch 正常链路 spawn→assign→send 三步全成，注册表/账本/信箱/事件流逐项核对
statusReason: Cannot read properties of undefined (reading 'list')

[Killed] AssignmentOperator
src/plugin/handlers.ts:185:13
 
   // 惰性单例：同一实例根内复用事件游标等内存状态。
   function led(): Ledger {
-    return (ledger ??= new Ledger(teamHome, l.ledgerTasksDir));
+    return (ledger &&= new Ledger(teamHome, l.ledgerTasksDir));
   }
   function log(room: string): EventLog {
killedBy: team_dispatch 正常链路 spawn→assign→send 三步全成，注册表/账本/信箱/事件流逐项核对
statusReason: Cannot read properties of undefined (reading 'list')

[Killed] BlockStatement
src/plugin/handlers.ts:187:40
   function led(): Ledger {
     return (ledger ??= new Ledger(teamHome, l.ledgerTasksDir));
   }
-  function log(room: string): EventLog {
-    // 同房间单写者约定下缓存游标；不同房间各自独立文件。
-    return (events ??= new EventLog(join(l.roomsDir, room, "events.jsonl")));
-  }
+  function log(room: string): EventLog {}
   function reg(): Registry {
     return (registry ??= new Registry(teamHome));
killedBy: 可选字段类型违规矩阵 taskUpdate.rounds 非数字
statusReason: Cannot read properties of undefined (reading 'init')

[Killed] AssignmentOperator
src/plugin/handlers.ts:189:13
   }
   function log(room: string): EventLog {
     // 同房间单写者约定下缓存游标；不同房间各自独立文件。
-    return (events ??= new EventLog(join(l.roomsDir, room, "events.jsonl")));
+    return (events &&= new EventLog(join(l.roomsDir, room, "events.jsonl")));
   }
   function reg(): Registry {
killedBy: team_dispatch 正常链路 spawn→assign→send 三步全成，注册表/账本/信箱/事件流逐项核对
statusReason: Cannot read properties of undefined (reading 'init')

[Killed] BlockStatement
src/plugin/handlers.ts:191:28
     // 同房间单写者约定下缓存游标；不同房间各自独立文件。
     return (events ??= new EventLog(join(l.roomsDir, room, "events.jsonl")));
   }
-  function reg(): Registry {
-    return (registry ??= new Registry(teamHome));
-  }
+  function reg(): Registry {}
 
   async function appendEvent(actor: string, type: string, payload: unknown, room = "root"): Promise<void> {
killedBy: 可选字段类型违规矩阵 send.to 未注册成员给 unknown-member
statusReason: expected ToolError: Cannot read properties of unde… { code: '…' } to match object { code: 'unknown-member', …(1) }
(1 matching property omitted from actual)

[Killed] AssignmentOperator
src/plugin/handlers.ts:192:13
     return (events ??= new EventLog(join(l.roomsDir, room, "events.jsonl")));
   }
   function reg(): Registry {
-    return (registry ??= new Registry(teamHome));
+    return (registry &&= new Registry(teamHome));
   }
 
killedBy: 可选字段类型违规矩阵 send.to 未注册成员给 unknown-member
statusReason: expected ToolError: Cannot read properties of unde… { code: '…' } to match object { code: 'unknown-member', …(1) }
(1 matching property omitted from actual)

[Killed] BlockStatement
src/plugin/handlers.ts:195:107
     return (registry ??= new Registry(teamHome));
   }
 
-  async function appendEvent(actor: string, type: string, payload: unknown, room = "root"): Promise<void> {
-    await ensureDir(join(l.roomsDir, room));
-    const eventLog = log(room);
-    await eventLog.init();
-    await eventLog.append({ session_id: sessionId, actor, type, payload });
-  }
+  async function appendEvent(actor: string, type: string, payload: unknown, room = "root"): Promise<void> {}
 
   async function assertNoTaskConflict(taskId: string, room: string, touched: string[], mutexGroups: string[]): Promise<void> {
killedBy: golden 场景一：init → spawn → task 全链路 单任务全流程：create→running→handoff→done，事件与账本逐项核对
statusReason: expected [] to deeply equal [ 'team/init', 'team/spawn', …(5) ]

[Killed] BlockStatement
src/plugin/handlers.ts:202:126
     await eventLog.append({ session_id: sessionId, actor, type, payload });
   }
 
-  async function assertNoTaskConflict(taskId: string, room: string, touched: string[], mutexGroups: string[]): Promise<void> {
-    const { tasks } = await led().list();
-    const probe: TaskRecord = {
-      id: taskId,
-      title: "",
-      status: "running",
-      room,
-      touched,
-      mutexGroups,
-      rounds: 0,
-      maxRounds: 0,
-      dod: [],
-      rev: 1,
-      createdAt: 0,
-      updatedAt: 0,
-    };
-    const conflicts = findConflicts([...tasks.filter((t) => t.id !== taskId), probe]);
-    if (conflicts.length > 0) {
-      const c = conflicts[0]!;
-      throw new ToolError("mutex-conflict", `conflicts with ${c.a === taskId ? c.b : c.a}: ${c.reason}`);
-    }
-  }
+  async function assertNoTaskConflict(taskId: string, room: string, touched: string[], mutexGroups: string[]): Promise<void> {}
 
   return {
killedBy: golden 场景四：参数校验负矩阵 互斥冲突：同 touched path 的 running 任务拒绝新建
statusReason: promise resolved "{ ok: true, …(2) }" instead of rejecting

[Killed] ObjectLiteral
src/plugin/handlers.ts:204:31
 
   async function assertNoTaskConflict(taskId: string, room: string, touched: string[], mutexGroups: string[]): Promise<void> {
     const { tasks } = await led().list();
-    const probe: TaskRecord = {
-      id: taskId,
-      title: "",
-      status: "running",
-      room,
-      touched,
-      mutexGroups,
-      rounds: 0,
-      maxRounds: 0,
-      dod: [],
-      rev: 1,
-      createdAt: 0,
-      updatedAt: 0,
-    };
+    const probe: TaskRecord = {};
     const conflicts = findConflicts([...tasks.filter((t) => t.id !== taskId), probe]);
     if (conflicts.length > 0) {
killedBy: golden 场景四：参数校验负矩阵 互斥冲突：同 touched path 的 running 任务拒绝新建
statusReason: promise resolved "{ ok: true, …(2) }" instead of rejecting

[Killed] ConditionalExpression
src/plugin/handlers.ts:218:61
       createdAt: 0,
       updatedAt: 0,
     };
-    const conflicts = findConflicts([...tasks.filter((t) => t.id !== taskId), probe]);
+    const conflicts = findConflicts([...tasks.filter((t) => false), probe]);
     if (conflicts.length > 0) {
       const c = conflicts[0]!;
killedBy: golden 场景四：参数校验负矩阵 互斥冲突：同 touched path 的 running 任务拒绝新建
statusReason: promise resolved "{ ok: true, …(2) }" instead of rejecting

[Killed] ArrowFunction
src/plugin/handlers.ts:218:54
       createdAt: 0,
       updatedAt: 0,
     };
-    const conflicts = findConflicts([...tasks.filter((t) => t.id !== taskId), probe]);
+    const conflicts = findConflicts([...tasks.filter(() => undefined), probe]);
     if (conflicts.length > 0) {
       const c = conflicts[0]!;
killedBy: golden 场景四：参数校验负矩阵 互斥冲突：同 touched path 的 running 任务拒绝新建
statusReason: promise resolved "{ ok: true, …(2) }" instead of rejecting

[Killed] ConditionalExpression
src/plugin/handlers.ts:219:9
       updatedAt: 0,
     };
     const conflicts = findConflicts([...tasks.filter((t) => t.id !== taskId), probe]);
-    if (conflicts.length > 0) {
+    if (false) {
       const c = conflicts[0]!;
       throw new ToolError("mutex-conflict", `conflicts with ${c.a === taskId ? c.b : c.a}: ${c.reason}`);
killedBy: golden 场景四：参数校验负矩阵 互斥冲突：同 touched path 的 running 任务拒绝新建
statusReason: promise resolved "{ ok: true, …(2) }" instead of rejecting

[Killed] ConditionalExpression
src/plugin/handlers.ts:219:9
       updatedAt: 0,
     };
     const conflicts = findConflicts([...tasks.filter((t) => t.id !== taskId), probe]);
-    if (conflicts.length > 0) {
+    if (true) {
       const c = conflicts[0]!;
       throw new ToolError("mutex-conflict", `conflicts with ${c.a === taskId ? c.b : c.a}: ${c.reason}`);
killedBy: team_dispatch 正常链路 spawn→assign→send 三步全成，注册表/账本/信箱/事件流逐项核对
statusReason: Cannot read properties of undefined (reading 'a')

[Survived] EqualityOperator
src/plugin/handlers.ts:221:63
     const conflicts = findConflicts([...tasks.filter((t) => t.id !== taskId), probe]);
     if (conflicts.length > 0) {
       const c = conflicts[0]!;
-      throw new ToolError("mutex-conflict", `conflicts with ${c.a === taskId ? c.b : c.a}: ${c.reason}`);
+      throw new ToolError("mutex-conflict", `conflicts with ${c.a !== taskId ? c.b : c.a}: ${c.reason}`);
     }
   }

[Survived] ConditionalExpression
src/plugin/handlers.ts:221:63
     const conflicts = findConflicts([...tasks.filter((t) => t.id !== taskId), probe]);
     if (conflicts.length > 0) {
       const c = conflicts[0]!;
-      throw new ToolError("mutex-conflict", `conflicts with ${c.a === taskId ? c.b : c.a}: ${c.reason}`);
+      throw new ToolError("mutex-conflict", `conflicts with ${false ? c.b : c.a}: ${c.reason}`);
     }
   }

[Killed] ArrayDeclaration
src/plugin/handlers.ts:228:27
   return {
     async init(args) {
       try {
-        for (const dir of [
-          l.teamHome,
-          l.ledgerTasksDir,
-          l.roomsDir,
-          join(l.roomsDir, "root"),
-          join(l.mailboxDir, "root"),
-          l.gatesDir,
-          l.archiveDir,
-        ]) {
+        for (const dir of []) {
           mkdirSync(dir, { recursive: true });
         }
killedBy: team/create 一键建团 默认场景：init 持久化 + tier0_prompt 组装 + 快照落盘
statusReason: expected 409 to be 200 // Object.is equality

[Survived] StringLiteral
src/plugin/handlers.ts:233:30
           l.ledgerTasksDir,
           l.roomsDir,
           join(l.roomsDir, "root"),
-          join(l.mailboxDir, "root"),
+          join(l.mailboxDir, ""),
           l.gatesDir,
           l.archiveDir,

[Killed] BlockStatement
src/plugin/handlers.ts:236:12
           join(l.mailboxDir, "root"),
           l.gatesDir,
           l.archiveDir,
-        ]) {
-          mkdirSync(dir, { recursive: true });
-        }
+        ]) {}
         // room.lock CAS 幂等：同会话重入成功，异会话重复实例化拒绝。
         const outcome = await acquireCas(l.roomLock, sessionId);
killedBy: team/create 一键建团 默认场景：init 持久化 + tier0_prompt 组装 + 快照落盘
statusReason: expected 409 to be 200 // Object.is equality

[Killed] BooleanLiteral
src/plugin/handlers.ts:237:39
           l.gatesDir,
           l.archiveDir,
         ]) {
-          mkdirSync(dir, { recursive: true });
+          mkdirSync(dir, { recursive: false });
         }
         // room.lock CAS 幂等：同会话重入成功，异会话重复实例化拒绝。
killedBy: team_dispatch 正常链路 spawn→assign→send 三步全成，注册表/账本/信箱/事件流逐项核对
statusReason: EEXIST: file already exists, mkdir '/tmp/xzg-dispatch-9SLO8P'

[Killed] ConditionalExpression
src/plugin/handlers.ts:244:26
         await reg().write(await reg().read());
         // 场景选择（#47 三级来源解析）：scenario 必选或缺省，source 可选消歧，
         // project_root 控制 project 层参与。同名未指定 source → ambiguous-scenario。
-        const scenario = typeof args.scenario === "string" && args.scenario.length > 0
+        const scenario = true
           ? args.scenario
           : DEFAULT_SCENARIO;
killedBy: team/create 一键建团 默认场景：init 持久化 + tier0_prompt 组装 + 快照落盘
statusReason: expected 400 to be 200 // Object.is equality

[Killed] ConditionalExpression
src/plugin/handlers.ts:244:26
         await reg().write(await reg().read());
         // 场景选择（#47 三级来源解析）：scenario 必选或缺省，source 可选消歧，
         // project_root 控制 project 层参与。同名未指定 source → ambiguous-scenario。
-        const scenario = typeof args.scenario === "string" && args.scenario.length > 0
+        const scenario = true && args.scenario.length > 0
           ? args.scenario
           : DEFAULT_SCENARIO;
killedBy: team_dispatch 正常链路 spawn→assign→send 三步全成，注册表/账本/信箱/事件流逐项核对
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] LogicalOperator
src/plugin/handlers.ts:247:33
         const scenario = typeof args.scenario === "string" && args.scenario.length > 0
           ? args.scenario
           : DEFAULT_SCENARIO;
-        const requestedSource = typeof args.source === "string" && args.source.length > 0
+        const requestedSource = typeof args.source === "string" || args.source.length > 0
           ? (args.source as TemplateSource)
           : undefined;
killedBy: team_dispatch 正常链路 spawn→assign→send 三步全成，注册表/账本/信箱/事件流逐项核对
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] ConditionalExpression
src/plugin/handlers.ts:247:33
         const scenario = typeof args.scenario === "string" && args.scenario.length > 0
           ? args.scenario
           : DEFAULT_SCENARIO;
-        const requestedSource = typeof args.source === "string" && args.source.length > 0
+        const requestedSource = false
           ? (args.source as TemplateSource)
           : undefined;
killedBy: team/create 一键建团 同名场景指定 source 消歧：project 层命中
statusReason: expected 400 to be 200 // Object.is equality

[Killed] ConditionalExpression
src/plugin/handlers.ts:250:29
         const requestedSource = typeof args.source === "string" && args.source.length > 0
           ? (args.source as TemplateSource)
           : undefined;
-        const projectRoot = typeof args.project_root === "string" && args.project_root.length > 0
+        const projectRoot = false
           ? args.project_root
           : undefined;
killedBy: team/create 一键建团 同名场景（user+project）未指定 source → ambiguous-scenario（HTTP 400）
statusReason: expected 200 to be 400 // Object.is equality

[Killed] EqualityOperator
src/plugin/handlers.ts:250:29
         const requestedSource = typeof args.source === "string" && args.source.length > 0
           ? (args.source as TemplateSource)
           : undefined;
-        const projectRoot = typeof args.project_root === "string" && args.project_root.length > 0
+        const projectRoot = typeof args.project_root !== "string" && args.project_root.length > 0
           ? args.project_root
           : undefined;
killedBy: team_dispatch 正常链路 spawn→assign→send 三步全成，注册表/账本/信箱/事件流逐项核对
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] StringLiteral
src/plugin/handlers.ts:255:21
           : undefined;
         // 三级来源根组装（builtin + user + 可选 project）
         const roots: ScenarioRoot[] = [
-          { source: "builtin", dir: builtinTemplatesRoot(PACKAGE_ROOT) },
+          { source: "", dir: builtinTemplatesRoot(PACKAGE_ROOT) },
           { source: "user", dir: userTemplatesRoot() },
         ];
killedBy: team_dispatch 正常链路 spawn→assign→send 三步全成，注册表/账本/信箱/事件流逐项核对
statusReason: template validation failed:
- [source-invalid] team.source: source must be one of builtin|user|project

[Killed] StringLiteral
src/plugin/handlers.ts:256:21
         // 三级来源根组装（builtin + user + 可选 project）
         const roots: ScenarioRoot[] = [
           { source: "builtin", dir: builtinTemplatesRoot(PACKAGE_ROOT) },
-          { source: "user", dir: userTemplatesRoot() },
+          { source: "", dir: userTemplatesRoot() },
         ];
         if (projectRoot !== undefined) {
killedBy: team/create 一键建团 user 层模板经 source=user 实例化，返回携带 source 标记
statusReason: expected 400 to be 200 // Object.is equality

[Killed] ConditionalExpression
src/plugin/handlers.ts:258:13
           { source: "builtin", dir: builtinTemplatesRoot(PACKAGE_ROOT) },
           { source: "user", dir: userTemplatesRoot() },
         ];
-        if (projectRoot !== undefined) {
+        if (false) {
           roots.push({ source: "project", dir: projectTemplatesRoot(projectRoot) });
         }
killedBy: team/create 一键建团 同名场景（user+project）未指定 source → ambiguous-scenario（HTTP 400）
statusReason: expected 200 to be 400 // Object.is equality

[Killed] BlockStatement
src/plugin/handlers.ts:258:40
           { source: "builtin", dir: builtinTemplatesRoot(PACKAGE_ROOT) },
           { source: "user", dir: userTemplatesRoot() },
         ];
-        if (projectRoot !== undefined) {
-          roots.push({ source: "project", dir: projectTemplatesRoot(projectRoot) });
-        }
+        if (projectRoot !== undefined) {}
         let scenarioDir: string;
         let scenarioSource: TemplateSource;
killedBy: team/create 一键建团 同名场景（user+project）未指定 source → ambiguous-scenario（HTTP 400）
statusReason: expected 200 to be 400 // Object.is equality

[Killed] BlockStatement
src/plugin/handlers.ts:263:13
         }
         let scenarioDir: string;
         let scenarioSource: TemplateSource;
-        try {
-          const resolved = resolveScenarioDir(roots, scenario, requestedSource);
-          scenarioDir = resolved.dir;
-          scenarioSource = resolved.source;
-        } catch (error) {
+        try {} catch (error) {
           const msg = (error as Error).message;
           if (msg.startsWith("ambiguous-scenario:")) {
killedBy: team/create 一键建团 默认场景：init 持久化 + tier0_prompt 组装 + 快照落盘
statusReason: expected 409 to be 200 // Object.is equality

[Killed] BlockStatement
src/plugin/handlers.ts:267:25
           const resolved = resolveScenarioDir(roots, scenario, requestedSource);
           scenarioDir = resolved.dir;
           scenarioSource = resolved.source;
-        } catch (error) {
-          const msg = (error as Error).message;
-          if (msg.startsWith("ambiguous-scenario:")) {
-            throw new ToolError("ambiguous-scenario", msg);
-          }
-          throw new ToolError("unknown-scenario", msg);
-        }
+        } catch (error) {}
         // 模板快照落盘 + Tier-0 组装（#42 分层定稿）：tier0_prompt =
         // 规程全文（playbooks/tier0-playbook.md，唯一事实源）+ 固定分隔符 +
killedBy: team/create 一键建团 未知场景给稳定错误码 unknown-scenario（HTTP 400）
statusReason: no-such-template: expected 409 to be 400 // Object.is equality

[Killed] BlockStatement
src/plugin/handlers.ts:269:54
           scenarioSource = resolved.source;
         } catch (error) {
           const msg = (error as Error).message;
-          if (msg.startsWith("ambiguous-scenario:")) {
-            throw new ToolError("ambiguous-scenario", msg);
-          }
+          if (msg.startsWith("ambiguous-scenario:")) {}
           throw new ToolError("unknown-scenario", msg);
         }
killedBy: team/create 一键建团 同名场景（user+project）未指定 source → ambiguous-scenario（HTTP 400）
statusReason: expected 'unknown-scenario' to be 'ambiguous-scenario' // Object.is equality

[Killed] ConditionalExpression
src/plugin/handlers.ts:269:15
           scenarioSource = resolved.source;
         } catch (error) {
           const msg = (error as Error).message;
-          if (msg.startsWith("ambiguous-scenario:")) {
+          if (false) {
             throw new ToolError("ambiguous-scenario", msg);
           }
killedBy: team/create 一键建团 同名场景（user+project）未指定 source → ambiguous-scenario（HTTP 400）
statusReason: expected 'unknown-scenario' to be 'ambiguous-scenario' // Object.is equality

[Killed] StringLiteral
src/plugin/handlers.ts:270:33
         } catch (error) {
           const msg = (error as Error).message;
           if (msg.startsWith("ambiguous-scenario:")) {
-            throw new ToolError("ambiguous-scenario", msg);
+            throw new ToolError("", msg);
           }
           throw new ToolError("unknown-scenario", msg);
killedBy: team/create 一键建团 同名场景（user+project）未指定 source → ambiguous-scenario（HTTP 400）
statusReason: expected 409 to be 400 // Object.is equality

[Killed] StringLiteral
src/plugin/handlers.ts:272:31
           if (msg.startsWith("ambiguous-scenario:")) {
             throw new ToolError("ambiguous-scenario", msg);
           }
-          throw new ToolError("unknown-scenario", msg);
+          throw new ToolError("", msg);
         }
         // 模板快照落盘 + Tier-0 组装（#42 分层定稿）：tier0_prompt =
killedBy: team/create 一键建团 未知场景给稳定错误码 unknown-scenario（HTTP 400）
statusReason: no-such-template: expected 409 to be 400 // Object.is equality

[Survived] LogicalOperator
src/plugin/handlers.ts:286:30
         // durableId = 宿主主会话 id；status=running（init 由该存活会话触发）。
         // 同会话重入经三态判定的幂等分支自然收敛。并入 team/init 事件载荷，
         // 不另发 spawn 事件（保持事件类型序列契约稳定）。
-        const masterMember = (loaded.template.tiers as Array<{ id?: string }>)[0]?.id ?? "master";
+        const masterMember = (loaded.template.tiers as Array<{
+  id?: string;
+}>)[0]?.id && "master";
         mkdirSync(join(l.mailboxDir, masterMember), { recursive: true });
         const masterOutcome = await reg().upsertMember({

[Survived] OptionalChaining
src/plugin/handlers.ts:286:30
         // durableId = 宿主主会话 id；status=running（init 由该存活会话触发）。
         // 同会话重入经三态判定的幂等分支自然收敛。并入 team/init 事件载荷，
         // 不另发 spawn 事件（保持事件类型序列契约稳定）。
-        const masterMember = (loaded.template.tiers as Array<{ id?: string }>)[0]?.id ?? "master";
+        const masterMember = (loaded.template.tiers as Array<{
+  id?: string;
+}>)[0].id ?? "master";
         mkdirSync(join(l.mailboxDir, masterMember), { recursive: true });
         const masterOutcome = await reg().upsertMember({

[Killed] BooleanLiteral
src/plugin/handlers.ts:287:66
         // 同会话重入经三态判定的幂等分支自然收敛。并入 team/init 事件载荷，
         // 不另发 spawn 事件（保持事件类型序列契约稳定）。
         const masterMember = (loaded.template.tiers as Array<{ id?: string }>)[0]?.id ?? "master";
-        mkdirSync(join(l.mailboxDir, masterMember), { recursive: true });
+        mkdirSync(join(l.mailboxDir, masterMember), { recursive: false });
         const masterOutcome = await reg().upsertMember({
           member: masterMember,
killedBy: team/create 一键建团 同会话重入 reentered（幂等不变），异会话独立实例根
statusReason: expected undefined to be 'reentered' // Object.is equality

[Killed] StringLiteral
src/plugin/handlers.ts:296:37
           status: "running",
           lastSeen: Date.now(),
         });
-        await appendEvent("system", "team/init", {
+        await appendEvent("system", "", {
           instance_note: args.instance_note ?? null,
           lock: outcome,
killedBy: team_dispatch 正常链路 spawn→assign→send 三步全成，注册表/账本/信箱/事件流逐项核对
statusReason: expected [ { type: '', actor: 'system' }, …(4) ] to match object [ { type: 'team/init', …(1) }, …(4) ]

[Killed] ObjectLiteral
src/plugin/handlers.ts:296:50
           status: "running",
           lastSeen: Date.now(),
         });
-        await appendEvent("system", "team/init", {
-          instance_note: args.instance_note ?? null,
-          lock: outcome,
-          master: { member: masterMember, outcome: masterOutcome },
-        });
+        await appendEvent("system", "team/init", {});
         const tier0PromptPath = (loaded.template.tiers as Array<{ prompt?: string }>)[0]?.prompt ?? "";
         const scenarioPrompt = loaded.prompts[tier0PromptPath] ?? "";
killedBy: init 预登记 tier0 主控（#79） init 即入册：member=tiers[0].id、durableId=会话 id、status=running，返回 master_member
statusReason: expected {} to match object { master: { member: 'master', …(1) } }

[Survived] LogicalOperator
src/plugin/handlers.ts:297:26
           lastSeen: Date.now(),
         });
         await appendEvent("system", "team/init", {
-          instance_note: args.instance_note ?? null,
+          instance_note: args.instance_note && null,
           lock: outcome,
           master: { member: masterMember, outcome: masterOutcome },

[Killed] LogicalOperator
src/plugin/handlers.ts:301:33
           lock: outcome,
           master: { member: masterMember, outcome: masterOutcome },
         });
-        const tier0PromptPath = (loaded.template.tiers as Array<{ prompt?: string }>)[0]?.prompt ?? "";
+        const tier0PromptPath = (loaded.template.tiers as Array<{
+  prompt?: string;
+}>)[0]?.prompt && "";
         const scenarioPrompt = loaded.prompts[tier0PromptPath] ?? "";
         return {
killedBy: team/create 一键建团 默认场景：init 持久化 + tier0_prompt 组装 + 快照落盘
statusReason: expected '# Tier-0 巡场规程\n\n> 本规程是 tiers[0] 主控提示…' to contain '一级主控场景编排'

[Survived] OptionalChaining
src/plugin/handlers.ts:301:33
           lock: outcome,
           master: { member: masterMember, outcome: masterOutcome },
         });
-        const tier0PromptPath = (loaded.template.tiers as Array<{ prompt?: string }>)[0]?.prompt ?? "";
+        const tier0PromptPath = (loaded.template.tiers as Array<{
+  prompt?: string;
+}>)[0].prompt ?? "";
         const scenarioPrompt = loaded.prompts[tier0PromptPath] ?? "";
         return {

[Killed] LogicalOperator
src/plugin/handlers.ts:302:32
           master: { member: masterMember, outcome: masterOutcome },
         });
         const tier0PromptPath = (loaded.template.tiers as Array<{ prompt?: string }>)[0]?.prompt ?? "";
-        const scenarioPrompt = loaded.prompts[tier0PromptPath] ?? "";
+        const scenarioPrompt = loaded.prompts[tier0PromptPath] && "";
         return {
           ok: true,
killedBy: team/create 一键建团 默认场景：init 持久化 + tier0_prompt 组装 + 快照落盘
statusReason: expected '# Tier-0 巡场规程\n\n> 本规程是 tiers[0] 主控提示…' to contain '一级主控场景编排'

[Killed] ObjectLiteral
src/plugin/handlers.ts:303:16
         });
         const tier0PromptPath = (loaded.template.tiers as Array<{ prompt?: string }>)[0]?.prompt ?? "";
         const scenarioPrompt = loaded.prompts[tier0PromptPath] ?? "";
-        return {
-          ok: true,
-          lock: outcome,
-          home: l.teamHome,
-          scenario,
-          source: scenarioSource,
-          // L1（#79）：预登记的 tier0 主控成员名与登记形态，供入口层展示。
-          master_member: masterMember,
-          // ADR 0015 决策 3：tier0_prompt 尾部追加「框架工具面自述」保留段
-          //（仅 team_* 自述 + 盲区声明；appendToolManifest 保证不双份）。
-          tier0_prompt: appendToolManifest(assembleTier0Prompt(playbook, scenarioPrompt)),
-          playbook_digest: playbook.digest,
-        };
+        return {};
       } catch (error) {
         wrap(error);
killedBy: init 预登记 tier0 主控（#79） init 即入册：member=tiers[0].id、durableId=会话 id、status=running，返回 master_member
statusReason: expected undefined to be true // Object.is equality

[Killed] BlockStatement
src/plugin/handlers.ts:316:23
           tier0_prompt: appendToolManifest(assembleTier0Prompt(playbook, scenarioPrompt)),
           playbook_digest: playbook.digest,
         };
-      } catch (error) {
-        wrap(error);
-      }
+      } catch (error) {}
     },
 
killedBy: team/create 一键建团 未知场景给稳定错误码 unknown-scenario（HTTP 400）
statusReason: Unexpected end of JSON input

[Killed] CallExpression
src/plugin/handlers.ts:317:9
           playbook_digest: playbook.digest,
         };
       } catch (error) {
-        wrap(error);
+        ;
       }
     },
killedBy: team/create 一键建团 未知场景给稳定错误码 unknown-scenario（HTTP 400）
statusReason: Unexpected end of JSON input

[Killed] StringLiteral
src/plugin/handlers.ts:323:37
 
     async spawn(args) {
       try {
-        const member = reqStr(args, "member");
+        const member = reqStr(args, "");
         const durableId = reqStr(args, "durable_id");
         const role = reqStr(args, "role");
killedBy: golden 场景一：init → spawn → task 全链路 单任务全流程：create→running→handoff→done，事件与账本逐项核对
statusReason: string field "" is required

[Killed] ConditionalExpression
src/plugin/handlers.ts:328:13
         const role = reqStr(args, "role");
         const tier = optNum(args, "tier");
         const parent = optStr(args, "parent");
-        if (tier === undefined) throw new ToolError("invalid-arguments", 'number field "tier" is required');
+        if (false) throw new ToolError("invalid-arguments", 'number field "tier" is required');
         await ensureDir(join(l.mailboxDir, member));
         // parent 持久化（#79 顺带修复：此前仅解析未落账，接管层级树缺边）。
killedBy: 必填参数缺失矩阵 spawn: 缺数值 tier
statusReason: promise resolved "{ ok: true, member: 'm', …(1) }" instead of rejecting

[Killed] ConditionalExpression
src/plugin/handlers.ts:328:13
         const role = reqStr(args, "role");
         const tier = optNum(args, "tier");
         const parent = optStr(args, "parent");
-        if (tier === undefined) throw new ToolError("invalid-arguments", 'number field "tier" is required');
+        if (true) throw new ToolError("invalid-arguments", 'number field "tier" is required');
         await ensureDir(join(l.mailboxDir, member));
         // parent 持久化（#79 顺带修复：此前仅解析未落账，接管层级树缺边）。
killedBy: golden 场景一：init → spawn → task 全链路 单任务全流程：create→running→handoff→done，事件与账本逐项核对
statusReason: number field "tier" is required

[Killed] ConditionalExpression
src/plugin/handlers.ts:334:15
         await reg().upsertMember({
           member,
           durableId,
-          ...(parent !== undefined ? { parent } : {}),
+          ...(false ? { parent } : {}),
           tier,
           status: "spawned",
killedBy: team_reconcile overview 孤儿标红：有 parent 且在册不标；悬空 parent 标 parent-dangling
statusReason: expected [ …(2) ] to deeply equal [ Array(1) ]

[Killed] EqualityOperator
src/plugin/handlers.ts:334:15
         await reg().upsertMember({
           member,
           durableId,
-          ...(parent !== undefined ? { parent } : {}),
+          ...(parent === undefined ? { parent } : {}),
           tier,
           status: "spawned",
killedBy: team_reconcile overview 孤儿标红：有 parent 且在册不标；悬空 parent 标 parent-dangling
statusReason: expected [ …(2) ] to deeply equal [ Array(1) ]

[Survived] StringLiteral
src/plugin/handlers.ts:336:19
           durableId,
           ...(parent !== undefined ? { parent } : {}),
           tier,
-          status: "spawned",
+          status: "",
           lastSeen: Date.now(),
         });
