[Survived] EqualityOperator
src/plugin/handlers.ts:344:15
           durable_id: durableId,
           role,
           tier,
-          ...(parent !== undefined ? { parent } : {}),
+          ...(parent === undefined ? { parent } : {}),
         });
         return { ok: true, member, durable_id: durableId };

[Survived] ConditionalExpression
src/plugin/handlers.ts:344:15
           durable_id: durableId,
           role,
           tier,
-          ...(parent !== undefined ? { parent } : {}),
+          ...(true ? { parent } : {}),
         });
         return { ok: true, member, durable_id: durableId };

[Killed] BooleanLiteral
src/plugin/handlers.ts:346:22
           tier,
           ...(parent !== undefined ? { parent } : {}),
         });
-        return { ok: true, member, durable_id: durableId };
+        return { ok: false, member, durable_id: durableId };
       } catch (error) {
         wrap(error);
killedBy: golden 场景一：init → spawn → task 全链路 单任务全流程：create→running→handoff→done，事件与账本逐项核对
statusReason: expected { ok: false, member: 'coder', …(1) } to deeply equal { ok: true, member: 'coder', …(1) }

[Killed] BlockStatement
src/plugin/handlers.ts:347:23
           ...(parent !== undefined ? { parent } : {}),
         });
         return { ok: true, member, durable_id: durableId };
-      } catch (error) {
-        wrap(error);
-      }
+      } catch (error) {}
     },
 
killedBy: 必填参数缺失矩阵 spawn: 缺 member
statusReason: promise resolved "undefined" instead of rejecting

[Killed] StringLiteral
src/plugin/handlers.ts:357:35
         const member = reqStr(args, "member");
         const durableId = reqStr(args, "durable_id");
         const role = reqStr(args, "role");
-        const tier = reqNum(args, "tier");
+        const tier = reqNum(args, "");
         const parent = optStr(args, "parent");
         const taskId = reqStr(args, "task_id");
killedBy: team_dispatch 正常链路 spawn→assign→send 三步全成，注册表/账本/信箱/事件流逐项核对
statusReason: number field "" is required

[Killed] LogicalOperator
src/plugin/handlers.ts:360:22
         const tier = reqNum(args, "tier");
         const parent = optStr(args, "parent");
         const taskId = reqStr(args, "task_id");
-        const from = optStr(args, "from") ?? "root";
+        const from = optStr(args, "from") && "root";
         const provider = optStr(args, "provider");
         const model = optStr(args, "model");
killedBy: team_dispatch 正常链路 spawn→assign→send 三步全成，注册表/账本/信箱/事件流逐项核对
statusReason: expected { …(5) } to match object { from: 'root', to: 'coder', …(2) }
(2 matching properties omitted from actual)

[Killed] StringLiteral
src/plugin/handlers.ts:360:46
         const tier = reqNum(args, "tier");
         const parent = optStr(args, "parent");
         const taskId = reqStr(args, "task_id");
-        const from = optStr(args, "from") ?? "root";
+        const from = optStr(args, "from") ?? "";
         const provider = optStr(args, "provider");
         const model = optStr(args, "model");
killedBy: team_dispatch 正常链路 spawn→assign→send 三步全成，注册表/账本/信箱/事件流逐项核对
statusReason: expected { …(6) } to match object { from: 'root', to: 'coder', …(2) }
(2 matching properties omitted from actual)

[Killed] ConditionalExpression
src/plugin/handlers.ts:368:13
 
         // 前置校验（无副作用，不参与半事务）：任务必须在场——账本先行约定。
         const task = await led().get(taskId);
-        if (task === undefined) {
+        if (true) {
           throw new ToolError("task-not-found", `task ${taskId} does not exist`);
         }
killedBy: team_dispatch 正常链路 spawn→assign→send 三步全成，注册表/账本/信箱/事件流逐项核对
statusReason: task task-68c2a5fe-5824-4ea2-bbf2-80a1620b5464 does not exist

[Killed] BlockStatement
src/plugin/handlers.ts:368:33
 
         // 前置校验（无副作用，不参与半事务）：任务必须在场——账本先行约定。
         const task = await led().get(taskId);
-        if (task === undefined) {
-          throw new ToolError("task-not-found", `task ${taskId} does not exist`);
-        }
+        if (task === undefined) {}
 
         // 半事务执行：任一步失败即停，已完成步骤随错误留痕（ADR 0015）。
killedBy: team_dispatch 前置校验（无副作用） 任务不存在 → task-not-found，不产生任何落账副作用
statusReason: expected { member: 'coder', …(4) } to be undefined

[Survived] StringLiteral
src/plugin/handlers.ts:369:49
         // 前置校验（无副作用，不参与半事务）：任务必须在场——账本先行约定。
         const task = await led().get(taskId);
         if (task === undefined) {
-          throw new ToolError("task-not-found", `task ${taskId} does not exist`);
+          throw new ToolError("task-not-found", ``);
         }
 

[Killed] ObjectLiteral
src/plugin/handlers.ts:378:36
           // step 1: 注册（三态 upsert，与 team_spawn 同一落账函数；幂等重入
           // 走同 member+同 durableId 分支）。
           await ensureDir(join(l.mailboxDir, member));
-          await reg().upsertMember({
-            member,
-            durableId,
-            ...(parent !== undefined ? { parent } : {}),
-            tier,
-            status: "spawned",
-            lastSeen: Date.now(),
-          });
+          await reg().upsertMember({});
           await appendEvent("system", "team/spawn", {
             member,
killedBy: team_dispatch 正常链路 spawn→assign→send 三步全成，注册表/账本/信箱/事件流逐项核对
statusReason: expected undefined to match object { member: 'coder', …(3) }

[Survived] ConditionalExpression
src/plugin/handlers.ts:381:17
           await reg().upsertMember({
             member,
             durableId,
-            ...(parent !== undefined ? { parent } : {}),
+            ...(true ? { parent } : {}),
             tier,
             status: "spawned",

[Survived] ConditionalExpression
src/plugin/handlers.ts:391:17
             durable_id: durableId,
             role,
             tier,
-            ...(parent !== undefined ? { parent } : {}),
+            ...(false ? { parent } : {}),
             ...(provider !== undefined ? { provider } : {}),
             ...(model !== undefined ? { model } : {}),

[Survived] ConditionalExpression
src/plugin/handlers.ts:392:17
             role,
             tier,
             ...(parent !== undefined ? { parent } : {}),
-            ...(provider !== undefined ? { provider } : {}),
+            ...(true ? { provider } : {}),
             ...(model !== undefined ? { model } : {}),
             ...(inline !== undefined ? { role_inline: inline } : {}),

[Survived] ConditionalExpression
src/plugin/handlers.ts:392:17
             role,
             tier,
             ...(parent !== undefined ? { parent } : {}),
-            ...(provider !== undefined ? { provider } : {}),
+            ...(false ? { provider } : {}),
             ...(model !== undefined ? { model } : {}),
             ...(inline !== undefined ? { role_inline: inline } : {}),

[Survived] ConditionalExpression
src/plugin/handlers.ts:393:17
             tier,
             ...(parent !== undefined ? { parent } : {}),
             ...(provider !== undefined ? { provider } : {}),
-            ...(model !== undefined ? { model } : {}),
+            ...(true ? { model } : {}),
             ...(inline !== undefined ? { role_inline: inline } : {}),
           });

[Survived] ConditionalExpression
src/plugin/handlers.ts:393:17
             tier,
             ...(parent !== undefined ? { parent } : {}),
             ...(provider !== undefined ? { provider } : {}),
-            ...(model !== undefined ? { model } : {}),
+            ...(false ? { model } : {}),
             ...(inline !== undefined ? { role_inline: inline } : {}),
           });

[Survived] ConditionalExpression
src/plugin/handlers.ts:394:17
             ...(parent !== undefined ? { parent } : {}),
             ...(provider !== undefined ? { provider } : {}),
             ...(model !== undefined ? { model } : {}),
-            ...(inline !== undefined ? { role_inline: inline } : {}),
+            ...(true ? { role_inline: inline } : {}),
           });
           completed.push("spawn");

[Survived] ConditionalExpression
src/plugin/handlers.ts:394:17
             ...(parent !== undefined ? { parent } : {}),
             ...(provider !== undefined ? { provider } : {}),
             ...(model !== undefined ? { model } : {}),
-            ...(inline !== undefined ? { role_inline: inline } : {}),
+            ...(false ? { role_inline: inline } : {}),
           });
           completed.push("spawn");

[Killed] StringLiteral
src/plugin/handlers.ts:396:26
             ...(model !== undefined ? { model } : {}),
             ...(inline !== undefined ? { role_inline: inline } : {}),
           });
-          completed.push("spawn");
+          completed.push("");
           // step 2: 指派（乐观锁透传，防并发误派）。
           const updated = await led().update(
killedBy: team_dispatch 正常链路 spawn→assign→send 三步全成，注册表/账本/信箱/事件流逐项核对
statusReason: expected [ '', 'assign', 'send' ] to deeply equal [ 'spawn', 'assign', 'send' ]

[Killed] ObjectLiteral
src/plugin/handlers.ts:400:13
           // step 2: 指派（乐观锁透传，防并发误派）。
           const updated = await led().update(
             taskId,
-            { assignee: member },
+            {},
             { ...(expectRev !== undefined ? { expectRev } : {}) },
           );
killedBy: team_dispatch 正常链路 spawn→assign→send 三步全成，注册表/账本/信箱/事件流逐项核对
statusReason: expected undefined to be 'coder' // Object.is equality

[Killed] EqualityOperator
src/plugin/handlers.ts:401:19
           const updated = await led().update(
             taskId,
             { assignee: member },
-            { ...(expectRev !== undefined ? { expectRev } : {}) },
+            { ...(expectRev === undefined ? { expectRev } : {}) },
           );
           await appendEvent(member, "task/update", {
killedBy: team_dispatch 半事务语义 step2 rev 冲突即停：已完成 spawn 随错误留痕，assignee 未变、无信封
statusReason: promise resolved "{ ok: true, member: 'coder', …(4) }" instead of rejecting

[Killed] ConditionalExpression
src/plugin/handlers.ts:401:19
           const updated = await led().update(
             taskId,
             { assignee: member },
-            { ...(expectRev !== undefined ? { expectRev } : {}) },
+            { ...(false ? { expectRev } : {}) },
           );
           await appendEvent(member, "task/update", {
killedBy: team_dispatch 半事务语义 step2 rev 冲突即停：已完成 spawn 随错误留痕，assignee 未变、无信封
statusReason: promise resolved "{ ok: true, member: 'coder', …(4) }" instead of rejecting

[Killed] StringLiteral
src/plugin/handlers.ts:408:26
             status: updated.status,
             rev: updated.rev,
           });
-          completed.push("assign");
+          completed.push("");
           // step 3: 派单信封（role_inline 与模型档位随信封投递给成员）。
           const envelopeId = await deliver(teamHome, member, {
killedBy: team_dispatch 正常链路 spawn→assign→send 三步全成，注册表/账本/信箱/事件流逐项核对
statusReason: expected [ 'spawn', '', 'send' ] to deeply equal [ 'spawn', 'assign', 'send' ]

[Killed] ObjectLiteral
src/plugin/handlers.ts:410:62
           });
           completed.push("assign");
           // step 3: 派单信封（role_inline 与模型档位随信封投递给成员）。
-          const envelopeId = await deliver(teamHome, member, {
-            from,
-            type: "task-assign",
-            body: {
-              task_id: taskId,
-              title: task.title,
-              room: task.room,
-              dod: task.dod,
-              role_inline: inline ?? null,
-              provider: provider ?? null,
-              model: model ?? null,
-            },
-          });
+          const envelopeId = await deliver(teamHome, member, {});
           await appendEvent(from, "mailbox/deliver", {
             to: member,
killedBy: team_dispatch 正常链路 spawn→assign→send 三步全成，注册表/账本/信箱/事件流逐项核对
statusReason: expected { …(3) } to match object { from: 'root', to: 'coder', …(2) }
(2 matching properties omitted from actual)

[Killed] ObjectLiteral
src/plugin/handlers.ts:413:19
           const envelopeId = await deliver(teamHome, member, {
             from,
             type: "task-assign",
-            body: {
-              task_id: taskId,
-              title: task.title,
-              room: task.room,
-              dod: task.dod,
-              role_inline: inline ?? null,
-              provider: provider ?? null,
-              model: model ?? null,
-            },
+            body: {},
           });
           await appendEvent(from, "mailbox/deliver", {
killedBy: team_dispatch 正常链路 spawn→assign→send 三步全成，注册表/账本/信箱/事件流逐项核对
statusReason: expected { …(6) } to match object { from: 'root', to: 'coder', …(2) }
(2 matching properties omitted from actual)

[Killed] LogicalOperator
src/plugin/handlers.ts:418:28
               title: task.title,
               room: task.room,
               dod: task.dod,
-              role_inline: inline ?? null,
+              role_inline: inline && null,
               provider: provider ?? null,
               model: model ?? null,
killedBy: team_dispatch 正常链路 spawn→assign→send 三步全成，注册表/账本/信箱/事件流逐项核对
statusReason: expected { …(6) } to match object { from: 'root', to: 'coder', …(2) }
(2 matching properties omitted from actual)

[Killed] LogicalOperator
src/plugin/handlers.ts:419:25
               room: task.room,
               dod: task.dod,
               role_inline: inline ?? null,
-              provider: provider ?? null,
+              provider: provider && null,
               model: model ?? null,
             },
killedBy: team_dispatch 正常链路 spawn→assign→send 三步全成，注册表/账本/信箱/事件流逐项核对
statusReason: expected { …(6) } to match object { from: 'root', to: 'coder', …(2) }
(2 matching properties omitted from actual)

[Killed] LogicalOperator
src/plugin/handlers.ts:420:22
               dod: task.dod,
               role_inline: inline ?? null,
               provider: provider ?? null,
-              model: model ?? null,
+              model: model && null,
             },
           });
killedBy: team_dispatch 正常链路 spawn→assign→send 三步全成，注册表/账本/信箱/事件流逐项核对
statusReason: expected { …(6) } to match object { from: 'root', to: 'coder', …(2) }
(2 matching properties omitted from actual)

[Killed] BlockStatement
src/plugin/handlers.ts:437:25
             envelope_id: envelopeId,
             steps: completed,
           };
-        } catch (error) {
-          const e = error as { code?: string; message?: string };
-          // 已知稳定错误码原样透传（可路由），其余归并为 dispatch-partial；
-          // 两种形态都携带已完成步骤，供主控决定续跑或回滚。
-          const code = e.code ?? "dispatch-partial";
-          throw new ToolError(
-            code,
-            `dispatch stopped after [${completed.join(", ") || "none"}]: ${e.message ?? String(error)}`,
-          );
-        }
+        } catch (error) {}
       } catch (error) {
         wrap(error);
killedBy: team_dispatch 半事务语义 step2 rev 冲突即停：已完成 spawn 随错误留痕，assignee 未变、无信封
statusReason: promise resolved "undefined" instead of rejecting

[Killed] LogicalOperator
src/plugin/handlers.ts:441:24
           const e = error as { code?: string; message?: string };
           // 已知稳定错误码原样透传（可路由），其余归并为 dispatch-partial；
           // 两种形态都携带已完成步骤，供主控决定续跑或回滚。
-          const code = e.code ?? "dispatch-partial";
+          const code = e.code && "dispatch-partial";
           throw new ToolError(
             code,
killedBy: team_dispatch 半事务语义 step2 rev 冲突即停：已完成 spawn 随错误留痕，assignee 未变、无信封
statusReason: expected ToolError: dispatch stopped after [spawn]… { code: '…' } to match object { code: 'rev-conflict' }
(1 matching property omitted from actual)

[Survived] LogicalOperator
src/plugin/handlers.ts:444:76
           const code = e.code ?? "dispatch-partial";
           throw new ToolError(
             code,
-            `dispatch stopped after [${completed.join(", ") || "none"}]: ${e.message ?? String(error)}`,
+            `dispatch stopped after [${completed.join(", ") || "none"}]: ${e.message && String(error)}`,
           );
         }

[Survived] LogicalOperator
src/plugin/handlers.ts:444:40
           const code = e.code ?? "dispatch-partial";
           throw new ToolError(
             code,
-            `dispatch stopped after [${completed.join(", ") || "none"}]: ${e.message ?? String(error)}`,
+            `dispatch stopped after [${completed.join(", ") && "none"}]: ${e.message ?? String(error)}`,
           );
         }

[Killed] BlockStatement
src/plugin/handlers.ts:447:23
             `dispatch stopped after [${completed.join(", ") || "none"}]: ${e.message ?? String(error)}`,
           );
         }
-      } catch (error) {
-        wrap(error);
-      }
+      } catch (error) {}
     },
 
killedBy: team_dispatch 半事务语义 step2 rev 冲突即停：已完成 spawn 随错误留痕，assignee 未变、无信封
statusReason: promise resolved "undefined" instead of rejecting

[Killed] BlockStatement
src/plugin/handlers.ts:452:22
       }
     },
 
-    async send(args) {
-      try {
-        const to = reqStr(args, "to");
-        const from = reqStr(args, "from");
-        const type = reqStr(args, "type");
-        const body = args.body ?? null;
-        if ((await reg().getMember(to)) === undefined) {
-          throw new ToolError("unknown-member", `recipient ${to} is not registered`);
-        }
-        const envelopeId = await deliver(teamHome, to, { from, type, body });
-        await appendEvent(from, "mailbox/deliver", { to, envelope_id: envelopeId, msg_type: type });
-        return { ok: true, envelope_id: envelopeId };
-      } catch (error) {
-        wrap(error);
-      }
-    },
+    async send(args) {},
 
     async inbox(args) {
killedBy: golden 场景二：send/inbox 信箱协作 投递→认领→确认，越权发送被拒
statusReason: promise resolved "undefined" instead of rejecting

[Killed] BlockStatement
src/plugin/handlers.ts:453:11
     },
 
     async send(args) {
-      try {
-        const to = reqStr(args, "to");
-        const from = reqStr(args, "from");
-        const type = reqStr(args, "type");
-        const body = args.body ?? null;
-        if ((await reg().getMember(to)) === undefined) {
-          throw new ToolError("unknown-member", `recipient ${to} is not registered`);
-        }
-        const envelopeId = await deliver(teamHome, to, { from, type, body });
-        await appendEvent(from, "mailbox/deliver", { to, envelope_id: envelopeId, msg_type: type });
-        return { ok: true, envelope_id: envelopeId };
-      } catch (error) {
+      try {} catch (error) {
         wrap(error);
       }
killedBy: 必填参数缺失矩阵 send: 缺 to
statusReason: promise resolved "undefined" instead of rejecting

[Killed] LogicalOperator
src/plugin/handlers.ts:457:22
         const to = reqStr(args, "to");
         const from = reqStr(args, "from");
         const type = reqStr(args, "type");
-        const body = args.body ?? null;
+        const body = args.body && null;
         if ((await reg().getMember(to)) === undefined) {
           throw new ToolError("unknown-member", `recipient ${to} is not registered`);
killedBy: golden 场景二：send/inbox 信箱协作 投递→认领→确认，越权发送被拒
statusReason: expected null to deeply equal { task: 'x' }

[Killed] ConditionalExpression
src/plugin/handlers.ts:458:13
         const from = reqStr(args, "from");
         const type = reqStr(args, "type");
         const body = args.body ?? null;
-        if ((await reg().getMember(to)) === undefined) {
+        if (false) {
           throw new ToolError("unknown-member", `recipient ${to} is not registered`);
         }
killedBy: 可选字段类型违规矩阵 send.to 未注册成员给 unknown-member
statusReason: promise resolved "{ ok: true, …(1) }" instead of rejecting

[Killed] ConditionalExpression
src/plugin/handlers.ts:458:13
         const from = reqStr(args, "from");
         const type = reqStr(args, "type");
         const body = args.body ?? null;
-        if ((await reg().getMember(to)) === undefined) {
+        if (true) {
           throw new ToolError("unknown-member", `recipient ${to} is not registered`);
         }
killedBy: golden 场景二：send/inbox 信箱协作 投递→认领→确认，越权发送被拒
statusReason: recipient coder is not registered

[Survived] BooleanLiteral
src/plugin/handlers.ts:463:22
         }
         const envelopeId = await deliver(teamHome, to, { from, type, body });
         await appendEvent(from, "mailbox/deliver", { to, envelope_id: envelopeId, msg_type: type });
-        return { ok: true, envelope_id: envelopeId };
+        return { ok: false, envelope_id: envelopeId };
       } catch (error) {
         wrap(error);

[Killed] BlockStatement
src/plugin/handlers.ts:464:23
         const envelopeId = await deliver(teamHome, to, { from, type, body });
         await appendEvent(from, "mailbox/deliver", { to, envelope_id: envelopeId, msg_type: type });
         return { ok: true, envelope_id: envelopeId };
-      } catch (error) {
-        wrap(error);
-      }
+      } catch (error) {}
     },
 
killedBy: golden 场景二：send/inbox 信箱协作 投递→认领→确认，越权发送被拒
statusReason: promise resolved "undefined" instead of rejecting

[Killed] BlockStatement
src/plugin/handlers.ts:469:23
       }
     },
 
-    async inbox(args) {
-      try {
-        const member = reqStr(args, "member");
-        const uuid = optStr(args, "envelope_id");
-        if (uuid !== undefined) {
-          const claimed = await claim(teamHome, member, uuid);
-          return { ok: true, envelope: claimed };
-        }
-        return { ok: true, unread: await readUnread(teamHome, member) };
-      } catch (error) {
-        wrap(error);
-      }
-    },
+    async inbox(args) {},
 
     async ack(args) {
killedBy: golden 场景二：send/inbox 信箱协作 投递→认领→确认，越权发送被拒
statusReason: Cannot read properties of undefined (reading 'unread')

[Killed] BlockStatement
src/plugin/handlers.ts:470:11
     },
 
     async inbox(args) {
-      try {
-        const member = reqStr(args, "member");
-        const uuid = optStr(args, "envelope_id");
-        if (uuid !== undefined) {
-          const claimed = await claim(teamHome, member, uuid);
-          return { ok: true, envelope: claimed };
-        }
-        return { ok: true, unread: await readUnread(teamHome, member) };
-      } catch (error) {
+      try {} catch (error) {
         wrap(error);
       }
killedBy: golden 场景二：send/inbox 信箱协作 投递→认领→确认，越权发送被拒
statusReason: Cannot read properties of undefined (reading 'unread')

[Killed] EqualityOperator
src/plugin/handlers.ts:473:13
       try {
         const member = reqStr(args, "member");
         const uuid = optStr(args, "envelope_id");
-        if (uuid !== undefined) {
+        if (uuid === undefined) {
           const claimed = await claim(teamHome, member, uuid);
           return { ok: true, envelope: claimed };
killedBy: golden 场景二：send/inbox 信箱协作 投递→认领→确认，越权发送被拒
statusReason: unknown envelope undefined in coder's unread segment

[Killed] ConditionalExpression
src/plugin/handlers.ts:473:13
       try {
         const member = reqStr(args, "member");
         const uuid = optStr(args, "envelope_id");
-        if (uuid !== undefined) {
+        if (false) {
           const claimed = await claim(teamHome, member, uuid);
           return { ok: true, envelope: claimed };
killedBy: golden 场景二：send/inbox 信箱协作 投递→认领→确认，越权发送被拒
statusReason: Cannot read properties of undefined (reading 'body')

[Survived] BooleanLiteral
src/plugin/handlers.ts:475:24
         const uuid = optStr(args, "envelope_id");
         if (uuid !== undefined) {
           const claimed = await claim(teamHome, member, uuid);
-          return { ok: true, envelope: claimed };
+          return { ok: false, envelope: claimed };
         }
         return { ok: true, unread: await readUnread(teamHome, member) };

[Survived] BooleanLiteral
src/plugin/handlers.ts:477:22
           const claimed = await claim(teamHome, member, uuid);
           return { ok: true, envelope: claimed };
         }
-        return { ok: true, unread: await readUnread(teamHome, member) };
+        return { ok: false, unread: await readUnread(teamHome, member) };
       } catch (error) {
         wrap(error);

[Killed] ObjectLiteral
src/plugin/handlers.ts:477:16
           const claimed = await claim(teamHome, member, uuid);
           return { ok: true, envelope: claimed };
         }
-        return { ok: true, unread: await readUnread(teamHome, member) };
+        return {};
       } catch (error) {
         wrap(error);
killedBy: golden 场景二：send/inbox 信箱协作 投递→认领→确认，越权发送被拒
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] BlockStatement
src/plugin/handlers.ts:478:23
           return { ok: true, envelope: claimed };
         }
         return { ok: true, unread: await readUnread(teamHome, member) };
-      } catch (error) {
-        wrap(error);
-      }
+      } catch (error) {}
     },
 
killedBy: 必填参数缺失矩阵 inbox: 缺 member
statusReason: promise resolved "undefined" instead of rejecting

[Killed] BlockStatement
src/plugin/handlers.ts:483:21
       }
     },
 
-    async ack(args) {
-      try {
-        const member = reqStr(args, "member");
-        const uuid = reqStr(args, "envelope_id");
-        await acknowledge(teamHome, member, uuid);
-        await appendEvent(member, "mailbox/ack", { envelope_id: uuid });
-        return { ok: true };
-      } catch (error) {
-        wrap(error);
-      }
-    },
+    async ack(args) {},
 
     async taskCreate(args) {
killedBy: golden 场景二：send/inbox 信箱协作 投递→认领→确认，越权发送被拒
statusReason: expected [] to have a length of 1 but got +0

[Killed] BlockStatement
src/plugin/handlers.ts:484:11
     },
 
     async ack(args) {
-      try {
-        const member = reqStr(args, "member");
-        const uuid = reqStr(args, "envelope_id");
-        await acknowledge(teamHome, member, uuid);
-        await appendEvent(member, "mailbox/ack", { envelope_id: uuid });
-        return { ok: true };
-      } catch (error) {
+      try {} catch (error) {
         wrap(error);
       }
killedBy: golden 场景二：send/inbox 信箱协作 投递→认领→确认，越权发送被拒
statusReason: expected [] to have a length of 1 but got +0

[Killed] StringLiteral
src/plugin/handlers.ts:488:35
         const member = reqStr(args, "member");
         const uuid = reqStr(args, "envelope_id");
         await acknowledge(teamHome, member, uuid);
-        await appendEvent(member, "mailbox/ack", { envelope_id: uuid });
+        await appendEvent(member, "", { envelope_id: uuid });
         return { ok: true };
       } catch (error) {
killedBy: golden 场景二：send/inbox 信箱协作 投递→认领→确认，越权发送被拒
statusReason: expected [] to have a length of 1 but got +0

[Survived] ObjectLiteral
src/plugin/handlers.ts:488:50
         const member = reqStr(args, "member");
         const uuid = reqStr(args, "envelope_id");
         await acknowledge(teamHome, member, uuid);
-        await appendEvent(member, "mailbox/ack", { envelope_id: uuid });
+        await appendEvent(member, "mailbox/ack", {});
         return { ok: true };
       } catch (error) {

[Survived] BooleanLiteral
src/plugin/handlers.ts:489:22
         const uuid = reqStr(args, "envelope_id");
         await acknowledge(teamHome, member, uuid);
         await appendEvent(member, "mailbox/ack", { envelope_id: uuid });
-        return { ok: true };
+        return { ok: false };
       } catch (error) {
         wrap(error);

[Killed] BlockStatement
src/plugin/handlers.ts:490:23
         await acknowledge(teamHome, member, uuid);
         await appendEvent(member, "mailbox/ack", { envelope_id: uuid });
         return { ok: true };
-      } catch (error) {
-        wrap(error);
-      }
+      } catch (error) {}
     },
 
killedBy: 必填参数缺失矩阵 ack: 缺 member
statusReason: promise resolved "undefined" instead of rejecting

[Killed] BlockStatement
src/plugin/handlers.ts:496:11
     },
 
     async taskCreate(args) {
-      try {
-        const title = reqStr(args, "title");
-        const room = reqStr(args, "room");
-        const assignee = optStr(args, "assignee");
-        const touched = optStrArray(args, "touched_paths");
-        const mutexGroups = optStrArray(args, "mutex_groups");
-        const maxRounds = optNum(args, "max_rounds");
-        const dod = optStrArray(args, "dod");
-        const baseline = optStr(args, "baseline");
-
-        // 创建前互斥预检：与现存 running 任务冲突即拒（不留半成品任务）。
-        await assertNoTaskConflict("pending-create", room, touched ?? [], mutexGroups ?? []);
-        const task = await led().create({
-          title,
-          room,
-          ...(assignee !== undefined ? { assignee } : {}),
-          ...(touched !== undefined ? { touched } : {}),
-          ...(mutexGroups !== undefined ? { mutexGroups } : {}),
-          ...(maxRounds !== undefined ? { maxRounds } : {}),
-          ...(dod !== undefined ? { dod } : {}),
-          ...(baseline !== undefined ? { baseline } : {}),
-        });
-        await appendEvent(assignee ?? "system", "task/create", { task_id: task.id, title, room });
-        return { ok: true, task_id: task.id, status: task.status };
-      } catch (error) {
+      try {} catch (error) {
         wrap(error);
       }
killedBy: golden 场景一：init → spawn → task 全链路 单任务全流程：create→running→handoff→done，事件与账本逐项核对
statusReason: Cannot read properties of undefined (reading 'status')

[Killed] StringLiteral
src/plugin/handlers.ts:497:36
 
     async taskCreate(args) {
       try {
-        const title = reqStr(args, "title");
+        const title = reqStr(args, "");
         const room = reqStr(args, "room");
         const assignee = optStr(args, "assignee");
killedBy: 必填参数缺失矩阵 taskCreate: 缺 title
statusReason: expected ToolError: string field "" is required { code: '…' } to match object { code: 'invalid-arguments', …(1) }
(1 matching property omitted from actual)

[Survived] StringLiteral
src/plugin/handlers.ts:501:47
         const room = reqStr(args, "room");
         const assignee = optStr(args, "assignee");
         const touched = optStrArray(args, "touched_paths");
-        const mutexGroups = optStrArray(args, "mutex_groups");
+        const mutexGroups = optStrArray(args, "");
         const maxRounds = optNum(args, "max_rounds");
         const dod = optStrArray(args, "dod");
