[NoCoverage] StringLiteral
src/plugin/team-overview.ts:154:38
         writeJson(res, 405, { error: "method not allowed" });
         return;
       }
-      const url = new URL(req.url ?? "/", "http://localhost");
+      const url = new URL(req.url ?? "", "http://localhost");
       const sessionId = url.searchParams.get("session");
       if (!sessionId || !SESSION_PATTERN.test(sessionId)) {

[Killed] BlockStatement
src/plugin/team-overview.ts:156:59
       }
       const url = new URL(req.url ?? "/", "http://localhost");
       const sessionId = url.searchParams.get("session");
-      if (!sessionId || !SESSION_PATTERN.test(sessionId)) {
-        writeJson(res, 400, { error: "invalid session parameter" });
-        return;
-      }
+      if (!sessionId || !SESSION_PATTERN.test(sessionId)) {}
       const teamHome = teamHomeFor(sessionId);
       // 非团队会话短路：实例根未初始化（team.yaml 快照不在场），与 team/status 判定一致。
killedBy: GET /api/xiaozhuge/team/overview 缺 session 参数返回 400；非 GET 返回 405；非法字符 session 拒绝
statusReason: expected 200 to be 400 // Object.is equality

[Killed] ConditionalExpression
src/plugin/team-overview.ts:156:11
       }
       const url = new URL(req.url ?? "/", "http://localhost");
       const sessionId = url.searchParams.get("session");
-      if (!sessionId || !SESSION_PATTERN.test(sessionId)) {
+      if (false) {
         writeJson(res, 400, { error: "invalid session parameter" });
         return;
killedBy: GET /api/xiaozhuge/team/overview 缺 session 参数返回 400；非 GET 返回 405；非法字符 session 拒绝
statusReason: expected 200 to be 400 // Object.is equality

[Survived] ObjectLiteral
src/plugin/team-overview.ts:157:29
       const url = new URL(req.url ?? "/", "http://localhost");
       const sessionId = url.searchParams.get("session");
       if (!sessionId || !SESSION_PATTERN.test(sessionId)) {
-        writeJson(res, 400, { error: "invalid session parameter" });
+        writeJson(res, 400, {});
         return;
       }

[Killed] BooleanLiteral
src/plugin/team-overview.ts:162:11
       }
       const teamHome = teamHomeFor(sessionId);
       // 非团队会话短路：实例根未初始化（team.yaml 快照不在场），与 team/status 判定一致。
-      if (!existsSync(layout(teamHome).teamYaml)) {
+      if (existsSync(layout(teamHome).teamYaml)) {
         writeJson(res, 200, { isTeam: false, masterRegistered: false, members: [], rooms: [] });
         return;
killedBy: GET /api/xiaozhuge/team/overview 团队实例投影：成员表 + 房间计数 + 尾部事件摘要（payload 不出投影面）
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/plugin/team-overview.ts:162:11
       }
       const teamHome = teamHomeFor(sessionId);
       // 非团队会话短路：实例根未初始化（team.yaml 快照不在场），与 team/status 判定一致。
-      if (!existsSync(layout(teamHome).teamYaml)) {
+      if (true) {
         writeJson(res, 200, { isTeam: false, masterRegistered: false, members: [], rooms: [] });
         return;
killedBy: GET /api/xiaozhuge/team/overview 团队实例投影：成员表 + 房间计数 + 尾部事件摘要（payload 不出投影面）
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/plugin/team-overview.ts:163:64
       const teamHome = teamHomeFor(sessionId);
       // 非团队会话短路：实例根未初始化（team.yaml 快照不在场），与 team/status 判定一致。
       if (!existsSync(layout(teamHome).teamYaml)) {
-        writeJson(res, 200, { isTeam: false, masterRegistered: false, members: [], rooms: [] });
+        writeJson(res, 200, { isTeam: false, masterRegistered: true, members: [], rooms: [] });
         return;
       }
killedBy: GET /api/xiaozhuge/team/overview 实例根未初始化（team.yaml 不在场）→ is_team 短路 false
statusReason: expected { isTeam: false, …(3) } to deeply equal { isTeam: false, …(3) }

[Killed] BooleanLiteral
src/plugin/team-overview.ts:163:39
       const teamHome = teamHomeFor(sessionId);
       // 非团队会话短路：实例根未初始化（team.yaml 快照不在场），与 team/status 判定一致。
       if (!existsSync(layout(teamHome).teamYaml)) {
-        writeJson(res, 200, { isTeam: false, masterRegistered: false, members: [], rooms: [] });
+        writeJson(res, 200, { isTeam: true, masterRegistered: false, members: [], rooms: [] });
         return;
       }
killedBy: GET /api/xiaozhuge/team/overview 实例根未初始化（team.yaml 不在场）→ is_team 短路 false
statusReason: expected { isTeam: true, …(3) } to deeply equal { isTeam: false, …(3) }

[Killed] BlockStatement
src/plugin/team-overview.ts:166:11
         writeJson(res, 200, { isTeam: false, masterRegistered: false, members: [], rooms: [] });
         return;
       }
-      try {
-        const { etag, body } = await reduceOnce(teamHome);
-        const clientEtag = req.headers["if-none-match"];
-        if (clientEtag === etag) {
-          res.writeHead(304, { etag });
-          res.end();
-          return;
-        }
-        res.writeHead(200, { "content-type": "application/json; charset=utf-8", etag });
-        res.end(JSON.stringify(body));
-      } catch (error) {
+      try {} catch (error) {
         writeJson(res, 500, { error: error instanceof Error ? error.message : String(error) });
       }
killedBy: GET /api/xiaozhuge/team/overview 团队实例投影：成员表 + 房间计数 + 尾部事件摘要（payload 不出投影面）
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] StringLiteral
src/plugin/team-overview.ts:168:40
       }
       try {
         const { etag, body } = await reduceOnce(teamHome);
-        const clientEtag = req.headers["if-none-match"];
+        const clientEtag = req.headers[""];
         if (clientEtag === etag) {
           res.writeHead(304, { etag });
killedBy: GET /api/xiaozhuge/team/overview stat 快路径 + ETag/304 + single-flight：输入未变时重复轮询返回一致投影与 304
statusReason: expected 200 to be 304 // Object.is equality

[Killed] BlockStatement
src/plugin/team-overview.ts:169:34
       try {
         const { etag, body } = await reduceOnce(teamHome);
         const clientEtag = req.headers["if-none-match"];
-        if (clientEtag === etag) {
-          res.writeHead(304, { etag });
-          res.end();
-          return;
-        }
+        if (clientEtag === etag) {}
         res.writeHead(200, { "content-type": "application/json; charset=utf-8", etag });
         res.end(JSON.stringify(body));
killedBy: GET /api/xiaozhuge/team/overview stat 快路径 + ETag/304 + single-flight：输入未变时重复轮询返回一致投影与 304
statusReason: expected 200 to be 304 // Object.is equality

[Killed] ConditionalExpression
src/plugin/team-overview.ts:169:13
       try {
         const { etag, body } = await reduceOnce(teamHome);
         const clientEtag = req.headers["if-none-match"];
-        if (clientEtag === etag) {
+        if (false) {
           res.writeHead(304, { etag });
           res.end();
killedBy: GET /api/xiaozhuge/team/overview stat 快路径 + ETag/304 + single-flight：输入未变时重复轮询返回一致投影与 304
statusReason: expected 200 to be 304 // Object.is equality

[Killed] CallExpression
src/plugin/team-overview.ts:171:11
         const clientEtag = req.headers["if-none-match"];
         if (clientEtag === etag) {
           res.writeHead(304, { etag });
-          res.end();
+          ;
           return;
         }
killedBy: GET /api/xiaozhuge/team/overview stat 快路径 + ETag/304 + single-flight：输入未变时重复轮询返回一致投影与 304
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ObjectLiteral
src/plugin/team-overview.ts:174:28
           res.end();
           return;
         }
-        res.writeHead(200, { "content-type": "application/json; charset=utf-8", etag });
+        res.writeHead(200, {});
         res.end(JSON.stringify(body));
       } catch (error) {
killedBy: GET /api/xiaozhuge/team/overview stat 快路径 + ETag/304 + single-flight：输入未变时重复轮询返回一致投影与 304
statusReason: expected null to be truthy

[Killed] CallExpression
src/plugin/team-overview.ts:175:9
           return;
         }
         res.writeHead(200, { "content-type": "application/json; charset=utf-8", etag });
-        res.end(JSON.stringify(body));
+        ;
       } catch (error) {
         writeJson(res, 500, { error: error instanceof Error ? error.message : String(error) });
killedBy: GET /api/xiaozhuge/team/overview 团队实例投影：成员表 + 房间计数 + 尾部事件摘要（payload 不出投影面）
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[NoCoverage] BlockStatement
src/plugin/team-overview.ts:176:23
         }
         res.writeHead(200, { "content-type": "application/json; charset=utf-8", etag });
         res.end(JSON.stringify(body));
-      } catch (error) {
-        writeJson(res, 500, { error: error instanceof Error ? error.message : String(error) });
-      }
+      } catch (error) {}
     },
   };

[NoCoverage] ObjectLiteral
src/plugin/team-overview.ts:177:29
         res.writeHead(200, { "content-type": "application/json; charset=utf-8", etag });
         res.end(JSON.stringify(body));
       } catch (error) {
-        writeJson(res, 500, { error: error instanceof Error ? error.message : String(error) });
+        writeJson(res, 500, {});
       }
     },
