[Killed] BlockStatement
src/runtime/kernel/gates.ts:18:87
 }
 
 /** 打开闸口（status=pending）；同 id 已存在即拒（幂等键 = gate id）。 */
-export async function openGate(gatesDir: string, input: NewGate): Promise<GateRecord> {
-  const file = join(gatesDir, `${input.id}.json`);
-  const existing = await readJson<GateRecord>(file);
-  if (existing !== undefined) {
-    throw new GateError("gate-exists", `gate ${input.id} already exists (${existing.status})`);
-  }
-  const record: GateRecord = {
-    id: input.id,
-    status: "pending",
-    reason: input.reason,
-    requestedBy: input.requestedBy,
-    requestedAt: Date.now(),
-  };
-  await writeJsonAtomic(file, record);
-  return record;
-}
+export async function openGate(gatesDir: string, input: NewGate): Promise<GateRecord> {}
 
 /** 读单个 gate；不存在返回 undefined。 */
killedBy: gate resolve 端点 无 Origin 的 POST 被拒（agent bash/curl 场景）并留审计外无副作用
statusReason: expected undefined to be 'pending' // Object.is equality

[Killed] ConditionalExpression
src/runtime/kernel/gates.ts:21:7
 export async function openGate(gatesDir: string, input: NewGate): Promise<GateRecord> {
   const file = join(gatesDir, `${input.id}.json`);
   const existing = await readJson<GateRecord>(file);
-  if (existing !== undefined) {
+  if (true) {
     throw new GateError("gate-exists", `gate ${input.id} already exists (${existing.status})`);
   }
killedBy: gates open pending → resolve 单向；重复 open / 重开 resolved 即拒
statusReason: Cannot read properties of undefined (reading 'status')

[Killed] EqualityOperator
src/runtime/kernel/gates.ts:21:7
 export async function openGate(gatesDir: string, input: NewGate): Promise<GateRecord> {
   const file = join(gatesDir, `${input.id}.json`);
   const existing = await readJson<GateRecord>(file);
-  if (existing !== undefined) {
+  if (existing === undefined) {
     throw new GateError("gate-exists", `gate ${input.id} already exists (${existing.status})`);
   }
killedBy: gate resolve 端点 无 Origin 的 POST 被拒（agent bash/curl 场景）并留审计外无副作用
statusReason: expected undefined to be 'pending' // Object.is equality

[Killed] StringLiteral
src/runtime/kernel/gates.ts:26:13
   }
   const record: GateRecord = {
     id: input.id,
-    status: "pending",
+    status: "",
     reason: input.reason,
     requestedBy: input.requestedBy,
killedBy: gates open pending → resolve 单向；重复 open / 重开 resolved 即拒
statusReason: expected '' to be 'pending' // Object.is equality

[Killed] BlockStatement
src/runtime/kernel/gates.ts:36:95
 }
 
 /** 读单个 gate；不存在返回 undefined。 */
-export async function readGate(gatesDir: string, id: string): Promise<GateRecord | undefined> {
-  return readJson<GateRecord>(join(gatesDir, `${id}.json`));
-}
+export async function readGate(gatesDir: string, id: string): Promise<GateRecord | undefined> {}
 
 /**
killedBy: gates open pending → resolve 单向；重复 open / 重开 resolved 即拒
statusReason: expected undefined to be 'approved' // Object.is equality

[Killed] BlockStatement
src/runtime/kernel/gates.ts:49:24
   id: string,
   decision: Exclude<GateStatus, "pending">,
   by: string,
-): Promise<GateRecord> {
-  const file = join(gatesDir, `${id}.json`);
-  const current = await readJson<GateRecord>(file);
-  if (current === undefined) {
-    throw new GateError("gate-not-found", `gate ${id} does not exist`);
-  }
-  if (current.status !== "pending") {
-    throw new GateError("gate-resolved", `gate ${id} already resolved to ${current.status}`);
-  }
-  const next: GateRecord = {
-    ...current,
-    status: decision,
-    ...(decision === "approved" || decision === "denied"
-      ? { resolvedBy: by, resolvedAt: Date.now() }
-      : {}),
-  };
-  await writeJsonAtomic(file, next);
-  return next;
-}
+): Promise<GateRecord> {}
 
 /** 枚举全部 gate（跳过损坏文件并如实报告）。 */
killedBy: gate resolve 端点 浏览器同源批准：状态翻转 approved 且审计事件入库
statusReason: expected 409 to be 200 // Object.is equality

[Killed] BlockStatement
src/runtime/kernel/gates.ts:52:30
 ): Promise<GateRecord> {
   const file = join(gatesDir, `${id}.json`);
   const current = await readJson<GateRecord>(file);
-  if (current === undefined) {
-    throw new GateError("gate-not-found", `gate ${id} does not exist`);
-  }
+  if (current === undefined) {}
   if (current.status !== "pending") {
     throw new GateError("gate-resolved", `gate ${id} already resolved to ${current.status}`);
killedBy: gates open pending → resolve 单向；重复 open / 重开 resolved 即拒
statusReason: expected TypeError: Cannot read properties of unde… to match object { code: 'gate-not-found' }

[Killed] ConditionalExpression
src/runtime/kernel/gates.ts:55:7
   if (current === undefined) {
     throw new GateError("gate-not-found", `gate ${id} does not exist`);
   }
-  if (current.status !== "pending") {
+  if (true) {
     throw new GateError("gate-resolved", `gate ${id} already resolved to ${current.status}`);
   }
killedBy: gate resolve 端点 浏览器同源批准：状态翻转 approved 且审计事件入库
statusReason: expected 409 to be 200 // Object.is equality

[Survived] StringLiteral
src/runtime/kernel/gates.ts:56:42
     throw new GateError("gate-not-found", `gate ${id} does not exist`);
   }
   if (current.status !== "pending") {
-    throw new GateError("gate-resolved", `gate ${id} already resolved to ${current.status}`);
+    throw new GateError("gate-resolved", ``);
   }
   const next: GateRecord = {

[Killed] ObjectLiteral
src/runtime/kernel/gates.ts:62:9
     ...current,
     status: decision,
     ...(decision === "approved" || decision === "denied"
-      ? { resolvedBy: by, resolvedAt: Date.now() }
+      ? {}
       : {}),
   };
killedBy: gate resolve 端点 浏览器同源批准：状态翻转 approved 且审计事件入库
statusReason: expected undefined to be 'human-web' // Object.is equality

[NoCoverage] ObjectLiteral
src/runtime/kernel/gates.ts:77:12
   try {
     entries = await readdir(gatesDir);
   } catch {
-    return { gates: [], corrupt: [] };
+    return {};
   }
   const gates: GateRecord[] = [];

[Survived] ArrayDeclaration
src/runtime/kernel/gates.ts:80:29
     return { gates: [], corrupt: [] };
   }
   const gates: GateRecord[] = [];
-  const corrupt: string[] = [];
+  const corrupt: string[] = ["Stryker was here"];
   for (const entry of entries) {
     if (!entry.endsWith(".json")) continue;

[Killed] BooleanLiteral
src/runtime/kernel/gates.ts:82:9
   const gates: GateRecord[] = [];
   const corrupt: string[] = [];
   for (const entry of entries) {
-    if (!entry.endsWith(".json")) continue;
+    if (entry.endsWith(".json")) continue;
     try {
       const rec = JSON.parse(await readFile(join(gatesDir, entry), "utf8")) as unknown;
killedBy: gates open pending → resolve 单向；重复 open / 重开 resolved 即拒
statusReason: expected [] to deeply equal [ 'plan-approval' ]
