[Killed] BlockStatement
src/runtime/kernel/ledger.ts:52:53
   }
 
   /** 创建任务，返回初始记录（status=queued, rev=1）。 */
-  async create(input: NewTask): Promise<TaskRecord> {
-    const now = Date.now();
-    const record: TaskRecord = {
-      id: `task-${randomUUID()}`,
-      title: input.title,
-      status: "queued",
-      room: input.room,
-      ...(input.assignee !== undefined ? { assignee: input.assignee } : {}),
-      touched: input.touched ?? [],
-      mutexGroups: input.mutexGroups ?? [],
-      rounds: 0,
-      maxRounds: input.maxRounds ?? 0,
-      dod: input.dod ?? [],
-      ...(input.baseline !== undefined ? { baseline: input.baseline } : {}),
-      rev: 1,
-      createdAt: now,
-      updatedAt: now,
-    };
-    await writeJsonAtomic(this.taskFile(record.id), record);
-    return record;
-  }
+  async create(input: NewTask): Promise<TaskRecord> {}
 
   /** 读单个任务；不存在返回 undefined。 */
killedBy: golden 场景一：init → spawn → task 全链路 单任务全流程：create→running→handoff→done，事件与账本逐项核对
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] ObjectLiteral
src/runtime/kernel/ledger.ts:54:32
   /** 创建任务，返回初始记录（status=queued, rev=1）。 */
   async create(input: NewTask): Promise<TaskRecord> {
     const now = Date.now();
-    const record: TaskRecord = {
-      id: `task-${randomUUID()}`,
-      title: input.title,
-      status: "queued",
-      room: input.room,
-      ...(input.assignee !== undefined ? { assignee: input.assignee } : {}),
-      touched: input.touched ?? [],
-      mutexGroups: input.mutexGroups ?? [],
-      rounds: 0,
-      maxRounds: input.maxRounds ?? 0,
-      dod: input.dod ?? [],
-      ...(input.baseline !== undefined ? { baseline: input.baseline } : {}),
-      rev: 1,
-      createdAt: now,
-      updatedAt: now,
-    };
+    const record: TaskRecord = {};
     await writeJsonAtomic(this.taskFile(record.id), record);
     return record;
killedBy: golden 场景一：init → spawn → task 全链路 单任务全流程：create→running→handoff→done，事件与账本逐项核对
statusReason: expected undefined to be 'queued' // Object.is equality

[Killed] LogicalOperator
src/runtime/kernel/ledger.ts:63:18
       touched: input.touched ?? [],
       mutexGroups: input.mutexGroups ?? [],
       rounds: 0,
-      maxRounds: input.maxRounds ?? 0,
+      maxRounds: input.maxRounds && 0,
       dod: input.dod ?? [],
       ...(input.baseline !== undefined ? { baseline: input.baseline } : {}),
killedBy: 任务账本 expectRev 乐观并发校验与 rounds 超限
statusReason: promise resolved "{ …(12) }" instead of rejecting

[Killed] LogicalOperator
src/runtime/kernel/ledger.ts:64:12
       mutexGroups: input.mutexGroups ?? [],
       rounds: 0,
       maxRounds: input.maxRounds ?? 0,
-      dod: input.dod ?? [],
+      dod: input.dod && [],
       ...(input.baseline !== undefined ? { baseline: input.baseline } : {}),
       rev: 1,
killedBy: 账本字段级契约 create 完整入参：读回值与落盘一致（含可选字段）
statusReason: expected { …(14) } to deeply equal { id: StringMatching{…}, …(13) }

[Killed] ArrayDeclaration
src/runtime/kernel/ledger.ts:64:25
       mutexGroups: input.mutexGroups ?? [],
       rounds: 0,
       maxRounds: input.maxRounds ?? 0,
-      dod: input.dod ?? [],
+      dod: input.dod ?? ["Stryker was here"],
       ...(input.baseline !== undefined ? { baseline: input.baseline } : {}),
       rev: 1,
killedBy: 账本字段级契约 create 最小入参：默认值契约
statusReason: expected [ 'Stryker was here' ] to deeply equal []

[Killed] EqualityOperator
src/runtime/kernel/ledger.ts:109:9
       rev: current.rev + 1,
       updatedAt: Date.now(),
     };
-    if (patch.rounds !== undefined && next.maxRounds > 0 && next.rounds > next.maxRounds) {
+    if (patch.rounds === undefined && next.maxRounds > 0 && next.rounds > next.maxRounds) {
       throw new LedgerError(
         "rounds-exceeded",
killedBy: 任务账本 expectRev 乐观并发校验与 rounds 超限
statusReason: promise resolved "{ …(12) }" instead of rejecting

[Killed] ConditionalExpression
src/runtime/kernel/ledger.ts:109:9
       rev: current.rev + 1,
       updatedAt: Date.now(),
     };
-    if (patch.rounds !== undefined && next.maxRounds > 0 && next.rounds > next.maxRounds) {
+    if (false) {
       throw new LedgerError(
         "rounds-exceeded",
killedBy: 任务账本 expectRev 乐观并发校验与 rounds 超限
statusReason: promise resolved "{ …(12) }" instead of rejecting

[Killed] StringLiteral
src/runtime/kernel/ledger.ts:111:9
     };
     if (patch.rounds !== undefined && next.maxRounds > 0 && next.rounds > next.maxRounds) {
       throw new LedgerError(
-        "rounds-exceeded",
+        "",
         `task ${id}: rounds ${next.rounds} exceeds max ${next.maxRounds}`,
       );
killedBy: 任务账本 expectRev 乐观并发校验与 rounds 超限
statusReason: expected LedgerError: task task-8a4c51e4-5d52-4b10… { code: '' } to match object { code: 'rounds-exceeded' }
(1 matching property omitted from actual)

[Killed] BooleanLiteral
src/runtime/kernel/ledger.ts:121:9
 
   /** 列出全部任务（跳过临时残片与损坏文件——损坏文件名会出现在结果 warnings）。 */
   async list(): Promise<{ tasks: TaskRecord[]; corrupt: string[] }> {
-    if (!existsSync(this.tasksDir)) {
+    if (existsSync(this.tasksDir)) {
       await mkdir(this.tasksDir, { recursive: true });
     }
killedBy: 可选字段类型违规矩阵 taskUpdate.rounds 非数字
statusReason: ENOENT: no such file or directory, scandir '/tmp/xzg-hm-L6rQGW/ledger/tasks'

[Killed] EqualityOperator
src/runtime/kernel/ledger.ts:131:34
       if (!entry.endsWith(".json")) continue;
       try {
         const raw = JSON.parse(await readFile(join(this.tasksDir, entry), "utf8")) as unknown;
-        if (raw === undefined || typeof raw !== "object" || typeof (raw as TaskRecord).id !== "string") {
+        if (raw === undefined || typeof raw === "object" || typeof (raw as TaskRecord).id !== "string") {
           corrupt.push(entry);
           continue;
killedBy: golden 场景一：init → spawn → task 全链路 单任务全流程：create→running→handoff→done，事件与账本逐项核对
statusReason: expected undefined to be 'done' // Object.is equality

[Killed] EqualityOperator
src/runtime/kernel/ledger.ts:164:19
 ): Array<{ a: string; b: string; reason: string }> {
   const active = tasks.filter((t) => t.status === "running");
   const conflicts: Array<{ a: string; b: string; reason: string }> = [];
-  for (let i = 0; i < active.length; i++) {
+  for (let i = 0; i >= active.length; i++) {
     for (let j = i + 1; j < active.length; j++) {
       const a = active[i]!;
killedBy: golden 场景四：参数校验负矩阵 互斥冲突：同 touched path 的 running 任务拒绝新建
statusReason: promise resolved "{ ok: true, …(2) }" instead of rejecting

[Killed] EqualityOperator
src/runtime/kernel/ledger.ts:165:25
   const active = tasks.filter((t) => t.status === "running");
   const conflicts: Array<{ a: string; b: string; reason: string }> = [];
   for (let i = 0; i < active.length; i++) {
-    for (let j = i + 1; j < active.length; j++) {
+    for (let j = i + 1; j >= active.length; j++) {
       const a = active[i]!;
       const b = active[j]!;
killedBy: golden 场景一：init → spawn → task 全链路 单任务全流程：create→running→handoff→done，事件与账本逐项核对
statusReason: Cannot read properties of undefined (reading 'room')

[Killed] ConditionalExpression
src/runtime/kernel/ledger.ts:168:11
     for (let j = i + 1; j < active.length; j++) {
       const a = active[i]!;
       const b = active[j]!;
-      if (a.room !== b.room) continue;
+      if (false) continue;
       const sharedGroup = a.mutexGroups.find((g) => b.mutexGroups.includes(g));
       if (sharedGroup !== undefined) {
killedBy: 任务账本 findConflicts 分组互斥与 touched 交集
statusReason: expected [ { a: 'p', b: 'q', …(1) } ] to deeply equal []

[Killed] ConditionalExpression
src/runtime/kernel/ledger.ts:170:11
       const b = active[j]!;
       if (a.room !== b.room) continue;
       const sharedGroup = a.mutexGroups.find((g) => b.mutexGroups.includes(g));
-      if (sharedGroup !== undefined) {
+      if (true) {
         conflicts.push({ a: a.id, b: b.id, reason: `shared mutex group: ${sharedGroup}` });
         continue;
killedBy: 任务账本 findConflicts 分组互斥与 touched 交集
statusReason: expected [ 'a~b', 'a~d', 'b~d' ] to deeply equal [ 'a~b' ]

[Killed] BlockStatement
src/runtime/kernel/ledger.ts:175:34
         continue;
       }
       const overlap = a.touched.find((p) => b.touched.includes(p));
-      if (overlap !== undefined) {
-        conflicts.push({ a: a.id, b: b.id, reason: `touched path overlap: ${overlap}` });
-      }
+      if (overlap !== undefined) {}
     }
   }
killedBy: golden 场景四：参数校验负矩阵 互斥冲突：同 touched path 的 running 任务拒绝新建
statusReason: promise resolved "{ ok: true, …(2) }" instead of rejecting

[Survived] ObjectLiteral
src/runtime/kernel/ledger.ts:176:24
       }
       const overlap = a.touched.find((p) => b.touched.includes(p));
       if (overlap !== undefined) {
-        conflicts.push({ a: a.id, b: b.id, reason: `touched path overlap: ${overlap}` });
+        conflicts.push({});
       }
     }
