[Killed] BlockStatement
src/runtime/kernel/registry.ts:17:39
   }
 
   /** 读注册表；不存在视为空团队。 */
-  async read(): Promise<TeamRegistry> {
-    const data = await readJson<TeamRegistry>(this.file);
-    return data ?? { members: {} };
-  }
+  async read(): Promise<TeamRegistry> {}
 
   /** 整体原子写。 */
killedBy: GET /api/xiaozhuge/team/overview 团队实例投影：成员表 + 房间计数 + 尾部事件摘要（payload 不出投影面）
statusReason: expected 500 to be 200 // Object.is equality

[Killed] ObjectLiteral
src/runtime/kernel/registry.ts:19:20
   /** 读注册表；不存在视为空团队。 */
   async read(): Promise<TeamRegistry> {
     const data = await readJson<TeamRegistry>(this.file);
-    return data ?? { members: {} };
+    return data ?? {};
   }
 
killedBy: team_dispatch 正常链路 spawn→assign→send 三步全成，注册表/账本/信箱/事件流逐项核对
statusReason: dispatch stopped after [none]: Cannot set properties of undefined (setting 'coder')

[Killed] BlockStatement
src/runtime/kernel/registry.ts:23:54
   }
 
   /** 整体原子写。 */
-  async write(registry: TeamRegistry): Promise<void> {
-    await writeJsonAtomic(this.file, registry);
-  }
+  async write(registry: TeamRegistry): Promise<void> {}
 
   /**
killedBy: team_dispatch 正常链路 spawn→assign→send 三步全成，注册表/账本/信箱/事件流逐项核对
statusReason: expected undefined to match object { member: 'coder', …(3) }

[Killed] BlockStatement
src/runtime/kernel/registry.ts:35:94
    *    同名换新 durable id 必须先走接管路径把旧记录标 dead。
    * 3) 旧记录 dead → 允许复位重登记（状态级重建的合法入口）。
    */
-  async upsertMember(record: MemberRecord): Promise<"registered" | "idempotent" | "revived"> {
-    const reg = await this.read();
-    const existing = reg.members[record.member];
-    if (existing !== undefined && existing.status !== "dead") {
-      if (existing.durableId !== record.durableId || existing.tier !== record.tier) {
-        const err = new Error(
-          `member ${record.member} already registered as ${existing.durableId} (tier ${existing.tier}); ` +
-            "mark the old record dead before re-registering with a different durable id",
-        );
-        (err as Error & { code?: string }).code = "member-conflict";
-        throw err;
-      }
-      existing.lastSeen = Date.now();
-      await this.write(reg);
-      return "idempotent";
-    }
-    reg.members[record.member] = record;
-    await this.write(reg);
-    return existing === undefined ? "registered" : "revived";
-  }
+  async upsertMember(record: MemberRecord): Promise<"registered" | "idempotent" | "revived"> {}
 
   /** 读单个成员。 */
killedBy: team_dispatch 正常链路 spawn→assign→send 三步全成，注册表/账本/信箱/事件流逐项核对
statusReason: expected undefined to match object { member: 'coder', …(3) }

[Killed] EqualityOperator
src/runtime/kernel/registry.ts:38:9
   async upsertMember(record: MemberRecord): Promise<"registered" | "idempotent" | "revived"> {
     const reg = await this.read();
     const existing = reg.members[record.member];
-    if (existing !== undefined && existing.status !== "dead") {
+    if (existing === undefined && existing.status !== "dead") {
       if (existing.durableId !== record.durableId || existing.tier !== record.tier) {
         const err = new Error(
killedBy: 注册表 upsert/get/setStatus/liveMembers 对账语义
statusReason: Cannot read properties of undefined (reading 'status')

[Killed] LogicalOperator
src/runtime/kernel/registry.ts:38:9
   async upsertMember(record: MemberRecord): Promise<"registered" | "idempotent" | "revived"> {
     const reg = await this.read();
     const existing = reg.members[record.member];
-    if (existing !== undefined && existing.status !== "dead") {
+    if (existing !== undefined || existing.status !== "dead") {
       if (existing.durableId !== record.durableId || existing.tier !== record.tier) {
         const err = new Error(
killedBy: 注册表 upsert/get/setStatus/liveMembers 对账语义
statusReason: Cannot read properties of undefined (reading 'status')

[Killed] BlockStatement
src/runtime/kernel/registry.ts:39:85
     const reg = await this.read();
     const existing = reg.members[record.member];
     if (existing !== undefined && existing.status !== "dead") {
-      if (existing.durableId !== record.durableId || existing.tier !== record.tier) {
-        const err = new Error(
-          `member ${record.member} already registered as ${existing.durableId} (tier ${existing.tier}); ` +
-            "mark the old record dead before re-registering with a different durable id",
-        );
-        (err as Error & { code?: string }).code = "member-conflict";
-        throw err;
-      }
+      if (existing.durableId !== record.durableId || existing.tier !== record.tier) {}
       existing.lastSeen = Date.now();
       await this.write(reg);
killedBy: init 预登记 tier0 主控（#79） 同名异 durableId 注册被拒（member-conflict）；接管路径先标 dead 后可复位
statusReason: promise resolved "{ ok: true, member: 'master', …(1) }" instead of rejecting

[Survived] StringLiteral
src/runtime/kernel/registry.ts:42:13
       if (existing.durableId !== record.durableId || existing.tier !== record.tier) {
         const err = new Error(
           `member ${record.member} already registered as ${existing.durableId} (tier ${existing.tier}); ` +
-            "mark the old record dead before re-registering with a different durable id",
+            "",
         );
         (err as Error & { code?: string }).code = "member-conflict";

[Killed] ConditionalExpression
src/runtime/kernel/registry.ts:53:12
     }
     reg.members[record.member] = record;
     await this.write(reg);
-    return existing === undefined ? "registered" : "revived";
+    return true ? "registered" : "revived";
   }
 
killedBy: 注册表 upsert 三态判定（#79）：同 id 幂等刷新 / 异 id 拒绝 / dead 复活
statusReason: expected 'registered' to be 'revived' // Object.is equality

[Killed] EqualityOperator
src/runtime/kernel/registry.ts:53:12
     }
     reg.members[record.member] = record;
     await this.write(reg);
-    return existing === undefined ? "registered" : "revived";
+    return existing !== undefined ? "registered" : "revived";
   }
 
killedBy: init 预登记 tier0 主控（#79） init 即入册：member=tiers[0].id、durableId=会话 id、status=running，返回 master_member
statusReason: expected { instance_note: null, …(2) } to match object { master: { member: 'master', …(1) } }
(2 matching properties omitted from actual)

[Killed] BlockStatement
src/runtime/kernel/registry.ts:63:82
   }
 
   /** 更新成员状态与 lastSeen；成员不存在即拒。 */
-  async setStatus(member: string, status: MemberRecord["status"]): Promise<void> {
-    const reg = await this.read();
-    const existing = reg.members[member];
-    if (existing === undefined) {
-      throw new Error(`member ${member} is not registered`);
-    }
-    existing.status = status;
-    existing.lastSeen = Date.now();
-    await this.write(reg);
-  }
+  async setStatus(member: string, status: MemberRecord["status"]): Promise<void> {}
 
   /** 存活成员清单（status !== dead），供 reattach 对账。 */
killedBy: 注册表 upsert/get/setStatus/liveMembers 对账语义
statusReason: expected [ 'coder', 'master' ] to deeply equal [ 'master' ]

[Killed] ConditionalExpression
src/runtime/kernel/registry.ts:66:9
   async setStatus(member: string, status: MemberRecord["status"]): Promise<void> {
     const reg = await this.read();
     const existing = reg.members[member];
-    if (existing === undefined) {
+    if (false) {
       throw new Error(`member ${member} is not registered`);
     }
killedBy: 注册表 upsert/get/setStatus/liveMembers 对账语义
statusReason: expected [Function] to throw error matching /not registered/ but got 'Cannot set properties of undefined (s…'

[Killed] EqualityOperator
src/runtime/kernel/registry.ts:77:53
   /** 存活成员清单（status !== dead），供 reattach 对账。 */
   async liveMembers(): Promise<MemberRecord[]> {
     const reg = await this.read();
-    return Object.values(reg.members).filter((m) => m.status !== "dead");
+    return Object.values(reg.members).filter((m) => m.status === "dead");
   }
 }
killedBy: 注册表 upsert/get/setStatus/liveMembers 对账语义
statusReason: expected [ 'coder' ] to deeply equal [ 'master' ]

[Killed] ConditionalExpression
src/runtime/kernel/registry.ts:77:53
   /** 存活成员清单（status !== dead），供 reattach 对账。 */
   async liveMembers(): Promise<MemberRecord[]> {
     const reg = await this.read();
-    return Object.values(reg.members).filter((m) => m.status !== "dead");
+    return Object.values(reg.members).filter((m) => true);
   }
 }
killedBy: 注册表 upsert/get/setStatus/liveMembers 对账语义
statusReason: expected [ 'coder', 'master' ] to deeply equal [ 'master' ]
