[Killed] BlockStatement
src/runtime/template/template-loader.ts:146:28
   loaded: LoadedTemplate,
   playbookDigest?: string,
   workspace?: string,
-): Record<string, unknown> {
-  return {
-    name: loaded.template.name,
-    version: loaded.template.version,
-    source: loaded.source,
-    digest: loaded.digest,
-    // Tier-0 规程摘要（#42）：仅审计字段；旧快照无此字段按缺省容忍（只增不改）。
-    playbook_digest: playbookDigest ?? null,
-    // 工作区持久化（ADR 0015）：audit 子命令的扫描根来源；旧快照无此字段为 null。
-    workspace: workspace ?? null,
-    tiers: loaded.template.tiers,
-    roles: Object.values(loaded.roles).map((r) => ({
-      id: r.id,
-      prompt_inlined: loaded.prompts[String(r.prompt)] ?? null,
-      briefing: r.briefing ?? null,
-      dod: r.dod ?? [],
-      max_hops: r.max_hops ?? 3,
-      as_judge: r.as_judge === true,
-    })),
-    instantiated_at: Date.now(),
-  };
-}
+): Record<string, unknown> {}
 
 /** 便捷：包内置只读模板目录（builtin 来源）。 */
killedBy: team/create 一键建团 默认场景：init 持久化 + tier0_prompt 组装 + 快照落盘
statusReason: Unexpected end of JSON input

[Killed] ObjectLiteral
src/runtime/template/template-loader.ts:147:10
   playbookDigest?: string,
   workspace?: string,
 ): Record<string, unknown> {
-  return {
-    name: loaded.template.name,
-    version: loaded.template.version,
-    source: loaded.source,
-    digest: loaded.digest,
-    // Tier-0 规程摘要（#42）：仅审计字段；旧快照无此字段按缺省容忍（只增不改）。
-    playbook_digest: playbookDigest ?? null,
-    // 工作区持久化（ADR 0015）：audit 子命令的扫描根来源；旧快照无此字段为 null。
-    workspace: workspace ?? null,
-    tiers: loaded.template.tiers,
-    roles: Object.values(loaded.roles).map((r) => ({
-      id: r.id,
-      prompt_inlined: loaded.prompts[String(r.prompt)] ?? null,
-      briefing: r.briefing ?? null,
-      dod: r.dod ?? [],
-      max_hops: r.max_hops ?? 3,
-      as_judge: r.as_judge === true,
-    })),
-    instantiated_at: Date.now(),
-  };
+  return {};
 }
 
killedBy: team/create 一键建团 默认场景：init 持久化 + tier0_prompt 组装 + 快照落盘
statusReason: expected undefined to be 'oss-maintenance' // Object.is equality

[Survived] EqualityOperator
src/runtime/template/template-loader.ts:163:17
       briefing: r.briefing ?? null,
       dod: r.dod ?? [],
       max_hops: r.max_hops ?? 3,
-      as_judge: r.as_judge === true,
+      as_judge: r.as_judge !== true,
     })),
     instantiated_at: Date.now(),

[Killed] StringLiteral
src/runtime/template/template-loader.ts:171:28
 
 /** 便捷：包内置只读模板目录（builtin 来源）。 */
 export function builtinScenarioDir(packageRoot: string): string {
-  return join(packageRoot, "templates", "oss-maintenance");
+  return join(packageRoot, "", "oss-maintenance");
 }
 
killedBy: 加载器拒绝语义 内置场景目录解析指向 templates/oss-maintenance
statusReason: expected '/pkg/root/oss-maintenance' to be '/pkg/root/templates/oss-maintenance' // Object.is equality

[Killed] StringLiteral
src/runtime/template/template-loader.ts:188:67
 export function loadTier0Playbook(packageRoot: string): Tier0Playbook {
   const path = join(packageRoot, PLAYBOOKS_DIR, TIER0_PLAYBOOK_FILE);
   const text = readFileSync(path, "utf8");
-  return { text, digest: createHash("sha256").update(text).digest("hex").slice(0, 16) };
+  return { text, digest: createHash("sha256").update(text).digest("").slice(0, 16) };
 }
 
killedBy: team/create 一键建团 默认场景：init 持久化 + tier0_prompt 组装 + 快照落盘
statusReason: .toMatch() expects to receive a string, but got object

[Killed] StringLiteral
src/runtime/template/template-loader.ts:205:33
 }
 
 /** 缺省场景名（入口/工具未指定时）。 */
-export const DEFAULT_SCENARIO = "oss-maintenance";
+export const DEFAULT_SCENARIO = "";
 /** 场景名安全形态：防路径拼接；目录存在性另行校验。 */
 export const SCENARIO_PATTERN = /^[a-z0-9-]+$/;
killedBy: team/create 一键建团 默认场景：init 持久化 + tier0_prompt 组装 + 快照落盘
statusReason: expected 400 to be 200 // Object.is equality

[Killed] EqualityOperator
src/runtime/template/template-loader.ts:246:42
   }
   const matches: Array<{ dir: string; source: TemplateSource }> = [];
   for (const root of roots) {
-    if (requestedSource !== undefined && root.source !== requestedSource) continue;
+    if (requestedSource !== undefined && root.source === requestedSource) continue;
     if (existsSync(join(root.dir, scenario, TEAM_FILE))) {
       matches.push({ dir: join(root.dir, scenario), source: root.source });
killedBy: 三级来源解析（ADR 0013） 指定 source 消歧：命中该层；该层缺失 → unknown-scenario
statusReason: expected 'project' to be 'user' // Object.is equality

[Killed] ConditionalExpression
src/runtime/template/template-loader.ts:247:9
   const matches: Array<{ dir: string; source: TemplateSource }> = [];
   for (const root of roots) {
     if (requestedSource !== undefined && root.source !== requestedSource) continue;
-    if (existsSync(join(root.dir, scenario, TEAM_FILE))) {
+    if (true) {
       matches.push({ dir: join(root.dir, scenario), source: root.source });
     }
killedBy: team/create 一键建团 默认场景：init 持久化 + tier0_prompt 组装 + 快照落盘
statusReason: expected 400 to be 200 // Object.is equality

[Killed] ConditionalExpression
src/runtime/template/template-loader.ts:257:7
     }
     return matches[0]!;
   }
-  if (matches.length === 0) {
+  if (true) {
     throw new Error(`unknown-scenario: no template "${scenario}"`);
   }
killedBy: team/create 一键建团 默认场景：init 持久化 + tier0_prompt 组装 + 快照落盘
statusReason: expected 400 to be 200 // Object.is equality

[Killed] ConditionalExpression
src/runtime/template/template-loader.ts:260:7
   if (matches.length === 0) {
     throw new Error(`unknown-scenario: no template "${scenario}"`);
   }
-  if (matches.length > 1) {
+  if (true) {
     const sources = matches.map((m) => m.source).join(",");
     throw new Error(`ambiguous-scenario: "${scenario}" exists in multiple sources (${sources})`);
killedBy: team/create 一键建团 默认场景：init 持久化 + tier0_prompt 组装 + 快照落盘
statusReason: expected 400 to be 200 // Object.is equality

[Killed] ArrayDeclaration
src/runtime/template/template-loader.ts:272:36
  * 各带 source 供 UI 角标；排序 = 三级固定序 + 同源名称字典序。
  */
 export function listScenarios(roots: ScenarioRoot[]): ScenarioEntry[] {
-  const entries: ScenarioEntry[] = [];
+  const entries: ScenarioEntry[] = ["Stryker was here"];
   for (const root of roots) {
     if (!existsSync(root.dir)) continue;
killedBy: 三级来源解析（ADR 0013） 枚举：三级实时扫描、同名多行并存、builtin→user→project 固定序
statusReason: expected [ 'builtin:oss-maintenance', …(6) ] to deeply equal [ 'builtin:oss-maintenance', …(5) ]

[Killed] ConditionalExpression
src/runtime/template/template-loader.ts:274:9
 export function listScenarios(roots: ScenarioRoot[]): ScenarioEntry[] {
   const entries: ScenarioEntry[] = [];
   for (const root of roots) {
-    if (!existsSync(root.dir)) continue;
+    if (true) continue;
     for (const entry of readdirSync(root.dir)) {
       if (!SCENARIO_PATTERN.test(entry)) continue;
killedBy: 三级来源解析（ADR 0013） 枚举：三级实时扫描、同名多行并存、builtin→user→project 固定序
statusReason: expected [] to deeply equal [ 'builtin', 'user', 'project' ]

[Killed] BooleanLiteral
src/runtime/template/template-loader.ts:277:11
     if (!existsSync(root.dir)) continue;
     for (const entry of readdirSync(root.dir)) {
       if (!SCENARIO_PATTERN.test(entry)) continue;
-      if (!existsSync(join(root.dir, entry, TEAM_FILE))) continue;
+      if (existsSync(join(root.dir, entry, TEAM_FILE))) continue;
       entries.push({ name: entry, source: root.source });
     }
killedBy: 场景枚举 列出全部 builtin 场景（oss-maintenance + research-report）带 source 标记
statusReason: expected [] to deeply equal [ …(2) ]

[Killed] ObjectLiteral
src/runtime/template/template-loader.ts:278:20
     for (const entry of readdirSync(root.dir)) {
       if (!SCENARIO_PATTERN.test(entry)) continue;
       if (!existsSync(join(root.dir, entry, TEAM_FILE))) continue;
-      entries.push({ name: entry, source: root.source });
+      entries.push({});
     }
   }
killedBy: 场景枚举 列出全部 builtin 场景（oss-maintenance + research-report）带 source 标记
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Survived] StringLiteral
src/runtime/template/template-loader.ts:296:16
  */
 export function resolveBuiltinScenarioDir(packageRoot: string, scenario: string): string {
   return resolveScenarioDir(
-    [{ source: "builtin", dir: builtinTemplatesRoot(packageRoot) }],
+    [{ source: "", dir: builtinTemplatesRoot(packageRoot) }],
     scenario,
   ).dir;
