[Killed] ArrayDeclaration
src/plugin/host.ts:203:25
     // 视图供数解析走 ForView 变体：子会话按成员 durable id 反查所属实例，
     // 使团队 tab 在成员会话页同样可用（#97 问题 3）；纯读路径。
     const teamHomeFor = (sessionId: string) => resolveTeamHomeForView(sessionId).teamHome;
-    for (const route of [
-      ...makeGateRoutes({ teamHomeFor }),
-      makeConsoleRoute(),
-      ...makeLaunchRoutes(),
-      makeOverviewRoute(teamHomeFor),
-    ]) {
+    for (const route of []) {
       disposers.push(ws.register(route));
     }
killedBy: 插件装配 webServer 在场时注册 Console/入口路由并订阅页面注入（#51）
statusReason: expected [] to include '/xiaozhuge/console'

[Survived] StringLiteral
src/plugin/host.ts:211:21
     ]) {
       disposers.push(ws.register(route));
     }
-    ctx.logger.info("[xiaozhuge] gate console + team launch routes registered");
+    ctx.logger.info("");
     // 输入框内「创建团队」按钮由客户端插件（dsh.client，src/client/）经
     // conversation.input.right 官方插槽渲染——不再做宿主页面 DOM 注入。
