[Killed] StringLiteral
src/plugin/team-home.ts:26:33
  * @param sessionId 主会话 id（dsh session id）。
  */
 export function resolveTeamHome(sessionId: string): string {
-  return join(resolveDshHome(), "xiaozhuge", "sessions", sessionId);
+  return join(resolveDshHome(), "", "sessions", sessionId);
 }
 
killedBy: team/create 一键建团 默认场景：init 持久化 + tier0_prompt 组装 + 快照落盘
statusReason: ENOENT: no such file or directory, open '/tmp/xzg-launch-o93yXI/dsh-home/xiaozhuge/sessions/s-default/team.yaml'

[Killed] ConditionalExpression
src/plugin/team-home.ts:47:7
  */
 export function resolveTeamHomeForView(sessionId: string): TeamHomeResolution {
   const direct = resolveTeamHome(sessionId);
-  if (existsSync(join(direct, "team.yaml"))) {
+  if (false) {
     return { teamHome: direct, membership: null };
   }
killedBy: resolveTeamHomeForView 主会话直查优先：team.yaml 在场 → membership=null
statusReason: expected { root_session: 's-root', …(1) } to be null

[Killed] BlockStatement
src/plugin/team-home.ts:47:46
  */
 export function resolveTeamHomeForView(sessionId: string): TeamHomeResolution {
   const direct = resolveTeamHome(sessionId);
-  if (existsSync(join(direct, "team.yaml"))) {
-    return { teamHome: direct, membership: null };
-  }
+  if (existsSync(join(direct, "team.yaml"))) {}
   const sessionsDir = join(resolveDshHome(), "xiaozhuge", "sessions");
   let entries: string[] = [];
killedBy: resolveTeamHomeForView 主会话直查优先：team.yaml 在场 → membership=null
statusReason: expected { root_session: 's-root', …(1) } to be null

[Killed] StringLiteral
src/plugin/team-home.ts:50:46
   if (existsSync(join(direct, "team.yaml"))) {
     return { teamHome: direct, membership: null };
   }
-  const sessionsDir = join(resolveDshHome(), "xiaozhuge", "sessions");
+  const sessionsDir = join(resolveDshHome(), "", "sessions");
   let entries: string[] = [];
   try {
killedBy: resolveTeamHomeForView 子会话反查命中：durableId 匹配成员 → 返回归属实例与成员名
statusReason: expected null to deeply equal { root_session: 's-root', …(1) }

[Killed] StringLiteral
src/plugin/team-home.ts:50:59
   if (existsSync(join(direct, "team.yaml"))) {
     return { teamHome: direct, membership: null };
   }
-  const sessionsDir = join(resolveDshHome(), "xiaozhuge", "sessions");
+  const sessionsDir = join(resolveDshHome(), "xiaozhuge", "");
   let entries: string[] = [];
   try {
killedBy: team/status 团队会话探测 成员子会话反查命中 → is_team=true 且附归属（#97 问题 3）
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
src/plugin/team-home.ts:57:12
     // 排序保证极端情况下行为可复现）。
     entries = readdirSync(sessionsDir).sort();
   } catch {
-    return { teamHome: direct, membership: null };
+    return {};
   }
   for (const entry of entries) {
killedBy: team/status 团队会话探测 未初始化 is_team=false；建团后 true 并带 name/digest
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ConditionalExpression
src/plugin/team-home.ts:62:9
   for (const entry of entries) {
     const teamHome = join(sessionsDir, entry);
     const agentsJson = join(teamHome, "agents.json");
-    if (!existsSync(agentsJson) || !existsSync(join(teamHome, "team.yaml"))) continue;
+    if (false) continue;
     try {
       const reg = JSON.parse(readFileSync(agentsJson, "utf8")) as {
killedBy: resolveTeamHomeForView 成员所在实例未初始化（team.yaml 不在）→ 不命中，membership=null
statusReason: expected { root_session: 's-root', …(1) } to be null

[Killed] LogicalOperator
src/plugin/team-home.ts:62:9
   for (const entry of entries) {
     const teamHome = join(sessionsDir, entry);
     const agentsJson = join(teamHome, "agents.json");
-    if (!existsSync(agentsJson) || !existsSync(join(teamHome, "team.yaml"))) continue;
+    if (!existsSync(agentsJson) && !existsSync(join(teamHome, "team.yaml"))) continue;
     try {
       const reg = JSON.parse(readFileSync(agentsJson, "utf8")) as {
killedBy: resolveTeamHomeForView 成员所在实例未初始化（team.yaml 不在）→ 不命中，membership=null
statusReason: expected { root_session: 's-root', …(1) } to be null

[Killed] ConditionalExpression
src/plugin/team-home.ts:68:13
         members?: Record<string, { durableId?: string; member?: string }>;
       };
       for (const m of Object.values(reg.members ?? {})) {
-        if (m.durableId === sessionId && typeof m.member === "string") {
+        if (false) {
           return { teamHome, membership: { root_session: entry, member: m.member } };
         }
killedBy: resolveTeamHomeForView 子会话反查命中：durableId 匹配成员 → 返回归属实例与成员名
statusReason: expected null to deeply equal { root_session: 's-root', …(1) }
