[Killed] ConditionalExpression
src/plugin/team-launch.ts:87:13
         const view = resolveTeamHomeForView(sessionId);
         const l = layout(view.teamHome);
         // 团队会话判定：实例根已初始化（team.yaml 快照在场）。
-        if (!existsSync(l.teamYaml)) {
+        if (false) {
           writeJson(res, 200, { is_team: false });
           return;
killedBy: team/status 团队会话探测 未初始化 is_team=false；建团后 true 并带 name/digest
statusReason: expected true to be false // Object.is equality

[NoCoverage] ConditionalExpression
src/plugin/team-launch.ts:107:17
             is_team: true,
             name: null,
             playbook_digest: null,
-            ...(view.membership !== null ? { membership: view.membership } : {}),
+            ...(true ? { membership: view.membership } : {}),
           });
         }

[Killed] BlockStatement
src/plugin/team-launch.ts:121:34
           return;
         }
         // 安全最小集：与 Gate Console 同款双头断言（复用同一实现）。
-        if (!originAllowed(req)) {
-          writeJson(res, 403, { error: "forbidden: missing or cross-origin Origin header" });
-          return;
-        }
+        if (!originAllowed(req)) {}
         if (!fetchSiteAllowed(req)) {
           writeJson(res, 403, { error: "forbidden: cross-site Sec-Fetch-Site" });
killedBy: team/create 一键建团 缺 session 参数 400；无 Origin POST 403；SFS 跨站 403
statusReason: expected 200 to be 403 // Object.is equality

[Killed] ConditionalExpression
src/plugin/team-launch.ts:125:13
           writeJson(res, 403, { error: "forbidden: missing or cross-origin Origin header" });
           return;
         }
-        if (!fetchSiteAllowed(req)) {
+        if (true) {
           writeJson(res, 403, { error: "forbidden: cross-site Sec-Fetch-Site" });
           return;
killedBy: team/create 一键建团 默认场景：init 持久化 + tier0_prompt 组装 + 快照落盘
statusReason: expected 403 to be 200 // Object.is equality

[Killed] EqualityOperator
src/plugin/team-launch.ts:137:15
             workspace?: string;
             instance_note?: string;
           };
-          if (typeof body.session !== "string" || body.session.length === 0) {
+          if (typeof body.session === "string" || body.session.length === 0) {
             writeJson(res, 400, { error: "session required" });
             return;
killedBy: team/create 一键建团 默认场景：init 持久化 + tier0_prompt 组装 + 快照落盘
statusReason: expected 400 to be 200 // Object.is equality
